[
  {
    "subject": "AMSL",
    "number": "1101",
    "title": "Elementary ASL 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10080" },
      { "term": "202310", "crn": "13407" },
      { "term": "202310", "crn": "10903" },
      { "term": "202310", "crn": "19741" },
      { "term": "202240", "crn": "41482" }
    ],
    "description": "Introduces students to American Sign Language (ASL). Students develop expressive and receptive competence in using ASL to fulfill various social functions (such as introductions, explanations of personal history, and descriptions of simple narratives). Additional topics include the use of signing space and further use of nonmanual components including facial expression and body postures.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "AMSL",
    "number": "1102",
    "title": "Elementary ASL 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13597" },
      { "term": "202310", "crn": "10076" }
    ],
    "description": "Continues AMSL 1101. Continues development of expressive and receptive competence in using American Sign Language to fulfill various social functions (such as introductions, explanations of personal history, and descriptions of simple narratives). Emphasizes further development of receptive and expressive skills, finger spelling, vocabulary building, grammatical structures; encourages more extensive use of nonmanual behaviors, classifiers, body postures, and signing space. Students are also introduced to regional and ethnic sign variations and political and educational institutions of the Deaf community.",
    "coreqs": [],
    "prereqs": [{ "subject": "AMSL", "number": "1101" }]
  },
  {
    "subject": "AMSL",
    "number": "2101",
    "title": "Intermediate ASL 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14068" }],
    "description": "Continues the student&amp;#8217;s development of expressive and receptive competence in using American Sign Language to fulfill various communicative functions, such as making and responding to inquiries, constructing and comprehending narratives, and engaging in debates. Students also continue to expand their ASL lexicon.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "AMSL",
    "number": "2102",
    "title": "Intermediate ASL 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14842" }],
    "description": "Continues AMSL 2101. Emphasizes further development of receptive and expressive skills, finger spelling, vocabulary building, grammatical structures; encourages more extensive use of nonmanual behaviors, classifiers, body postures, and signing space. Continues exposure to regional and ethnic sign variations and political and educational institutions of Deaf people. Offers intensive practice involving expressive and receptive skills in storytelling and dialogue. Introduces language forms used in American Sign Language poetry and the features of culture as they are displayed in art.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "AMSL",
    "number": "3101",
    "title": "Advanced ASL 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10036" }],
    "description": "Focuses on continued development of syntactic competence in American Sign Language with particular attention to the use of ASL in formal discourse. Also focuses on lexical semantics and semantic equivalents for multiple meaning English lexical items.",
    "coreqs": [],
    "prereqs": [{ "subject": "AMSL", "number": "2102" }]
  },
  {
    "subject": "AMSL",
    "number": "4992",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20273" }],
    "description": "Offers students a way of going beyond work given in the regular curriculum; may also enable students to complete major requirements in certain situations. Priority is given to American Sign Language majors and to juniors and seniors. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  }
]
