[
  {
    "subject": "BUSN",
    "number": "1101",
    "title": "Introduction to Business",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10279" },
      { "term": "202310", "crn": "10253" },
      { "term": "202310", "crn": "10252" },
      { "term": "202310", "crn": "10251" },
      { "term": "202310", "crn": "10250" },
      { "term": "202310", "crn": "10249" },
      { "term": "202310", "crn": "10247" },
      { "term": "202310", "crn": "10026" },
      { "term": "202310", "crn": "10025" },
      { "term": "202310", "crn": "10031" },
      { "term": "202310", "crn": "10085" },
      { "term": "202310", "crn": "11119" },
      { "term": "202310", "crn": "11120" },
      { "term": "202310", "crn": "11121" },
      { "term": "202310", "crn": "11122" },
      { "term": "202310", "crn": "17535" },
      { "term": "202310", "crn": "17550" },
      { "term": "202310", "crn": "18152" },
      { "term": "202260", "crn": "60910" },
      { "term": "202240", "crn": "41715" },
      { "term": "202330", "crn": "31011" },
      { "term": "202330", "crn": "31012" },
      { "term": "202330", "crn": "31045" },
      { "term": "202330", "crn": "31046" },
      { "term": "202330", "crn": "31086" },
      { "term": "202330", "crn": "31087" },
      { "term": "202330", "crn": "31102" },
      { "term": "202330", "crn": "32903" },
      { "term": "202330", "crn": "31242" },
      { "term": "202330", "crn": "31484" },
      { "term": "202330", "crn": "31821" },
      { "term": "202330", "crn": "31822" },
      { "term": "202330", "crn": "36663" },
      { "term": "202330", "crn": "36664" },
      { "term": "202330", "crn": "36665" },
      { "term": "202330", "crn": "36666" }
    ],
    "description": "Blends theoretical principles with real-life application. Introduces the fundamentals of launching, growing, and managing a business venture in today’s dynamic and increasingly global environment. Examines concepts within multiple academic disciplines and from multiple perspectives—including marketing, technology, finance, accounting, information systems, people, and culture—and then applies them to new ventures within varied types of organizations. Offers students an opportunity to develop an entrepreneurial skill set and mind-set through the development of the critical thinking, innovative decision making, problem solving, and team building needed for any business, large or small.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "1102",
    "title": "Personal Skill Development for Business",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11355" },
      { "term": "202310", "crn": "11356" },
      { "term": "202310", "crn": "11357" },
      { "term": "202310", "crn": "11358" },
      { "term": "202310", "crn": "11360" },
      { "term": "202310", "crn": "17211" },
      { "term": "202310", "crn": "16922" },
      { "term": "202310", "crn": "17212" },
      { "term": "202310", "crn": "17213" },
      { "term": "202310", "crn": "17568" },
      { "term": "202310", "crn": "17569" },
      { "term": "202310", "crn": "17570" },
      { "term": "202310", "crn": "17571" },
      { "term": "202310", "crn": "19846" },
      { "term": "202310", "crn": "19847" },
      { "term": "202310", "crn": "19848" },
      { "term": "202310", "crn": "19849" },
      { "term": "202310", "crn": "19850" },
      { "term": "202310", "crn": "19851" },
      { "term": "202310", "crn": "19852" },
      { "term": "202310", "crn": "20983" },
      { "term": "202310", "crn": "20984" },
      { "term": "202330", "crn": "36678" },
      { "term": "202330", "crn": "36679" },
      { "term": "202330", "crn": "36667" },
      { "term": "202330", "crn": "36668" },
      { "term": "202330", "crn": "36669" },
      { "term": "202330", "crn": "36670" },
      { "term": "202330", "crn": "36671" },
      { "term": "202330", "crn": "36672" },
      { "term": "202330", "crn": "36673" },
      { "term": "202330", "crn": "36674" },
      { "term": "202330", "crn": "36675" },
      { "term": "202330", "crn": "36676" }
    ],
    "description": "Offers first-year students in the D'Amore-McKim School of Business (DMSB) an opportunity to achieve a better understanding of themselves as students and as future professionals. Explores self-analysis, leadership traits and styles, diversity and cultural awareness, professionalism, emotional intelligence, and ethics. Encourages students to draw connections among classroom education, extracurricular activities, and practical experiences and to identify how each component fits into the pursuit of their individual goals.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "1103",
    "title": "Professional Development for Business Co-op",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14814" },
      { "term": "202310", "crn": "14815" },
      { "term": "202310", "crn": "14816" },
      { "term": "202310", "crn": "14817" },
      { "term": "202310", "crn": "14819" },
      { "term": "202310", "crn": "14820" },
      { "term": "202310", "crn": "14821" },
      { "term": "202310", "crn": "14822" },
      { "term": "202310", "crn": "14823" },
      { "term": "202310", "crn": "14824" },
      { "term": "202310", "crn": "14825" },
      { "term": "202310", "crn": "14826" },
      { "term": "202310", "crn": "14827" },
      { "term": "202310", "crn": "14828" },
      { "term": "202310", "crn": "14818" },
      { "term": "202310", "crn": "14829" },
      { "term": "202310", "crn": "14955" },
      { "term": "202310", "crn": "19285" },
      { "term": "202310", "crn": "14956" },
      { "term": "202310", "crn": "16512" },
      { "term": "202310", "crn": "19286" },
      { "term": "202310", "crn": "19287" },
      { "term": "202310", "crn": "19288" },
      { "term": "202310", "crn": "19289" },
      { "term": "202310", "crn": "19290" },
      { "term": "202310", "crn": "19291" },
      { "term": "202310", "crn": "19292" },
      { "term": "202310", "crn": "19293" },
      { "term": "202310", "crn": "19294" },
      { "term": "202310", "crn": "19295" },
      { "term": "202310", "crn": "19296" },
      { "term": "202310", "crn": "19297" },
      { "term": "202310", "crn": "19298" },
      { "term": "202310", "crn": "19299" },
      { "term": "202310", "crn": "19300" },
      { "term": "202310", "crn": "19302" },
      { "term": "202310", "crn": "19303" },
      { "term": "202310", "crn": "19304" },
      { "term": "202330", "crn": "33459" },
      { "term": "202330", "crn": "33802" },
      { "term": "202330", "crn": "33803" },
      { "term": "202330", "crn": "33804" },
      { "term": "202330", "crn": "33805" },
      { "term": "202330", "crn": "33806" },
      { "term": "202330", "crn": "33807" },
      { "term": "202330", "crn": "33808" },
      { "term": "202330", "crn": "33809" },
      { "term": "202330", "crn": "33810" },
      { "term": "202330", "crn": "33811" },
      { "term": "202330", "crn": "34778" },
      { "term": "202330", "crn": "34779" },
      { "term": "202330", "crn": "34781" },
      { "term": "202330", "crn": "34782" },
      { "term": "202330", "crn": "36634" },
      { "term": "202330", "crn": "36635" },
      { "term": "202330", "crn": "36636" },
      { "term": "202330", "crn": "38108" }
    ],
    "description": "Enrollment in this section is limited to D'Amore-McKim students with concentrations in ACCOUNTING.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "3110",
    "title": "The Consulting Environment",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14013" }],
    "description": "Seeks to provide students with a framework and the fundamentals that allow them to understand the field of consulting in addition to a way of thinking for jobs in the consulting and other highly competitive careers. Focuses on the analysis of complex business situations using caselets and cases and provides frameworks as the basis for analysis and critical thinking in pressure situations. In addition, various articles, white papers, business case studies, and other consulting practices are shared with the students enrolled in the course as well as professionals with industry experience providing insights as visiting guest speakers.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "5965",
    "title": "Engaging with Industry Partners for Rising Professionals",
    "scheduleType": "Seminar",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202260", "crn": "61528" },
      { "term": "202330", "crn": "37639" }
    ],
    "description": "Offers students an enhanced applied project setting in which to apply their curricular learning. Working with a partner sponsor, students refine an applied research topic, perform research, develop recommendations that are shared with the partner sponsor, and create a plan for implementing their recommendations. Curriculum supports students as they develop key business communication skills, project and client management skills, and frameworks for business analysis. Offers students an opportunity to learn from sponsor feedback, review lessons learned, and incorporate suggestions to improve and further hone their career development and professional plan. Career development opportunities through skill-building workshops, panels, and interview preparation are available. Partner-student interactions, including a culminating project presentation, allow partners to assess student potential for co-op, internship, or other employment opportunities with the partner.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6200",
    "title": "Career Management",
    "scheduleType": "Seminar",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11882" },
      { "term": "202310", "crn": "15784" },
      { "term": "202310", "crn": "18136" },
      { "term": "202310", "crn": "18165" },
      { "term": "202310", "crn": "11126" },
      { "term": "202330", "crn": "31747" },
      { "term": "202330", "crn": "30609" },
      { "term": "202330", "crn": "34813" },
      { "term": "202330", "crn": "36900" },
      { "term": "202330", "crn": "36907" },
      { "term": "202310", "crn": "21705" }
    ],
    "description": "Required for the Co-op MBA program. Begins with an introduction to the career planning process and to the services of the MBA Career Center. Topics include résumé writing, videotaped practice interviewing, job search strategies, interview preparation, salary negotiation, marketing communication, and visa issues for international students seeking employment in the United States. May include additional topics depending on student interest. Requires admission to co-op MBA program. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6324",
    "title": "Predictive Analytics for Managers",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "21086" }],
    "description": "Presents the concepts of correlation and simple linear regression analysis as well as multiple regression analysis. Offers students an opportunity to build multiple regression models and use them in forecasting and analyzing data. Exposes students to nonlinear regression models, reading and analyzing output tables, and using statistical software tools.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6343",
    "title": "Sharing Economy, Crowdsourcing, and Digital Business Transformation",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38109" }],
    "description": "Explores how a highly connected world driven by technological advances fuels a digital transformation centered around networks, crowds, and markets. Covers network effects and 'rich-get-richer' phenomena; business models and strategies for multisided markets and platforms; crowdsourcing and online labor markets; sharing economy; and new ways organizations become innovative by tapping into expertise outside firms' boundaries. Discusses business cases from industries including Uber/Lyft, Airbnb, Kickstarter, Amazon’s Mechanical Turk, Upwork, Etsy, eBay, InnoCentive, and TopCoder. Explicitly addresses possible negative consequences. Explores critical risks such as bias and inequality due to deregulation, social and algorithm-based discrimination, and an overall critique of growth-based business models. Offers students an opportunity to hone their skills to spearhead game-changing digital initiatives to learn how to manage others in the wake of disruptive changes."
  },
  {
    "subject": "BUSN",
    "number": "6344",
    "title": "The Fintech Revolution",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "21092" }],
    "description": "Uses case studies and illustrations to explore the key major innovations that are revolutionizing and driving opportunities in fintech. Topics may include payments: payment processing, transfers, rewards; blockchain: digital currency, smart contracts, DLT, trading; investments: Robo Advisors, investment management; planning: retirement planning, education planning; lending: crowdfunding, P-2-P lending, alternative money-raising platforms; insurance: underwriting, comparison platforms; big data and analytics: AI and big data solutions, alternative data; security: cybersecurity, authentication, encryption. Also discusses business models and opportunities in fintech, including the evolution of fintech and the current state of the art; case studies of successful business models in fintech startups; key things that differentiate a successful fintech company; and best practices and tips when working on a fintech idea.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6351",
    "title": "Experiential Education",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "33465" },
      { "term": "202330", "crn": "33466" },
      { "term": "202330", "crn": "33467" },
      { "term": "202310", "crn": "21816" },
      { "term": "202310", "crn": "21817" },
      { "term": "202310", "crn": "21818" }
    ],
    "description": "Consists of various experiential learning opportunities that are approved by the faculty of the D'Amore-McKim School of Business for full-time MBA students."
  },
  {
    "subject": "BUSN",
    "number": "6363",
    "title": "Social Impact of Business",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13777" },
      { "term": "202310", "crn": "13778" }
    ],
    "description": "Explores how business practices affect society and how society affects business practices. Addresses topics such as social impact investing, sustainable supply chains, corporate social responsibility, social entrepreneurship, and global perspectives on corporate citizenship. Business and society have never been more intertwined. Executives are increasingly called upon to consider the larger societal impacts of their decisions and at the same time find themselves subject to demands from multiple societal stakeholders that include customers, suppliers, employees, governments, and interest groups, among others.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6365",
    "title": "Business Analytics",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [
      { "term": "202260", "crn": "60577" },
      { "term": "202260", "crn": "61056" },
      { "term": "202330", "crn": "33369" }
    ],
    "description": "Provides an overview of data collection, organization, analysis, interpretation, and presentation techniques used by contemporary organizations. Students use multiple software tools to collect, prepare, manage, analyze, evaluate, understand, critique, visualize, and present data sets of various types. Offers students an opportunity to obtain essential skills, tools, and techniques required to understand data sets, both large and small, from sources internal and external to an organization. This understanding can then be used to support datacentric decision making and create a measurable improvement in business performance. Businesses run on data, and employees at all levels must know how to properly use and interpret data to support their roles within a company.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6366",
    "title": "International Corporate Governance and Strategic Thinking",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38110" }],
    "description": "Introduces key concepts in strategic corporate governance. Offers students an opportunity to use these concepts to understand the different economic, social, and political contexts across advanced industrial and emerging economies. Describes key aspects of corporate governance systems in a number of different countries and analyzes the strengths and weaknesses of these systems in comparison. Examines the importance of social and political factors in shaping different models of firm organization across countries and how new governance practices and institutional norms develop in response to changes in the real world of business management."
  },
  {
    "subject": "BUSN",
    "number": "6374",
    "title": "Creating Shared Value as a Way of Life",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202240", "crn": "41446" }],
    "description": "Designed to empower students with a holistic toolkit to make “creating shared value” a way of life as a social innovator, entrepreneur, and strategist who is prepared to tackle the challenges of the 21st century. Offers students an opportunity to be exposed to and practice the concepts of business policy by assuming the role of a strategist analyzing the strategic context of a company/venture at a point in time.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6375",
    "title": "Designing 21st-Century Business Organizations",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "21088" },
      { "term": "202240", "crn": "41447" }
    ],
    "description": "Addresses the question: What is the most effective organizational design (or designs) for meeting the challenges of the 21st century? Describes a process for designing an organization, along with some of the key challenges associated with organizational design. Reviews the design options available historically, as well as designs that are more popular in recent years. Asks students to justify their own conclusions about which organizational design is best suited to meet the requirements and challenges facing business organizations today.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6376",
    "title": "The Business Case for Social and Economic Justice",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "21089" }],
    "description": "Examines how strategic business decisions are made and governing policies established in today's changing corporate environment. Discusses whether it is advisable for CEOs to “take a stand” on behalf of their company and their employees when fundamental shared values and a company's purpose or mission are at stake. After a grounding in business governance theory and history, students debate whether CEOs should speak openly on controversial public issues. One can make the case that a CEO taking a position on one side of a public issue is a significant strategic risk. Conversely, stakeholders are increasingly demanding that business leaders publicly take positions and change business practices to align with those values.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6377",
    "title": "Learning from Crisis:Toward Sustainability and Resilience",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "21091" }],
    "description": "Highlights the importance of public-private sector interconnections and systemic partnerships within communities to promote resilience and enable progress toward sustainable development, such as those promoted by the United Nations Sustainable Development Goals (UN SDGs). Covers the nexus between resilience, sustainable development, and the impact of crises on societies and multinational corporations. Includes both conceptual material and examples. Includes a case study competition where students are presented with a challenge scenario and then asked to provide a presentation where they think creatively about how firms and communities can have a reciprocal relationship toward sustainable development and resilience.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6945",
    "title": "Washington Campus Seminar",
    "scheduleType": "Off-campus instruction w/ lec",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11907" },
      { "term": "202330", "crn": "31125" }
    ],
    "description": "Offers a weeklong educational residency in Washington, D.C., where students meet with members of Congress, current and former executive branch officials, senior civil servants, business executives, lobbyists, representatives of the media, and special-interest groups. Offers students an opportunity to understand how Washington works, how legislative and regulatory changes impact their business futures, and what new business opportunities may evolve as the result of federal policy priorities and decisions. The residency seeks to offer unparalleled insight into the process of government, with the goal of enabling top business leaders to contribute ethically and effectively to the policy debate, influence policy outcomes, and leverage their understanding of policy trends to developing new business opportunities.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6950",
    "title": "MBA Skills Workshop",
    "scheduleType": "Lecture",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11376" }],
    "description": "Continues the full-time MBA orientation program. Offers students an opportunity to develop the management skills necessary to become effective managers, including communication skills, qualitative and quantitative business analysis, and ethics and values.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6954",
    "title": "Co-op Work Experience - Half-Time",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17060" },
      { "term": "202310", "crn": "18593" },
      { "term": "202260", "crn": "60994" },
      { "term": "202240", "crn": "41297" },
      { "term": "202330", "crn": "38028" }
    ],
    "description": "Provides eligible students with an opportunity for work experience. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "BUSN",
    "number": "6964",
    "title": "Co-op Work Experience",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "37064" },
      { "term": "202330", "crn": "37967" },
      { "term": "202310", "crn": "21823" }
    ],
    "description": "Provides eligible students with an opportunity for work experience. May be repeated up to five times."
  },
  {
    "subject": "BUSN",
    "number": "7976",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202260", "crn": "61416" }],
    "description": "Offers independent work under the direction of members of the department on chosen topics. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  }
]
