[
  {
    "subject": "ECON",
    "number": "1000",
    "title": "Economics at Northeastern",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10460" }],
    "description": "Intended for freshmen in the College of Social Sciences and Humanities. Introduces freshmen to the liberal arts in general; familiarizes them with their major; helps them develop the academic skills necessary to succeed (analytical ability and critical thinking); provides grounding in the culture and values of the University community; and helps them develop interpersonal skills&amp;#8212;in short, familiarizes students with all skills needed to become a successful university student.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1115",
    "title": "Principles of Macroeconomics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "SI"],
    "sections": [
      { "term": "202310", "crn": "10459" },
      { "term": "202310", "crn": "10435" },
      { "term": "202310", "crn": "10434" },
      { "term": "202310", "crn": "13237" },
      { "term": "202310", "crn": "13367" },
      { "term": "202310", "crn": "14344" },
      { "term": "202310", "crn": "20499" },
      { "term": "202310", "crn": "21078" },
      { "term": "202310", "crn": "21087" },
      { "term": "202260", "crn": "60037" },
      { "term": "202260", "crn": "60603" },
      { "term": "202260", "crn": "60928" },
      { "term": "202240", "crn": "40966" },
      { "term": "202240", "crn": "40217" },
      { "term": "202240", "crn": "40765" },
      { "term": "202240", "crn": "40766" }
    ],
    "description": "Not open to freshmen.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1116",
    "title": "Principles of Microeconomics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "SI"],
    "sections": [
      { "term": "202310", "crn": "10457" },
      { "term": "202310", "crn": "14092" },
      { "term": "202310", "crn": "15334" },
      { "term": "202310", "crn": "15431" },
      { "term": "202310", "crn": "17252" },
      { "term": "202310", "crn": "19006" },
      { "term": "202310", "crn": "20409" },
      { "term": "202310", "crn": "20487" },
      { "term": "202310", "crn": "20565" },
      { "term": "202260", "crn": "60036" },
      { "term": "202260", "crn": "60492" },
      { "term": "202260", "crn": "61240" },
      { "term": "202240", "crn": "40970" },
      { "term": "202240", "crn": "40218" },
      { "term": "202240", "crn": "40231" },
      { "term": "202240", "crn": "40579" }
    ],
    "description": "Not open to Freshmen.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1125",
    "title": "Recitation for ECON 1115",
    "scheduleType": "Recitation/Discussion",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17273" },
      { "term": "202310", "crn": "15531" },
      { "term": "202310", "crn": "17280" },
      { "term": "202310", "crn": "15530" },
      { "term": "202310", "crn": "11387" },
      { "term": "202310", "crn": "11287" },
      { "term": "202310", "crn": "11288" },
      { "term": "202310", "crn": "15532" },
      { "term": "202310", "crn": "15670" },
      { "term": "202310", "crn": "11386" }
    ],
    "description": "Required ONLY for students registered for ECON 1115 with PETER SIMON.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1126",
    "title": "Recitation for ECON 1116",
    "scheduleType": "Recitation/Discussion",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13250" },
      { "term": "202310", "crn": "13251" },
      { "term": "202310", "crn": "15598" },
      { "term": "202310", "crn": "11486" },
      { "term": "202310", "crn": "15533" },
      { "term": "202310", "crn": "15599" },
      { "term": "202310", "crn": "15600" },
      { "term": "202310", "crn": "11783" },
      { "term": "202310", "crn": "12671" },
      { "term": "202310", "crn": "12672" },
      { "term": "202310", "crn": "15601" },
      { "term": "202310", "crn": "15602" },
      { "term": "202310", "crn": "17286" },
      { "term": "202310", "crn": "17287" }
    ],
    "description": "Required ONLY for students registered for ECON 1116 with FRANCIS GEORGES.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1230",
    "title": "Healthcare and Medical Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16366" }],
    "description": "Enables students to recognize the relevance of economics to health and medical care and apply economic reasoning to understand health-related issues better; to understand the mechanism of healthcare delivery in the United States within  broad social, political, and economic contexts; to explore the changing nature of health and medical care and its implications for medical practice, medical education and research, and health policy; and to analyze public policy in health and medical care from an economic perspective.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1240",
    "title": "Economics of Crime",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [
      { "term": "202310", "crn": "19007" },
      { "term": "202260", "crn": "60741" }
    ],
    "description": "Covers economic analysis of crime and the criminal justice system. Topics include theoretical and empirical analysis of the economic causes of criminal behavior, the social costs of crime and its prevention, and the design of enforcement policies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1245",
    "title": "Economics of Inequality",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20213" }],
    "description": "Introduces inequality from an economic perspective. Studies how inequality relates to scarcity, appropriability, and inheritability. Discusses how taxation, economic growth, globalization, and technological progress affect inequality. Emphasizes the difference between inequality of economic outcomes and inequality of economic opportunity. Covers inequality in sectors such as housing, healthcare, labor market, and others. Discusses alternative empirical methods for measuring inequality, and presents economic policies designed to address it.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1260",
    "title": "Contested Issues in the U.S. Economy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "14093" },
      { "term": "202240", "crn": "40396" }
    ],
    "description": "Covers many of the contested economic issues that the United States faces as a nation&amp;#8212;the size of government, the national debt, the war on drugs, national healthcare, taxation, and many more. An important social system in any society is the economic system&amp;#8212;the allocation of scarce resources. In the large and complex economy of the United States, there is controversy over what goods and services are produced and how they are distributed. To understand the nature and causes of these issues requires a course where theory is a tool of analysis, not the focus. Economics is not value free. Attention is given to the role of ethics and how our moral values shape policy. Course topics vary from semester to semester.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1291",
    "title": "Development Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202310", "crn": "11976" }],
    "description": "Explores social and economic development around the world. Topics include income, poverty, inequality, human development, geography, growth, impact evaluation, health, education, financial markets, trade, and gender inequality. Analyzes four key elements of economic development: income, poverty, inequality, and human development. Offers students an opportunity to understand the determinants of economic growth. Focuses on major policy issues concerning health, education, credit, savings, gender differences, and globalization. Studies which interventions worked and which did not. Exposes students to readings and perspectives from several academic disciplines. Emphasizes one unifying methodological theme: the usefulness of empirical economic tools in assessing the arguments presented in debates about development.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1711",
    "title": "Economics of Sustainability",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16368" },
      { "term": "202240", "crn": "40893" }
    ],
    "description": "Studies the significance of behavioral assumptions on economic outcomes and social norms, specifically as these relate to the perceived value of resources and the broader ecosystem. Explores the importance of economic concepts such as externalities and elasticity in relation to a market-driven economy, price, and consumption behavior. Through the use of elementary life cycle analysis, introduces both the definition and responsibilities of the rational agent as these relate to the establishment of sustainable outcomes. Offers students an opportunity to articulate the relationship between economic growth and climate change and reconcile the historical relationship between social values and sustainable outcomes.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "1916",
    "title": "Economics of Conflict",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19008" }],
    "description": "Covers selected topic matter in the field of microeconomics. The specific topic is chosen by the instructor. May be repeated up to three times.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "2315",
    "title": "Macroeconomic Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "SI"],
    "sections": [
      { "term": "202310", "crn": "10452" },
      { "term": "202310", "crn": "10945" },
      { "term": "202310", "crn": "11812" },
      { "term": "202310", "crn": "14889" },
      { "term": "202310", "crn": "19009" },
      { "term": "202310", "crn": "19010" },
      { "term": "202260", "crn": "60239" },
      { "term": "202240", "crn": "40242" }
    ],
    "description": "Presents several theoretical approaches to the study of short-run economic instability and long-run growth. Uses conceptual and mathematical tools to examine what economists believe to be the major determinants of fluctuations in employment and price level, as well as the rate of economic growth. Uses theoretical models to evaluate the operation and impact of various macroeconomic policy tools. Focuses on issues of social justice.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "2316",
    "title": "Microeconomic Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND"],
    "sections": [
      { "term": "202310", "crn": "11782" },
      { "term": "202310", "crn": "11977" },
      { "term": "202310", "crn": "14890" },
      { "term": "202310", "crn": "14891" },
      { "term": "202310", "crn": "16884" },
      { "term": "202310", "crn": "20034" },
      { "term": "202310", "crn": "20299" },
      { "term": "202260", "crn": "60210" },
      { "term": "202240", "crn": "40219" },
      { "term": "202240", "crn": "40768" }
    ],
    "description": "Builds on ECON 1116. Examines the behavior of consumers and firms under several different market structures, including monopoly, oligopoly, monopolistic competition, and perfect competition. Covers sources of market failure, such as public goods, externalities, and information asymmetry. Exposes students to key analytical tools economists use to understand a wide range of social issues, including income inequality, poverty, and race. Uses calculus-based methods to extend students&rsquo; existing knowledge of microeconomics.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ECON", "number": "1116" },
      "And",
      "(",
      { "subject": "MATH", "number": "1231" },
      "Or",
      { "subject": "MATH", "number": "1241" },
      "Or",
      { "subject": "MATH", "number": "1242" },
      "Or",
      { "subject": "MATH", "number": "1245" },
      "Or",
      { "subject": "MATH", "number": "1251" },
      "Or",
      { "subject": "MATH", "number": "1340" },
      "Or",
      { "subject": "MATH", "number": "1341" },
      "Or",
      { "subject": "MATH", "number": "1342" },
      ")"
    ]
  },
  {
    "subject": "ECON",
    "number": "2350",
    "title": "Statistics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [
      { "term": "202310", "crn": "17929" },
      { "term": "202310", "crn": "13526" },
      { "term": "202310", "crn": "14892" },
      { "term": "202260", "crn": "60457" },
      { "term": "202240", "crn": "41414" },
      { "term": "202240", "crn": "40894" },
      { "term": "202240", "crn": "41824" }
    ],
    "description": "Discusses basic probability, descriptive statistics, estimation techniques, statistical hypotheses, sampling, analysis of variance, correlation, and regression analysis in the context of economics. Computer applications are an integral part of the course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "2560",
    "title": "Applied Econometrics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "WI"],
    "sections": [
      { "term": "202310", "crn": "13144" },
      { "term": "202310", "crn": "13145" },
      { "term": "202310", "crn": "13249" },
      { "term": "202310", "crn": "15298" },
      { "term": "202260", "crn": "60374" },
      { "term": "202240", "crn": "40458" }
    ],
    "description": "Examines research methods used by practicing economists. Discusses typical problems from applied areas of economics including choice of modeling framework, problems of data collection, review of estimation techniques, interpretation of results, and development of static and dynamic adaptive policy models. A research paper utilizing computer applications is an integral part of the course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3290",
    "title": "History of the Global Economy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202310", "crn": "19011" }],
    "description": "Covers ideological biases in economics; the extent of global disparities around 1800; evolution of global disparities since 1800; evolution of international integration and international trading and monetary regimes, 1800&ndash;2000; theories explaining global disparities: classical, neoclassical, Marxian, neo-Marxian, and structuralist; import-substituting industrialization: Latin America, Asia, and Africa; international debt crises: nineteenth and twentieth centuries; the new global regime; structural adjustment: GATT (General Agreement on Tariffs and Trade) and WTO (World Trade Organization); and socialist interlude: a socialist experience and transition to capitalism.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ECON", "number": "1116" },
      "Or",
      { "subject": "ECON", "number": "1115" }
    ]
  },
  {
    "subject": "ECON",
    "number": "3404",
    "title": "International Food Policy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202310", "crn": "19012" }],
    "description": "Offers an overview of the rationale for and types of food policies in developing countries. Uses a food systems approach to cover economic and political dimensions of food policy. Emphasizes food security, nutrition, poverty alleviation, and environmental issues. Discusses and analyzes the dynamics of change in the role of government; food value chains; and institutions and governance and their implications for local, regional, and global food systems.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3416",
    "title": "Behavioral Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14893" },
      { "term": "202310", "crn": "19013" }
    ],
    "description": "Questions assumptions made in standard microeconomic utility-driven models, using insights from psychology and other social sciences. Examines behavior that departs from these assumptions and tests theories with data. Incorporates empirical evidence from a wide range of fields, including development economics, health economics, labor economics, industrial organization, and finance. Topics include deviations from standard models in terms of preferences (present bias, reference dependence, and social preferences); beliefs (projection bias); and decision making (cognition, attention, and framing); as well as market and policy reactions to such deviations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3423",
    "title": "Environmental Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19014" }],
    "description": "Applies the tools of economics to environmental issues. Explores taxonomy of environmental effects; externalities; the commons problem; taxation, regulations, marketable permits, and property rights as a solution; measuring benefits of cleaner air and water, noise abatement, and recreational areas; global issues including tropical deforestation and acid rain; and the relevance of economics to the environmental debate.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3424",
    "title": "Law and Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["FQ", "SI"],
    "sections": [{ "term": "202310", "crn": "16373" }],
    "description": "Focuses on how an understanding of the law is furthered by an awareness of the economic background against which it operates. Draws from economic principles, developing concepts such as efficiency, property rights, regulation, and income distribution. Uses mathematical notation to model the incentives created by various legal rules. Solutions to cost minimization and utility maximization problems reveal whether particular laws induce economic agents to act in a manner consistent with the social optimum. Applications of these ideas may include health and safety, the environment, the legal services and insurance industries, and zoning and land use, among others.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "1116" }]
  },
  {
    "subject": "ECON",
    "number": "3440",
    "title": "Public Finance",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20295" }],
    "description": "Presents an overview of the economics of government and the role of public policy. Develops guidelines to determine which economic activities are best performed by government and which are not. Also examines the impact of tax policies on efficiency, economic growth, and equity. Topics include market failures, public choice, the personal income tax, the corporate tax, sales tax, and taxation of capital and wealth, and options for reform of the tax structure. Major spending programs such as social security and education and healthcare are analyzed.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3442",
    "title": "Money and Banking",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19016" }],
    "description": "Covers the nature and functions of money, credit, and financial markets in the modern international economy. Analyzes financial markets and institutions, central banking, and the effects of interest and foreign exchange rates on the real economy.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3460",
    "title": "Managerial Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19017" }],
    "description": "Explores the application of economic principles to the solution of managerial decision-making problems in areas such as demand estimation, cost estimation and control, pricing and marketing strategies, employee incentives, financing of capital investments, and responses to government regulation and taxation. Case studies and simulation models are typically used as pedagogical tools.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "1116" }]
  },
  {
    "subject": "ECON",
    "number": "3470",
    "title": "American Economic History",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI", "WI"],
    "sections": [{ "term": "202310", "crn": "19018" }],
    "description": "Covers the economic history of the United States from the colonial period to the present. Includes studies of the development of major economic institutions and the effects of technological change. Examines economic reasons for the spread of an industrial market economy in the nineteenth century and the successes and failures of this economy in the twentieth century.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3481",
    "title": "Economics of Sports",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20195" },
      { "term": "202240", "crn": "40699" }
    ],
    "description": "Investigates what economics has to say about sports as an economic activity: what tools of economic analysis apply to sports, whether sports require different economic tools, what the evidence has to say about key questions. Focuses on professional team sports, although some attention is paid to college sports and to individual professional sports.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "1116" }]
  },
  {
    "subject": "ECON",
    "number": "3520",
    "title": "History of Economic Thought",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [
      { "term": "202310", "crn": "16374" },
      { "term": "202260", "crn": "60742" }
    ],
    "description": "Traces the evolution of Western economic thought. Covers several important periods and schools of economic thought including mercantilism, physiocracy, classical, Marxist, neoclassical, and Keynesian. Emphasizes the relationship between historical changes in society and economic thought, focusing on changes in the types of questions economists ask and the analytical tools they use.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ECON", "number": "1115" },
      "And",
      { "subject": "ECON", "number": "1116" },
      "And",
      "(",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      ")"
    ]
  },
  {
    "subject": "ECON",
    "number": "3711",
    "title": "Economics of Race",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202240", "crn": "41416" }],
    "description": "Addresses economic issues related to race, including the persistence of racial discrimination. Studies the social construction of race and the use of this construction to legitimize exploitation. Covers the economic modeling of discrimination and segregation, as well as the effect of these societal attributes on economic outcomes, and the complexity of racial equity and equality specific to reparations. Course materials rely on published research, film, and other media.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "3916",
    "title": "Fintech",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14894" }],
    "description": "Covers selected topic matter in the field of microeconomics. The specific topic is chosen by the instructor. May be repeated up to five times.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "1116" }]
  },
  {
    "subject": "ECON",
    "number": "4640",
    "title": "Financial Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19019" }],
    "description": "Introduces students to the theory of investments, including the principles of risk and return, the theory of portfolio selection, asset pricing models such as the capital asset pricing model (CAPM) and arbitrage pricing theory (APT), valuation of stocks, bond pricing and the term structure of interest rates, and options (what they are and how to use them). Geared toward nonbusiness majors who are interested in a rigorous course in finance.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "ECON", "number": "2315" },
      "Or",
      { "subject": "ECON", "number": "2316" },
      ")",
      "And",
      "(",
      { "subject": "ECON", "number": "2350" },
      "Or",
      { "subject": "MATH", "number": "2280" },
      "Or",
      { "subject": "MATH", "number": "3081" },
      "Or",
      { "subject": "MGSC", "number": "2301" },
      "Or",
      { "subject": "POLS", "number": "2400" },
      "Or",
      { "subject": "PSYC", "number": "2320" },
      ")"
    ]
  },
  {
    "subject": "ECON",
    "number": "4680",
    "title": "Competition Policy and Regulation",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20196" }],
    "description": "Presents an analytic framework and empirical study of how the structure of industries and the conduct of sellers affect performance. Includes examples and case studies from both the &amp;#8220;old economy&amp;#8221; and the &amp;#8220;new economy.&amp;#8221; Examines antitrust as a public policy designed to promote better market performance.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "2316" }]
  },
  {
    "subject": "ECON",
    "number": "4692",
    "title": "Senior Economics Seminar",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [
      { "term": "202310", "crn": "11396" },
      { "term": "202310", "crn": "11515" },
      { "term": "202310", "crn": "12673" },
      { "term": "202310", "crn": "19021" },
      { "term": "202260", "crn": "60318" },
      { "term": "202240", "crn": "40415" }
    ],
    "description": "Incorporates aspects of real-world and academic experiences of students into an analytical context, enabling students to demonstrate their ability to apply economic concepts, methodology, and data to economic issues and problems of personal and philosophical significance.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ECON", "number": "2315" },
      "And",
      { "subject": "ECON", "number": "2316" },
      "And",
      "(",
      { "subject": "ECON", "number": "2350" },
      "Or",
      { "subject": "MATH", "number": "2280" },
      "Or",
      { "subject": "MATH", "number": "3081" },
      "Or",
      { "subject": "MGSC", "number": "2301" },
      "Or",
      { "subject": "POLS", "number": "2400" },
      "Or",
      { "subject": "PSYC", "number": "2320" },
      ")"
    ]
  },
  {
    "subject": "ECON",
    "number": "5105",
    "title": "Math and Statistics for Economists",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10737" },
      { "term": "202310", "crn": "17939" }
    ],
    "description": "Offers an intensive study of the statistical methods and techniques and mathematical fundamentals necessary for quantitative economics. Statistical topics include descriptive statistics, probability theory, fundamentals of estimation and hypothesis testing, and regression and correlation analysis. Mathematical topics include linear algebra and differential and integral calculus. Computer applications are an integral part of the course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "5110",
    "title": "Microeconomic Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10764" }],
    "description": "Presents a survey of microeconomic theory at the beginning graduate level. Topics include theories of the consumer, firm, and market (including input and output markets), welfare economics, and market failures. Includes applications of theory to public policy questions in such fields as industrial organization and public finance. Requires knowledge of undergraduate microeconomic theory.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "5120",
    "title": "Macroeconomic Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19022" },
      { "term": "202310", "crn": "20304" }
    ],
    "description": "Examines theories of the short-run determination of output, employment, and prices, and long-run economic growth. Presents alternative macroeconomic models. Also consists of applied case study analysis of the theoretical models presented in class.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "5200",
    "title": "Topics in Energy Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16376" },
      { "term": "202310", "crn": "19023" }
    ],
    "description": "Presents an application of microeconomic and macroeconomic theory, as well as quantitative methods, to a variety of social issues, both domestic and international. May be repeated without limit where topics are unique.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "5293",
    "title": "Agriculture and Development",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19024" }],
    "description": "Explores primarily the role of agriculture in the evolving development context and the global economy. Reviews historical and current thinking on agriculture and development to offer students a theoretical and applied perspective on agricultural development and structural transformation in developing countries. Discusses current and emerging trends in agriculture, including agriculture&#39;s central role in rural poverty reduction; food security, health, and nutrition issues related to natural resource use; and global developments in agriculture trade and investment within the overall framework of the 2030 Agenda for Sustainable Development and the Sustainable Development Goals.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "6105",
    "title": "Advanced Mathematics and Statistics for Economists",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16660" }],
    "description": "Covers the fundamental quantitative methods in economics. The first part of the course focuses on the role of mathematical models in economics, the applications of linear algebra, multivariate calculus, and static optimization theory. Studies statistics in the second part of the course, and offers students an opportunity to learn how to apply proper methods of empirical testing in economics. Additionally, introduces the statistical language R to equip students to complete most of the assignments in statistics. This is an advanced graduate course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "6120",
    "title": "Advanced Macroeconomic Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19025" }],
    "description": "Develops basic models used by macroeconomists to study long-run economic growth with exogenous savings and endogenous saving decisions by optimizing households. Studies models incorporating endogenous technology improvements, including the model of increasing product variety and the model of Schumpeterian growth. In the second part of the course, basic models used by macroeconomist are developed to explain short-term fluctuations in aggregate economic variables. Develops a simple real business cycle model, which is subsequently enriched by relaxing assumptions of perfect competition on the production side and monetary neutrality. This is the first advanced graduate-level course introducing modern theories of the aggregate economy.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "6964",
    "title": "Co-op Work Experience",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12065" },
      { "term": "202260", "crn": "61515" },
      { "term": "202260", "crn": "61519" },
      { "term": "202260", "crn": "61607" },
      { "term": "202240", "crn": "41961" }
    ],
    "description": "Provides eligible students with an opportunity for work experience. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "6965",
    "title": "Co-op Work Experience Abroad",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202260", "crn": "61558" }],
    "description": "Provides eligible students with an opportunity for work experience abroad. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "7200",
    "title": "Topics in Information Economic",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20232" }],
    "description": "Emphasizing recent empirical research in credit and insurance markets, this course will study how asymmetric information influences market outcomes and policy.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "7251",
    "title": "International Finance",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14895" }],
    "description": "Introduces students to international finance and equips them with tools and methods to study and analyze international economic issues and problems. Topics include the foreign exchange market, balance of payments, international investment and banking, monetary and fiscal policy in an open economy, economic integration and monetary unification, the international monetary system, and optimum currency areas. Each student is required to write a short paper on a current problem in international finance.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "7710",
    "title": "Microeconomic Theory 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20300" }],
    "description": "Continues ECON 5110, building on its theories. Topics include game theory, economics of information, incentive theory, welfare economics, general equilibrium, and social choice theory.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "7764",
    "title": "Topics in Labor Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13529" }],
    "description": "Covers the theoretical and empirical issues surrounding current topics in the area of labor economics. Topics may vary each time the course is offered and may include discrimination, efficiency wage theory, labor legislation, life cycle analysis, and the use of microdata (panel studies, search behavior, intergenerational earnings mobility, and employment and training policies).",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "7772",
    "title": "Public Policy Toward Business",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10587" }],
    "description": "Covers the three major facets of public policy toward business: antitrust, regulation, and privatization. Demonstrates how economic theory and evidence are brought to bear on practical questions of market failure and policies to remedy such failure. Topics include mergers, collusion and facilitating practices, predatory conduct, cost of service regulation, price caps and incentive regulation, deregulation, and public enterprise vs. privatization. Policies are analyzed for their rationale, techniques for implementation, and effects as measure in the context of actual experience in the United States and other countries.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "7771" }]
  },
  {
    "subject": "ECON",
    "number": "7976",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20520" }],
    "description": "Offers independent work under the direction of members of the department on a chosen topic. Course content depends on instructor. May not be substituted for requirements leading to a BA or BS in economics. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "9986",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19028" }],
    "description": "Offers an opportunity to conduct full-time research under faculty supervision. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "9990",
    "title": "Dissertation Term 1",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10646" }],
    "description": "First of two consecutive semesters to meet the residency requirement of the doctoral program.",
    "coreqs": [],
    "prereqs": [{ "subject": "ECON", "number": "9000" }]
  },
  {
    "subject": "ECON",
    "number": "9991",
    "title": "Dissertation Term 2",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "17520" }],
    "description": "Offers dissertation supervision by members of the department.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "ECON",
    "number": "9996",
    "title": "Dissertation Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10806" }],
    "description": "Requires registration for those students who have completed the doctoral program&#39;s residency requirement, but who have not yet completed the dissertation.",
    "coreqs": [],
    "prereqs": []
  }
]
