[
  {
    "subject": "EDUC",
    "number": "1111",
    "title": "Education in the Community",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "EX", "SI"],
    "sections": [
      { "term": "202310", "crn": "16629" },
      { "term": "202310", "crn": "17023" },
      { "term": "202330", "crn": "30948" },
      { "term": "202330", "crn": "38602" }
    ],
    "description": "Considers the unique contributions of community, family, and public schools to education in the United States today. Uses classroom and field-based activities to provide historical and social contexts of public education. Encourages students to reflect on their own prior education, to learn from persons active in the education community, and to consider their future roles as educators.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EDUC",
    "number": "5503",
    "title": "Culture, Equity, Power, and Influence",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16618" },
      { "term": "202330", "crn": "35577" }
    ],
    "description": "Examines the broad construct of culture and explores how these characteristics impact personal identity, access to education, social mobility, power, and influence. Explores educational institutions as cultural systems and questions concepts at the heart of personal and professional interactions in teaching, learning, curriculum, and administration. Expects students to participate in reflective discussion and begin to explore their own feelings and experience with culture; to develop competencies spanning cultural and international boundaries; to prepare to be more effective in diverse settings; and to influence and advocate for systemic change.",
    "coreqs": [],
    "prereqs": [{ "subject": "EDUC", "number": "1111" }]
  },
  {
    "subject": "EDUC",
    "number": "5504",
    "title": "Child and Adolescent Development, Learning, and Teaching",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16617" }],
    "description": "Surveys contemporary educational theory of human learning and accomplished teaching. Offers students an opportunity to develop a working understanding of teaching and learning as they occur in different types of schools and community settings. Investigates how children and adolescents learn, acquire knowledge, and make sense of their experience, as well as theories of teaching or pedagogy—how best to teach for understanding and learning achievement.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EDUC", "number": "1111" },
      "And",
      { "subject": "EDUC", "number": "1112" }
    ]
  },
  {
    "subject": "EDUC",
    "number": "5570",
    "title": "Inclusion, Equity, and Diversity",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16619" },
      { "term": "202330", "crn": "32348" }
    ],
    "description": "Addresses the range of learning needs of special education legislation, as well as the politics of who is identified and why. Examines students' own attitudes about teaching children with learning disabilities. Offers students an opportunity to develop skills and strategies for identifying and teaching learning-disabled children. Requires graduate students to demonstrate advanced levels of study and research.",
    "coreqs": [],
    "prereqs": [{ "subject": "EDUC", "number": "1111" }]
  }
]
