[
  {
    "subject": "EECE",
    "number": "2140",
    "title": "Computing Fundamentals for Engineers",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19030" },
      { "term": "202310", "crn": "16339" },
      { "term": "202310", "crn": "19031" },
      { "term": "202310", "crn": "19032" },
      { "term": "202310", "crn": "19033" },
      { "term": "202260", "crn": "61232" },
      { "term": "202240", "crn": "41034" }
    ],
    "description": "Engages students in problem solving from an engineering perspective, offering essential computer hardware and software knowledge and experience. Computational problem solving involves expressing solutions to engineering problems in a way that a computer can efficiently solve. As our world continues to become more automated and interconnected, it becomes increasingly important to be able to leverage computer software and hardware, enabling us to evaluate and solve real-world engineering challenges. Offers students an opportunity to learn engineering solution design, leveraging a high-level programming language appropriate for interfacing hardware-based systems. Stresses best practices in design. Coursework includes programming assignments, quizzes, and a final project, offering students a number of ways to demonstrate their understanding of the concepts.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2150",
    "title": "Circuits and Signals: Biomedical Applications",
    "scheduleType": "Lecture",
    "credits": 5,
    "nuPath": ["AD"],
    "sections": [
      { "term": "202310", "crn": "11997" },
      { "term": "202310", "crn": "11998" },
      { "term": "202310", "crn": "11999" },
      { "term": "202310", "crn": "12372" }
    ],
    "description": "Offers an integrated lecture/lab course that covers circuit theory, signal processing, circuit building, and MATLAB programming. Introduces basic device and signal models and circuit laws used in the study of linear circuits. Analyzes resistive and complex impedance networks. Uses the ideal operational amplifier model, focusing on differential amplifiers and active filter circuits. Introduces basic concepts of linearity and time-invariance for both continuous and discrete-time systems and concepts associated with analog/digital conversion. Demonstrates discrete-time linear filter design on acquired signals in the MATLAB environment. Offers students an opportunity to explore circuits and signals in the lab and to use their knowledge of circuits, analog signals, digital signals, and biological signals to build a working analog/digital EKG system.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2160",
    "title": "Embedded Design: Enabling Robotics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12000" },
      { "term": "202310", "crn": "12702" },
      { "term": "202310", "crn": "12001" },
      { "term": "202310", "crn": "13196" },
      { "term": "202240", "crn": "41084" }
    ],
    "description": "Offers an integrated lecture/lab course that covers the basics of the Unix operating system, high-level programming concepts, introductory digital design, wireless networking, and Simulink design. Offers students a hands-on experience developing a remote-controlled robotic arm using an embedded systems platform.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "GE", "number": "1111" },
      "Or",
      { "subject": "GE", "number": "1502" },
      ")",
      "And",
      { "subject": "EECE", "number": "2140" }
    ]
  },
  {
    "subject": "EECE",
    "number": "2210",
    "title": "Electrical Engineering",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13005" },
      { "term": "202310", "crn": "13491" },
      { "term": "202310", "crn": "17363" }
    ],
    "description": "Introduces the basic concepts related to circuits and circuit elements; current, voltage, and power; models for resistors, capacitors, and inductors; and circuit analysis using Kirchhoff&rsquo;s laws. Discusses selected topics that illustrate a variety of applications of electrical engineering, such as AC circuits and electric power, the basics of semiconductor devices with applications to transistor amplifier models, transients in circuits with energy storage, mechanical controls and mechatronics, digital signals, logic circuits, and some basic concepts of computer operations, specifically, number coding, arithmetic operations, and memory circuits.",
    "coreqs": [{ "subject": "EECE", "number": "2211" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2211",
    "title": "Lab for EECE 2210",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10861" },
      { "term": "202310", "crn": "13492" },
      { "term": "202310", "crn": "10862" },
      { "term": "202310", "crn": "20334" }
    ],
    "description": "Accompanies EECE 2210. Covers fundamental DC and AC electrical concepts as well as analog and digital electronics.",
    "coreqs": [{ "subject": "EECE", "number": "2210" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2322",
    "title": "Fundamentals of Digital Design and Computer Organization",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10321" },
      { "term": "202310", "crn": "10515" },
      { "term": "202310", "crn": "16340" },
      { "term": "202310", "crn": "15313" },
      { "term": "202310", "crn": "16641" },
      { "term": "202260", "crn": "60809" },
      { "term": "202240", "crn": "41159" }
    ],
    "description": "Covers the design and evaluation of control and data structures for digital systems. Uses hardware description languages to describe and design both behavioral and register-transfer-level architectures and control units. Topics covered include number systems, data representation, a review of combinational and sequential digital logic, finite state machines, arithmetic-logic unit (ALU) design, basic computer architecture, the concepts of memory and memory addressing, digital interfacing, timing, and synchronization. Assignments include designing and simulating digital hardware models using Verilog as well as some assembly language to expose the interface between hardware and software.",
    "coreqs": [{ "subject": "EECE", "number": "2323" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2323",
    "title": "Lab for EECE 2322",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10488" },
      { "term": "202310", "crn": "10489" },
      { "term": "202310", "crn": "10490" },
      { "term": "202310", "crn": "15314" },
      { "term": "202310", "crn": "16341" },
      { "term": "202310", "crn": "16603" },
      { "term": "202310", "crn": "17061" },
      { "term": "202260", "crn": "60810" },
      { "term": "202240", "crn": "41160" }
    ],
    "description": "Offers students an opportunity to design and implement a simple computer system on field-programmable logic using a hardware description language. Covers simulation and testing of designs.",
    "coreqs": [{ "subject": "EECE", "number": "2322" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2412",
    "title": "Fundamentals of Electronics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10884" },
      { "term": "202310", "crn": "10885" },
      { "term": "202260", "crn": "60811" }
    ],
    "description": "Reviews basic circuit analysis techniques. Briefly introduces operation of the principal semiconductor devices: diodes, field-effect transistors, and bipolar junction transistors. Covers diode circuits in detail; the coverage of transistor circuits focuses mainly on large-signal analysis, DC biasing of amplifiers, and switching behavior. Uses PSpice software to simulate circuits and large-signal models and transient simulations to characterize the behavior of transistors in amplifiers and switching circuits. Digital electronics topics include CMOS logic gates, dynamic power dissipation, gate delay, and fan-out. Amplifier circuits are introduced with the evaluation of voltage transfer characteristics and the fundamentals of small-signal analysis.",
    "coreqs": [{ "subject": "EECE", "number": "2413" }],
    "prereqs": [
      { "subject": "EECE", "number": "2150" },
      "Or",
      { "subject": "EECE", "number": "2210" },
      "Or",
      { "subject": "BIOE", "number": "3210" }
    ]
  },
  {
    "subject": "EECE",
    "number": "2413",
    "title": "Lab for EECE 2412",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": ["WI"],
    "sections": [
      { "term": "202310", "crn": "10886" },
      { "term": "202310", "crn": "10887" },
      { "term": "202310", "crn": "16602" },
      { "term": "202260", "crn": "60812" }
    ],
    "description": "Covers experiments reinforcing basic electronics topics such as diodes, bipolar junction transistors (BJT) as a switch, BJT amplifiers, and MOSFET circuits for switching and amplification. Practical measurements include use of voltmeters, ammeters, ohm meters, and impedance meters, as well as oscilloscope measurements of frequency, gain, distortion, and upper- and lower-cutoff frequencies of amplifiers.",
    "coreqs": [{ "subject": "EECE", "number": "2412" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2520",
    "title": "Fundamentals of Linear Systems",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12216" },
      { "term": "202310", "crn": "12218" },
      { "term": "202240", "crn": "40979" }
    ],
    "description": "Develops the basic theory of continuous and discrete systems, emphasizing linear time-invariant systems. Discusses the representation of signals and systems in both the time and frequency domain. Topics include linearity, time invariance, causality, stability, convolution, system interconnection, and sinusoidal response. Develops the Fourier and Laplace transforms for the discussion of frequency-domain applications. Analyzes sampling and quantization of continuous waveforms (A/D and D/A conversion), leading to the discussion of discrete-time FIR and IIR systems, recursive analysis, and realization. The Z-transform and the discrete-time Fourier transform are developed and applied to the analysis of discrete-time signals and systems.",
    "coreqs": [],
    "prereqs": [
      "(",
      "(",
      { "subject": "EECE", "number": "2150" },
      "Or",
      { "subject": "EECE", "number": "2210" },
      ")",
      "And",
      { "subject": "MATH", "number": "2341" },
      ")",
      "Or",
      "(",
      { "subject": "BIOE", "number": "3210" },
      "And",
      "(",
      { "subject": "GE", "number": "2361" },
      "Or",
      { "subject": "MATH", "number": "2341" },
      ")",
      ")"
    ]
  },
  {
    "subject": "EECE",
    "number": "2530",
    "title": "Fundamentals of Electromagnetics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12219" },
      { "term": "202310", "crn": "19034" }
    ],
    "description": "Introduces electromagnetics and high-frequency applications. Topics include transmission lines: transmission line model with distributed circuit elements, transmission line equations and solutions, one-dimensional traveling and standing waves, and applications; electromagnetic field theory: Lorentz force equations, Maxwell&rsquo;s equations, Poynting theorem, and application to the transmission line&rsquo;s TEM waves. Also studies uniform plane wave propagation along a coordinate axis and along an arbitrary direction; equivalent transmission lines for TEM, TE, and TM waves; reflection and refraction of uniform plane waves by conducting and dielectric surfaces. Discusses applications to wave guides, resonators, optical fibers, and radiation and elementary antennas. Introduces modern techniques (computational methods) and applications (optics, bioelectromagnetics, and electromagnetic effects in high-speed digital circuits).",
    "coreqs": [{ "subject": "EECE", "number": "2531" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2531",
    "title": "Lab for EECE 2530",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12220" },
      { "term": "202310", "crn": "16342" },
      { "term": "202310", "crn": "12221" },
      { "term": "202310", "crn": "16343" },
      { "term": "202310", "crn": "12222" },
      { "term": "202310", "crn": "16344" },
      { "term": "202310", "crn": "16345" },
      { "term": "202310", "crn": "16346" },
      { "term": "202310", "crn": "19035" },
      { "term": "202310", "crn": "19036" },
      { "term": "202310", "crn": "19037" },
      { "term": "202310", "crn": "19038" }
    ],
    "description": "Accompanies EECE 2530. Supports class material related to transmission lines, wave-guiding structures, plane wave reflection and refraction, and antenna radiation. Includes experiments with microwave transmission line measurements and the determination of the properties of dielectric materials, network analyzer analysis of microwave properties of circuit elements and transmission line electrical length, analysis of effective dielectric constant and loss from microstripline resonator transmission, optical measurement of refraction and reflection leading to determination of Brewster angle and optical constants for transparent and absorbing materials, and measurement of radiation patterns from dipole antennas.",
    "coreqs": [{ "subject": "EECE", "number": "2530" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2540",
    "title": "Fundamentals of Networks",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12223" },
      { "term": "202310", "crn": "12224" },
      { "term": "202310", "crn": "13376" },
      { "term": "202240", "crn": "40757" }
    ],
    "description": "Presents an overview of modern communication networks. The concept of a layered network architecture is used as a framework for understanding the principal functions and services required to achieve reliable end-to-end communications. Topics include service interfaces and peer-to-peer protocols, a comparison of the OSI (open system interconnection) reference model to the TCP/IP (Internet) and IEEE LAN (local area network) architectures, network-layer and transport-layer issues, and important emerging technologies such as Bluetooth and ZigBee.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "2560",
    "title": "Fundamentals of Engineering Algorithms",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12217" },
      { "term": "202310", "crn": "13379" }
    ],
    "description": "Covers the design and implementation of algorithms to solve engineering problems using a high-level programming language. Reviews elementary data structures, such as arrays, stacks, queues, and lists, and introduces more advanced structures, such as trees and graphs and the use of recursion. Covers both the algorithms to manipulate these data structures as well as their use in problem solving. Introduces algorithm complexity analysis and its application to developing efficient algorithms. Emphasizes the importance of software engineering principles.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "2160" },
      "Or",
      { "subject": "CS", "number": "1500" }
    ]
  },
  {
    "subject": "EECE",
    "number": "2750",
    "title": "Enabling Engineering",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [{ "term": "202310", "crn": "12977" }],
    "description": "Offers students an opportunity to develop a proposal for a design project that uses engineering technologies to improve the lives of individuals with cognitive or physical disabilities. Offers student project groups an opportunity to work with end users and caregivers at local nursing homes and special education schools to assess a specific need, research potential solutions, and develop a detailed proposal for a project. Project groups are matched with product design mentors who guide groups through the design process. Lectures cover relevant topics, including surveys of specific physical and cognitive disabilities and applicable engineering technologies. The same project may not be used to satisfy both this course and EECE 4790. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "3324",
    "title": "Computer Architecture and Organization",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10346" },
      { "term": "202240", "crn": "40548" }
    ],
    "description": "Presents a range of topics that include assembly language programming, number systems, data representations, ALU design, arithmetic, the instruction set architecture, and the hardware/software interface. Offers students an opportunity to program using assembly language and to simulate execution. Covers the architecture of modern processors, including datapath/control design, caching, memory management, pipelining, and superscalar. Discusses metrics and benchmarking techniques used for evaluating performance.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "2322" },
      "And",
      "(",
      { "subject": "CS", "number": "1500" },
      "Or",
      { "subject": "EECE", "number": "2160" },
      ")"
    ]
  },
  {
    "subject": "EECE",
    "number": "3392",
    "title": "Electronic Materials",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13493" }],
    "description": "Provides a basic treatment of electronic materials from atomic, molecular, and application viewpoints. Topics include atomic structure and bonding in materials, structure of materials, and crystal defects. These topics lay a foundation for the introduction of thermal and electronic conduction, which is the underlying physics of electronic devices. Finally, the electronic properties of semiconductors, dielectric, magnetic, superconducting, and optical materials are examined. The latter half deals with an introduction to the state of the art in electronic materials, including semiconductor nanoelectronics, magnetic semiconductors and spintronics, molecular electronics, carbon nanotubes, conducting polymers, diamondlike carbon, and other topics representing recent technological breakthroughs in the area of electronic materials.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "3400",
    "title": "Introduction to Communication Systems",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19895" }],
    "description": "Covers the basic principles and building blocks of modern digital communication systems. These systems include the current and future generations of wireless services (e.g., 6G) and are predicted to become a multi-billion-dollar market in the next decade. Industrial giants at the forefront of related research and development include market-leading hardware and software companies, offering an increasing scope of employment opportunities. Includes the background of developments such as radio signal propagation, frequency spectrum regulation and resource division among multiple users, digital representation and compression of information, signal modulation and demodulation, information detection in the presence of noise and channel impairments, coding for improved reliability, and system performance analysis and simulation.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "2150" },
      "And",
      { "subject": "MATH", "number": "2341" }
    ]
  },
  {
    "subject": "EECE",
    "number": "3410",
    "title": "Electronic Design",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11102" },
      { "term": "202240", "crn": "40561" }
    ],
    "description": "Covers advanced analog and mixed-signal circuit analysis topics. Introduces analog integrated circuits (ICs) concepts with bipolar and field effect transistor devices. Covered IC building blocks include current sources and active loads, differential stages, cascode configurations, gain stages, and output stages. The uses of the building blocks are demonstrated for the design of popular ICs, such as operational amplifiers and voltage comparators. The high-frequency circuit models of transistors are described and used to evaluate the frequency responses of amplifiers. Introduces analog-to-digital and digital-to-analog conversion concepts and the concepts of feedback and instability with applications to the design of amplifiers and oscillators. The course makes extensive use of the SPICE simulation tool for assignments and projects.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "3468",
    "title": "Noise and Stochastic Processes",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12987" },
      { "term": "202260", "crn": "60467" }
    ],
    "description": "Discusses probability, random variables, random processes, and their application to noise in electrical systems. Begins with the basic theory of discrete and continuous probabilities, then develops the concepts of random variables, random vectors, random sequences, and random processes. Continues with a discussion on the physical origins of noise and models of where it is encountered in electronic devices, signal processing, and communications. Defines the concepts of correlation, covariance, and power density spectra and uses them to analyze linear system operations in continuous time.",
    "coreqs": [],
    "prereqs": [
      { "subject": "MATH", "number": "2341" },
      "And",
      "(",
      { "subject": "EECE", "number": "2520" },
      "Or",
      { "subject": "EECE", "number": "3464" },
      ")"
    ]
  },
  {
    "subject": "EECE",
    "number": "4520",
    "title": "Software Engineering 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14030" }],
    "description": "Offers an overview of the discipline of software engineering. Identifies the problems that one should expect when developing large software systems; methods that the software developer can use to deal with each of the problems; tools that the software developer can use; and procedures that can be followed in developing software. Covers the software life cycle (requirements analysis and specification, software design, coding, testing, and maintenance); various models of the software process&mdash;structured and agile; the Unified Modeling Language (UML) as applied to the software life cycle, prototyping, and documentation; design patterns; software metrics and estimation; software development environments and tools; and verification and validation. Includes a software development project that covers all the stages of the life cycle.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "4574",
    "title": "Wireless Communication Circuits",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12225" }],
    "description": "Covers the electronics of radio receivers and transmitters. Employs a commercial radio transceiver (MFJ-9340) as a learning tool. Presents basic topics (radio spectrum and its utilization, antennae, and information processing by modulation and demodulation). Studies building block realizations for modulators and demodulators for analog (AM, FM) and digital (ASK, PSK, FSK) radio. Covers common radio receiver architectures. Presents circuit-level designs of radio building blocks (resonators; L-C RF filters; crystals and IF filters; tuned transformers and impedance matching; amplifiers and power amplifiers; RF oscillators; mixers and up/down frequency conversion; signal detectors; and automatic gain control circuits). Includes receiver noise and sensitivity; transmitter range; spurious emissions and IM distortion; antennae and propagation in the atmosphere; wireless standards; multiple-access techniques; and software-defined radio. May include additional topics at instructor&rsquo;s discretion.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "4630",
    "title": "Robotics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202240", "crn": "41383" }],
    "description": "Introduces robotics analysis covering basic theory of kinematics, dynamics, and control of robots. Develops students&amp;#8217; design capabilities of microprocessor-based control systems with input from sensory devices and output actuators by having teams of students design and implement a small mobile robot system to complete a specific task, culminating in a competition at the end of the course. Covers actuators, sensors, system modeling, analysis, and motion control of robots.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "4646",
    "title": "Optics for Engineers",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19040" }],
    "description": "Presents the basic optical concepts necessary for anunderstanding of current and future optical communication,remote sensing, and industrial and biomedical systems. Topicsinclude geometrical optics, polarized light, diffraction, andinterference. Studies lasers and other light sources, opticalfibers, detectors, CCD cameras, modulators, and othercomponents of optical systems. Presents applications tospecific systems such as fiber-optic communication, medicalimaging systems, fiber-optic sensors, and laser radar.",
    "coreqs": [],
    "prereqs": [
      { "subject": "BIOE", "number": "3210" },
      "Or",
      { "subject": "EECE", "number": "2150" },
      "Or",
      { "subject": "EECE", "number": "2210" },
      "Or",
      { "subject": "PHYS", "number": "1155" }
    ]
  },
  {
    "subject": "EECE",
    "number": "4790",
    "title": "Electrical and Computer Engineering Capstone 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE", "EI", "WI"],
    "sections": [
      { "term": "202260", "crn": "60043" },
      { "term": "202260", "crn": "60015" },
      { "term": "202260", "crn": "60220" },
      { "term": "202260", "crn": "60643" },
      { "term": "202240", "crn": "40042" },
      { "term": "202240", "crn": "40043" },
      { "term": "202240", "crn": "40257" },
      { "term": "202240", "crn": "40695" }
    ],
    "description": "Requires students to select a project requiring design and implementation of an electrical, electronic, and/or software system, including evaluation of multiple constraints and use of appropriate engineering standards in the design; formation of a team to carry out the project; and submission and presentation of a detailed proposal for the work. Students must specify the materials needed for their project, provide a cost analysis, and make arrangements with their capstone adviser to purchase and/or secure donation of equipment. Requires students to perform a feasibility study by extensive simulation or prototype design of subsystems to facilitate the second phase of the capstone design, considering public health, safety and welfare, global, cultural, social, environmental, and economic factors.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "2322" },
      "Or",
      { "subject": "EECE", "number": "2412" },
      "Or",
      { "subject": "EECE", "number": "2520" },
      "Or",
      { "subject": "EECE", "number": "2530" },
      "Or",
      { "subject": "EECE", "number": "2540" },
      "Or",
      { "subject": "EECE", "number": "2560" },
      "Or",
      { "subject": "CS", "number": "3000" }
    ]
  },
  {
    "subject": "EECE",
    "number": "4792",
    "title": "Electrical and Computer Engineering Capstone 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE", "EI", "WI"],
    "sections": [
      { "term": "202310", "crn": "12226" },
      { "term": "202310", "crn": "12227" },
      { "term": "202310", "crn": "15277" },
      { "term": "202310", "crn": "12215" }
    ],
    "description": "Requires design and implementation of the project proposed in EECE 4790. Students are expected to apply engineering principles acquired throughout their academic and co-op experiences to the design of a system, component, or process. Each project includes the development and use of design methodology, formulation of design problem statements and specifications, construction of hardware, integration of sensors and actuators, programming microcontroller and software development, and design of subsystems, followed by testing and integration to validate the overall design. Projects include realistic constraints such as economic factors, safety, reliability, maintenance, aesthetics, ethics, and social impact. Students make oral presentations in a series of design reviews, document their final design solution in a written report, and demonstrate a functional prototype in a final presentation.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5155",
    "title": "Wireless Sensor Networks and the Internet of Things",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15220" },
      { "term": "202310", "crn": "20052" }
    ],
    "description": "Covers design and modeling of architectures, communication protocols, and algorithms for wireless sensor networks and the Internet of Things. Provides instruction in general aspects of wireless sensor networking, including protocol design, modeling, and simulation at all layers of the communication stack. Studies standardization efforts, including Bluetooth, IEEE 802.15.4/Zigbee, and SigFox/LoRa, among others. Culminates with illustrations of applications of sensor networks technology to many challenging problems of our times, including mobile crowdsensing, smart cities, and cyber-physical systems.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5360",
    "title": "Combinatorial Optimization",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202240", "crn": "40696" }],
    "description": "Introduces combinatorial optimization, an emerging field that combines techniques from applied mathematics, operations research, and computer science to solve optimization problems over discrete structures. Emphasizes problems that arise in the areas of electrical and computer engineering, including VLSI, computer-aided design, parallel computing, computer architecture, and high-performance compiling. Covers the foundations of algorithm analysis, including asymptotic notation and complexity theory, and a range of optimization techniques, including divide and conquer, local optimization, dynamic programming, branch and bound, simulated annealing, genetic algorithms, approximation algorithms, integer and linear programming, matroid theory, and greedy algorithms. Considers the efficient generation of optimal solutions, the development and evaluation of heuristics, and the computation of tight upper and lower bounds.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "2560" },
      "Or",
      { "subject": "CS", "number": "3000" },
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EECE",
    "number": "5550",
    "title": "Mobile Robotics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14329" },
      { "term": "202310", "crn": "20807" }
    ],
    "description": "Investigates the science and engineering of mobile robots. Topics may include kinematics, dynamics, numerical methods, state estimation, control, perception, localization and mapping, and motion planning for mobile robots. Emphasizes practical robot applications ranging from disaster response to healthcare to space exploration.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5552",
    "title": "Assistive Robotics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14035" }],
    "description": "Investigates the what (modeling), how (design), and why (analysis) of assistive robotics through the use of model-based design process. System models are essential to four key aspects of the assistive robot design process: derivation of executable specifications, hardware and software design based on simulations, implementation by code generation, and continuous testing and verification. Topics may include modeling continuous and discrete dynamics, heterogeneous models, hybrid systems, stochastic models, models of computation, analysis and design of embedded control systems with applications in assistive robotics, system simulation, and validation and verification techniques. Course projects emphasize model-based design for control of assistive robots in smart environments.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "EECE", "number": "2160" },
      "And",
      { "subject": "EECE", "number": "2520" },
      ")",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EECE",
    "number": "5554",
    "title": "Robotics Sensing and Navigation",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19041" },
      { "term": "202310", "crn": "20685" }
    ],
    "description": "Examines the actual sensors and mathematical techniques for robotic sensing and navigation with a focus on sensors such as cameras, sonars, and laser scanners. These are used in association with techniques and algorithms for dead reckoning and visual inertial odometry in conjunction with GPS and inertial measurement units. Covers Kalman filters and particle filters as applied to the SLAM problem. A large component of the class involves programming in both the ROS and LCM environments with real field robotics sensor data sets. Labs incorporate real field sensors and platforms. Culminates with both an individual design project and a team-based final project of considerable complexity.",
    "coreqs": [],
    "prereqs": [
      "(",
      "(",
      { "subject": "MATH", "number": "3081" },
      "Or",
      { "subject": "EECE", "number": "3468" },
      ")",
      "And",
      "(",
      { "subject": "EECE", "number": "2160" },
      "Or",
      { "subject": "EECE", "number": "2210" },
      ")",
      ")",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EECE",
    "number": "5610",
    "title": "Digital Control Systems",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13494" }],
    "description": "Covers sampling and analysis tools for linear discrete-time dynamic systems, including the design of digital control systems using transform techniques by discrete equivalent and direct design methods; root locus, Bode and Nyquist diagrams, and Nichols charts; controller implementation issues, such as digital filter realizations, nonlinear effects due to quantization, round off, dead band, and limit cycles; and selection of the sampling rate.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "5580" },
      "Or",
      { "subject": "EECE", "number": "5580" }
    ]
  },
  {
    "subject": "EECE",
    "number": "5640",
    "title": "High-Performance Computing",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "17012" }],
    "description": "Covers accelerating scientific and other applications on computer clusters, many-core processors, and graphical processing units (GPUs). Modern computers take advantage of multiple threads and multiple cores to accelerate scientific and engineering applications. Topics covered include parallel computer architecture, parallel programming models, and theories of computation, as well as models for many-core processing. Highlights implementation of computer arithmetic and how it varies on different computer architectures. Includes an individual project where each student is expected to implement an application, port that application to several different styles of parallelism, and compare the results. Programming is done in variants of the C programming language.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5641",
    "title": "Introduction to Software Security",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14032" }],
    "description": "Offers students an opportunity to learn how the security of systems can be violated and how such attacks can be detected and prevented. Computer security problems have a significant impact on practical aspects of our lives. Despite a considerable corpus of knowledge about tools and techniques to protect systems, information about actual vulnerabilities and how they are exploited is not generally available. Covers common programming, configuration, and design mistakes and examines possible protection and detection techniques.Uses examples to highlight general error classes. Includes a number of practical lab assignments that require students to apply their knowledge, as well as engage in a discussion of the current research in the field.",
    "coreqs": [],
    "prereqs": [
      "(",
      "(",
      { "subject": "EECE", "number": "2540" },
      "And",
      "(",
      { "subject": "EECE", "number": "4534" },
      "Or",
      { "subject": "EECE", "number": "3324" },
      ")",
      ")",
      "Or",
      "(",
      { "subject": "CS", "number": "3650" },
      "And",
      "(",
      { "subject": "CS", "number": "3700" },
      "Or",
      { "subject": "EECE", "number": "2540" },
      ")",
      ")",
      "Or",
      "(",
      { "subject": "EECE", "number": "7205" },
      "And",
      "(",
      { "subject": "EECE", "number": "7376" },
      "Or",
      { "subject": "CS", "number": "5600" },
      ")",
      ")",
      ")"
    ]
  },
  {
    "subject": "EECE",
    "number": "5644",
    "title": "Introduction to Machine Learning and Pattern Recognition",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16643" },
      { "term": "202310", "crn": "12593" },
      { "term": "202310", "crn": "16951" },
      { "term": "202260", "crn": "60380" },
      { "term": "202240", "crn": "41083" }
    ],
    "description": "Studies machine learning (the study and design of algorithms that enable computers/machines to learn from experience/data). Covers a range of algorithms, focusing on the underlying models between each approach. Emphasizes the foundations to prepare students for research in machine learning. Topics include Bayes decision theory, maximum likelihood parameter estimation, model selection, mixture density estimation, support vector machines, neural networks, probabilistic graphics models, and ensemble methods (boosting and bagging). Offers students an opportunity to learn where and how to apply machine learning algorithms and why they work.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "3468" },
      "Or",
      { "subject": "MATH", "number": "3081" },
      "Or",
      { "subject": "EECE", "number": "7204" },
      "Or",
      { "subject": "DS", "number": "5020" },
      "Or",
      { "subject": "MATH", "number": "1215" },
      "Or",
      { "subject": "MATH", "number": "2280" },
      "Or",
      { "subject": "IE", "number": "3412" },
      "Or",
      "Or",
      { "subject": "BIOE", "number": "2365" },
      "Or",
      { "subject": "MGSC", "number": "2301" }
    ]
  },
  {
    "subject": "EECE",
    "number": "5682",
    "title": "Power Systems Analysis 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19042" },
      { "term": "202310", "crn": "19043" }
    ],
    "description": "Covers fundamentals including phasors, single-phase and balanced three-phase circuits, complex power, and network equations; symmetrical components and sequence networks; power transformers, their equivalent circuits, per unit notation, and the sequence models; transmission line parameters including resistance, inductance, and capacitance for various configurations; steady-state operation of transmission lines including line loadability and reactive compensation techniques; power flow studies including Gauss-Speidel and Newton Raphson interactive schemes; symmetrical faults including formation of the bus impedance matrix; and unsymmetrical faults including line-to-ground, line-to-line, and double line-to-ground faults.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5693",
    "title": "Electromagnetic Devices for RF and Wireless Communications",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202240", "crn": "41122" },
      { "term": "202240", "crn": "41921" }
    ],
    "description": "Introduces some of the unique electromagnetic devices integrated in current and future technologies in the field of electromagnetics. These devices have impacted various disciplines including wireless systems, radar and space research, photonics, and bio and medical imaging. Covers transmission lines, RF/microwave circuits, high-frequency power dividers, and filters components. Discusses the translational area of antennas and wireless systems, radiation synthesis, and array antennas. Discusses some photonic components, as well as emerging applications such as antennas for 5G, massive MIMO (multiple-input and multiple-output) wireless antennas, and wearable sensors.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5698",
    "title": "ST:Organic&amp;Printed Electronics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15248" },
      { "term": "202310", "crn": "16349" },
      { "term": "202310", "crn": "16941" },
      { "term": "202310", "crn": "17527" }
    ],
    "description": "This course will discuss how to develop code libraries and applications that can communicate with each other over a network, using C++ as a programming language. Students will learn how to implement programs in C++, starting from the basics and progressing to more complex features (like inheritance, templates, smart pointers). The final aim is to understand principles and the logic of multithreading and socket programming, namely, the core of network programming. In-class lab sessions will be organized in parallel to the lectures for hands-on experiences. This course will provide the students with solid knowledge and skills not only to theoretically understand the basic concepts of network programming, but also to practically develop the software that will run the connected society of the future.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "5699",
    "title": "Computer Hardware and System Security",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19044" },
      { "term": "202240", "crn": "41384" }
    ],
    "description": "Introduces computer hardware and system security. Covers state-of-the-art hardware security and trust issues, including a hands-on lab session to implement various hardware security attacks. Topics include applied cryptography, side-channel attacks, differential power analysis, fault injection and analysis, cache side-channel attacks (Meltdown and Spectre), acoustic analysis, and hardware security primitives (physical unclonable function and random number generator).",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "3324" },
      "Or",
      { "subject": "CS", "number": "3650" },
      "Or",
      { "subject": "CS", "number": "5600" },
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EECE",
    "number": "7200",
    "title": "Linear Systems Analysis",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16644" },
      { "term": "202310", "crn": "10590" },
      { "term": "202310", "crn": "16953" }
    ],
    "description": "Covers fundamental algebraic concepts and algebraic structures. Topics include linear operators and their representations; matrices, algebraic equations, equivalence, and similarity transformations; introduction to the state-variable theory of continuous and discrete linear systems; standard canonical representations, the concept of state, and the representation of interconnected systems, linear spaces, the state equations, and their solution; stability; and introduction to the general control problem in terms of controllability and observability.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7202",
    "title": "Electromagnetic Theory 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11518" },
      { "term": "202310", "crn": "16954" }
    ],
    "description": "Examines the fundamental equations, their physical meaning, principal mathematical techniques, and important engineering applications. Topics include sources of the electromagnetic field, Lorentz force equation, integral form of Maxwell&amp;#8217;s equations and point relations (differential equations and boundary conditions), electromagnetic energy and power, propagation of uniform and nonuniform plane waves in homogeneous media, reflection and refraction, scalar and vector potentials, solutions in the absence of boundaries for static and dynamic problems, solutions to boundary value problems, duality, uniqueness, images, physical theory of diffraction, and general theory of metal and dielectric wave-guides and resonators for Cartesian and cylindrical systems.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7203",
    "title": "Complex Variable Theory and Differential Equations",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16350" }],
    "description": "Comprises the theory of functions of a complex variable. Covers Cauchy&amp;#8217;s integral and related theorems, Taylor and Laurent series, analytic continuation, and multivalued functions. Considers special functions of mathematical physics using generating functions, Taylor and Laurent expansions, and various integral representations. Reviews applications of complex variable theory drawn from optics and electromagnetic theory and from digital signal processing and digital communications. Focuses on the theory of ordinary and partial differential equations of mathematical physics. Develops series solutions of ordinary differential equations of second order using the tools of complex variable theory. Covers Sturm-Liouville theory and uses it to develop eigen function and Green function solutions of homogeneous and inhomogeneous partial differential equations. Requires knowledge of undergraduate advanced calculus.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7204",
    "title": "Applied Probability and Stochastic Processes",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14316" },
      { "term": "202310", "crn": "12528" },
      { "term": "202310", "crn": "16955" }
    ],
    "description": "Covers the fundamentals of probabilistic treatment and the concept of random processes, which are essential for many engineering disciplines and data analysis in general. Includes the basic laws of probability, random variables and their functions, probability density and cumulative distributions, statistical averages, bounds on probability, and the central limit theorem. Outlines basic principles of statistics, including estimation of probability, confidence intervals, and order statistics. Provides an overview of detection and estimation problems, including maximum likelihood and Bayesian principles, Cramer-Rao bound, linear estimators, and hypothesis testing. Studies random sequences, with notions of convergence, laws of large numbers, and examples of Markov chains. Defines random processes, along with the concepts of stationarity, ergodicity, autocorrelation and power spectral density, and filtering operations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7205",
    "title": "Fundamentals of Computer Engineering",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "18220" },
      { "term": "202310", "crn": "13384" },
      { "term": "202310", "crn": "16956" }
    ],
    "description": "Introduces fundamental techniques in computer engineering used throughout the graduate curriculum. Covers basic programming and analysis methods and the formulation and solution of a wide range of computer engineering problems. Also discusses the applications of algorithm analysis and complexity theory to analyzing and solving problems. Emphasizes those fundamental computational problems and related algorithms whose solution can be obtained in polynomial time. For basic computational problems such as sorting, searching, elementary graph algorithms, shortest-paths problems, as well as flow problems in networks, many different algorithms and data structures are described and analyzed, implemented, and compared both from a theoretical and from an experimental point of view.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7211",
    "title": "Nonlinear Control",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19045" }],
    "description": "Discusses phase plane analysis for nonlinear systems. Topics include fundamentals of Lyapunov theory; absolute stability, passivity, averaging, singular perturbation, input-output stability, and other advanced stability topics; describing functions; nonlinear control methods based on linearization, feedback linearization, sliding control, Lyapunov, and passivity and center manifold theory and bifurcations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7228",
    "title": "Advanced Power Electronics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14913" },
      { "term": "202310", "crn": "20806" }
    ],
    "description": "Designed to familiarize students with advanced power electronic circuits. Covers single-phase and three-phase rectifiers and inverters, including their principles of the operation, design, analysis, and applications. Diode rectifiers, phase-controlled rectifiers, and switch mode rectifiers and inverters are among the topics. Introduces different modulation techniques. If time permits, covers three-phase ac-ac converters and soft switching techniques, as well.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "5684" },
      "Or",
      { "subject": "EECE", "number": "5684" }
    ]
  },
  {
    "subject": "EECE",
    "number": "7240",
    "title": "Analog Integrated Circuit Design",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11378" },
      { "term": "202310", "crn": "16958" }
    ],
    "description": "Treats the analysis and design of analog ICs, their functional performance, and applications. Focuses on the various building blocks of analog circuits, their operation, and the underlying principles and techniques, with analysis supplemented  by CAD simulation. Topics include modeling and layout of CMOS, bipolar, BiCMOS devices, and passive components;  DC building blocks, including precision current and voltage references;  performance analysis of signal gain, impedances, and frequency response and speed of basic/compound amplifier structures;  architectures of operational amplifiers, including low-voltage, OTAs, and three-stage designs; feedback and performance merits, topologies, instability, and frequency compensation of feedback amplifiers; nonlinear and analog computation IC functions; noise in ICs,  physical origins and device modeling , noise circuit analysis, SNR and NF, and techniques for the enhancement of system noise performance.",
    "coreqs": [{ "subject": "EECE", "number": "7248" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7244",
    "title": "Introduction to Microelectromechanical Systems (MEMS)",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14914" },
      { "term": "202310", "crn": "20041" }
    ],
    "description": "Introduces microelectromechanical systems, including principles of sensing and actuation, microfabrication technology for MEMS, noise concepts, and packaging techniques. Covers a wide range of disciplines, from electronics to mechanics, material properties, microfabrication technology, electromagnetics, and optics. Studies several classes of devices including inertial measurement devices, pressure sensors, rf components, and optical MEMS. Devotes the last third of the semester largely to projects involving design of MEMS devices to specifications in a realistic fabrication process.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7245",
    "title": "Microwave Circuit Design for Wireless Communication",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12024" },
      { "term": "202310", "crn": "16959" }
    ],
    "description": "Covers planar microwave circuits and integrated circuits (MMICs) for wireless communication systems. Employs microwave CAD tools in design projects as well as in-class case-study examples. Reviews communication system basics, modulation and demodulation, architectures of receivers and transmitters, and system performance. Covers planar transmission lines and coupled lines and their application to important devices and microwave circuit functions and multiport networks using S-parameters, flow graphs, and Smith charts. Studies microwave filters, narrowband and broadband amplifiers, their gain and stability, impedance matching, and noise performance, as well as mixers and frequency-conversion techniques. Finishes with design and performance of microwave oscillators. Covers wireless standards, multiple-access techniques, and recent advances if time permits.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7247",
    "title": "Radio Frequency Integrated Circuit Design",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19046" }],
    "description": "Introduces radio frequency (RF) integrated circuit analysis, design, and simulation methods with an emphasis on CMOS implementations. Covers basic RF design concepts including linearity, noise figure, sensitivity, impedance matching, and imperfections of integrated passive components (parasitics, quality factors). Discusses front-end circuit design considerations for low-noise amplifiers, mixers, oscillators, and power amplifiers.",
    "coreqs": [],
    "prereqs": [
      { "subject": "EECE", "number": "7240" },
      "Or",
      { "subject": "EECE", "number": "5649" },
      "Or",
      { "subject": "EECE", "number": "5649" }
    ]
  },
  {
    "subject": "EECE",
    "number": "7248",
    "title": "Lab for EECE 7240",
    "scheduleType": "Lab",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14034" }],
    "description": "Accompanies EECE 7240. Covers topics from the course through various experiments.",
    "coreqs": [{ "subject": "EECE", "number": "7240" }],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7296",
    "title": "Electronic Materials",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19862" }],
    "description": "Offers a basic treatment of electronic materials from atomic, molecular, and application viewpoints. Topics include atomic structure and bonding in materials, structure of materials, and crystal defects. These topics lay a foundation for thermal and electronic conduction, which is the underlying physics of electronic devices. Examines the electronic properties of semiconductors, dielectric, magnetic, superconducting, and optical materials. The latter half of the course deals with an introduction to state-of-the-art electronic materials, including semiconductor nanoelectronics, magnetic semiconductors and Spintronics, molecular electronics, carbon nanotubes, conducting polymers, graphene and graphane, and other topics representing recent technological breakthroughs in the area of electronic materials.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7297",
    "title": "Advanced Magnetic Materials&amp;#8212;Magnetic Devices",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19047" }],
    "description": "Covers magnetism and magnetic materials, their applications in different industries, magnetic devices, and the frontiers of research activities on magnetism and magnetic materials. Topics include magnetics units, magnetic materials classification, origin of ferromagnetism and ferrimagnetism, magnetic anisotropies, magnetostriction, magnetic domain theory, ferromagnetic/ferrimagnetic resonance, soft magnetic materials, hard magnetic materials, applications of magnetic materials, information storage, and leading-edge research. Includes lectures on different magnetic sensors&amp;#8212;including AMR, GMR, TMR, fluxgate, magnetoelectric sensors, etc.&amp;#8212;and on microwave magnetic devices&amp;#8212;including tunable filters, phase shifters, isolators, circulators, etc.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7337",
    "title": "Information Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19048" },
      { "term": "202310", "crn": "19049" }
    ],
    "description": "Discusses basic properties of entropy and mutual information, Shannon&amp;#8217;s fundamental theorems on data compression and data transmission in the single-user case, binning, and covering lemmas. Topics include rate distortion theory, feedback in one-way channels, Slepian-Wolf coding of correlated information sources, source coding with side information at the receiver, multiple access channel and its capacity region, and the capacity region of the Gaussian multiple access channel. Also covers broadcast channels, superposition coding, and the capacity region of the degraded broadcast channel; performance and comparison of TDMA, FDMA, and CDMA systems from a theoretical point of view; capacity issues for time-varying channels and channels with memory; relation between information theory and statistics; Stein&amp;#8217;s lemma; and large deviation theory.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7346",
    "title": "Probabilistic System Modeling and Analysis",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "17862" }],
    "description": "Covers fundamentals of probabilistic system modeling, building toward techniques that allow analyzing complex stochastic systems in a tractable fashion. Modeling large and complex systems requires reasoning about probabilistic behavior at a large scale. Reviews classic topics like Markov chains, convergence to a steady state, renewal processes, renewal reward processes, the strong law of large numbers, and the elementary renewal theorem. Additional topics include the asymptotic behavior of probabilistic systems, including stochastic approximation/Robbins-Monro type algorithms, and ODE/fluid limits. Illustrates how these modeling techniques can be applied in modeling real systems and adaptive algorithms, including queueing systems, distributed systems, and online learning algorithms like stochastic gradient descent.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7352",
    "title": "Computer Architecture",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12035" }],
    "description": "Presents many of the issues involved in the design and analysis of new and evolving computer architectures. Topics include all aspects of the system including the microprocessor, memory, I/O, and networking. Emphasizes the connection between architecture and the underlying software that drives it. Topics include pipelining, superscalar, out-of-order execution and completion, data flow, caching, prefetching, virtual memory, RAID, and ATM switching. Performance analysis is another fundamental theme of this course. A project is assigned that involves the creation of a trace-driven simulation model to study the performance of various hardware or software architectural features. Also provides a survey of the current state of the art in processor architectures and provides additional readings from recent research in the field. Requires a working knowledge of C programming language.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7368",
    "title": "High-Level Design of Hardware-Software Systems",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19050" }],
    "description": "Presents state-of-the-art methods, tools, and techniques for system-level design and modeling of complete multiprocessor systems from specification down to implementation across hardware-software boundaries. Recognizes that system complexities are growing exponentially, driven by ever-increasing application demands and technological advances that allow one to put complete multiprocessor systems on a chip (MPSoCs). System-level design that jointly covers hardware and software is one approach to address the associated complexities in the design process and the market pressures. Using system-level design languages (e.g., SpecC, SystemC), offers students an opportunity to specify, simulate, analyze, model, and design hardware-software systems based on examples of typical embedded applications. Requires working knowledge of C/C++, algorithms, and data structures.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7370",
    "title": "Advanced Computer Vision",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19051" }],
    "description": "Offers students an opportunity to obtain practical knowledge in computer vision and to develop skills for being a successful researcher in this field. The goal of the field of computer vision is to make useful decisions about real physical objects and scenes based on sensed images. Achieving this goal requires obtaining and using descriptions (models) of the sensors and the world. Computer vision is an exciting field that builds on very diverse disciplines such as image processing, statistics, pattern recognition, control theory and system identification, physics, geometry, computer graphics, and machine learning. Course material includes state-of-the-art in the field, current research trends, and algorithms and their applications, with an emphasis on the mathematical methods used.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7374",
    "title": "Fundamentals of Computer Networks",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19052" }],
    "description": "Presents an overview of modern communication networks using the internet as a primary case study. Uses the concept of layered network architecture as a framework for understanding the principal functions and services required for achieving reliable end-to-end communications. Topics include networking application design and network programming (socket programming), service interfaces and peer-to-peer protocols, the reference model for TCP/IP (internet), transport layer and network layer issues, data link layer and LANs (local area networks) architectures, and important emerging technologies, including software-defined networking (SDN). Covers the basics of wireless and mobile networking (principles and practice) and standardization and policy issues concerning communications and networks.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7393",
    "title": "Analysis and Design of Data Networks",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19748" }],
    "description": "Introduces fundamental concepts and approaches for the analysis and design of data networks. Covers delay models, multi-access communication, scheduling, routing, congestion control, and network coding. Presents analytical techniques such as basic queuing theory, queuing networks, optimization, stochastic control, and distributed algorithms. Requires knowledge of basic probability.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7398",
    "title": "ST:AdvRadioFreqncyPassiveTech",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19053" },
      { "term": "202310", "crn": "17062" },
      { "term": "202310", "crn": "16645" },
      { "term": "202310", "crn": "19054" },
      { "term": "202310", "crn": "14177" },
      { "term": "202310", "crn": "16962" }
    ],
    "description": "Following the successful commercial deployment of 5G networks, future 6G networks are already being conceived. Currently, both academia and industry (e.g., Apple, Qualcomm, Samsung, Huawei) unanimously agree on the critical role that the terahertz band (i.e., the frequencies between 100 GHz and 10 THz) will play in 6G. In this course, you will learn the fundamentals of terahertz communication networks for 6G, by following a holistic bottom-up approach from RF devices and wireless propagation, to ultrabroadband communications and ultradirectional networks.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7400",
    "title": "Special Problems in Electrical and Computer Engineering",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13631" },
      { "term": "202310", "crn": "15662" },
      { "term": "202310", "crn": "17586" },
      { "term": "202310", "crn": "18329" },
      { "term": "202310", "crn": "18459" },
      { "term": "202310", "crn": "20870" },
      { "term": "202260", "crn": "61396" },
      { "term": "202260", "crn": "60936" },
      { "term": "202260", "crn": "61194" }
    ],
    "description": "Offers theoretical or experimental work under individual faculty supervision.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7440",
    "title": "Electrical and Computer Engineering Leadership Challenge Project 1",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "17438" }],
    "description": "Offers students an opportunity to develop and present a plan for the demonstration of a marketable technology product or prototype with an electrical engineering focus. Constitutes the first half of a thesis-scale project in technology commercialization. Requires work/training with a sponsoring organization or employer to improve a process or develop a project that is of significant value to the organization and demonstrates a quantifiable market impact, while enhancing the student&rsquo;s technological and engineering depth and fostering the student&rsquo;s leadership development.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7674",
    "title": "Master&amp;#8217;s Project",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15309" },
      { "term": "202310", "crn": "18231" },
      { "term": "202260", "crn": "61576" }
    ],
    "description": "Offers analytical and/or experimental work leading to a written report and a final short presentation by the end of the semester.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7986",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202260", "crn": "61549" }],
    "description": "Offers students an opportunity to conduct full-time research under faculty supervision.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7990",
    "title": "Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17016" },
      { "term": "202310", "crn": "20294" },
      { "term": "202310", "crn": "15224" },
      { "term": "202310", "crn": "17396" },
      { "term": "202310", "crn": "18062" },
      { "term": "202310", "crn": "13804" },
      { "term": "202310", "crn": "18103" },
      { "term": "202310", "crn": "18199" },
      { "term": "202310", "crn": "18345" },
      { "term": "202310", "crn": "14406" },
      { "term": "202310", "crn": "13857" },
      { "term": "202310", "crn": "15905" },
      { "term": "202310", "crn": "18515" },
      { "term": "202260", "crn": "61078" },
      { "term": "202260", "crn": "61590" }
    ],
    "description": "Offers analytical and/or experimental work conducted under the auspices of the department. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "7996",
    "title": "Thesis Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "18212" },
      { "term": "202310", "crn": "18299" },
      { "term": "202310", "crn": "18451" },
      { "term": "202310", "crn": "18453" }
    ],
    "description": "Offers analytical and/or experimental work conducted under the auspices of the department.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "8986",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "18296" },
      { "term": "202310", "crn": "15844" },
      { "term": "202310", "crn": "15889" }
    ],
    "description": "Offers students an opportunity to conduct full-time research under faculty supervision. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "9986",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15776" },
      { "term": "202310", "crn": "20292" },
      { "term": "202310", "crn": "15734" },
      { "term": "202310", "crn": "14385" },
      { "term": "202310", "crn": "15796" },
      { "term": "202310", "crn": "17834" },
      { "term": "202310", "crn": "14414" },
      { "term": "202310", "crn": "14462" },
      { "term": "202310", "crn": "20464" },
      { "term": "202310", "crn": "20640" },
      { "term": "202310", "crn": "20946" },
      { "term": "202310", "crn": "14443" },
      { "term": "202310", "crn": "14465" },
      { "term": "202310", "crn": "15856" },
      { "term": "202310", "crn": "18040" },
      { "term": "202310", "crn": "18142" },
      { "term": "202310", "crn": "18214" },
      { "term": "202310", "crn": "18447" },
      { "term": "202310", "crn": "18465" },
      { "term": "202310", "crn": "18495" },
      { "term": "202310", "crn": "18583" },
      { "term": "202310", "crn": "18613" },
      { "term": "202310", "crn": "15916" },
      { "term": "202310", "crn": "13869" },
      { "term": "202310", "crn": "12920" },
      { "term": "202310", "crn": "18501" },
      { "term": "202310", "crn": "20688" },
      { "term": "202310", "crn": "21011" },
      { "term": "202260", "crn": "61567" },
      { "term": "202260", "crn": "61613" },
      { "term": "202260", "crn": "61625" },
      { "term": "202260", "crn": "61653" },
      { "term": "202260", "crn": "61654" },
      { "term": "202240", "crn": "41979" }
    ],
    "description": "Offers students an opportunity to conduct full-time research under faculty supervision. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "9990",
    "title": "Dissertation Term 1",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17325" },
      { "term": "202310", "crn": "17366" },
      { "term": "202310", "crn": "17669" },
      { "term": "202310", "crn": "17691" },
      { "term": "202310", "crn": "15447" },
      { "term": "202310", "crn": "17488" },
      { "term": "202310", "crn": "13831" },
      { "term": "202310", "crn": "17489" },
      { "term": "202310", "crn": "15751" },
      { "term": "202310", "crn": "17552" },
      { "term": "202310", "crn": "18094" },
      { "term": "202310", "crn": "14450" },
      { "term": "202310", "crn": "10971" },
      { "term": "202310", "crn": "18125" },
      { "term": "202310", "crn": "18150" },
      { "term": "202310", "crn": "15790" },
      { "term": "202310", "crn": "18330" },
      { "term": "202310", "crn": "14416" },
      { "term": "202310", "crn": "18424" },
      { "term": "202310", "crn": "18450" },
      { "term": "202310", "crn": "14296" },
      { "term": "202310", "crn": "14388" },
      { "term": "202310", "crn": "15839" },
      { "term": "202310", "crn": "11453" },
      { "term": "202310", "crn": "15860" },
      { "term": "202310", "crn": "12169" },
      { "term": "202310", "crn": "12775" },
      { "term": "202310", "crn": "18304" }
    ],
    "description": "Offers theoretical and/or experimental work conducted under the auspices of the department. Includes attendance at Distinguished Lecture Series (DLS).",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EECE",
    "number": "9991",
    "title": "Dissertation Term 2",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15006" },
      { "term": "202310", "crn": "16942" },
      { "term": "202310", "crn": "18210" },
      { "term": "202310", "crn": "15035" },
      { "term": "202310", "crn": "20197" },
      { "term": "202310", "crn": "20198" },
      { "term": "202310", "crn": "20199" },
      { "term": "202310", "crn": "20200" },
      { "term": "202310", "crn": "20201" },
      { "term": "202310", "crn": "20202" },
      { "term": "202310", "crn": "20203" },
      { "term": "202310", "crn": "20204" },
      { "term": "202310", "crn": "20205" },
      { "term": "202310", "crn": "20206" },
      { "term": "202310", "crn": "20207" },
      { "term": "202310", "crn": "20208" },
      { "term": "202310", "crn": "20226" },
      { "term": "202260", "crn": "61612" }
    ],
    "description": "Offers dissertation supervision by members of the department.",
    "coreqs": [],
    "prereqs": [{ "subject": "EECE", "number": "9990" }]
  },
  {
    "subject": "EECE",
    "number": "9996",
    "title": "Dissertation Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10975" },
      { "term": "202310", "crn": "13633" },
      { "term": "202310", "crn": "15210" },
      { "term": "202310", "crn": "11011" },
      { "term": "202310", "crn": "11032" },
      { "term": "202310", "crn": "14250" },
      { "term": "202310", "crn": "13646" },
      { "term": "202310", "crn": "10976" },
      { "term": "202310", "crn": "11012" },
      { "term": "202310", "crn": "10977" },
      { "term": "202310", "crn": "10978" },
      { "term": "202310", "crn": "10979" },
      { "term": "202310", "crn": "10980" },
      { "term": "202310", "crn": "10981" },
      { "term": "202310", "crn": "15622" },
      { "term": "202310", "crn": "10982" },
      { "term": "202310", "crn": "17501" },
      { "term": "202310", "crn": "15480" },
      { "term": "202310", "crn": "11010" },
      { "term": "202310", "crn": "12376" },
      { "term": "202310", "crn": "13805" },
      { "term": "202310", "crn": "10984" },
      { "term": "202310", "crn": "10985" },
      { "term": "202310", "crn": "10983" },
      { "term": "202310", "crn": "10986" },
      { "term": "202310", "crn": "11745" },
      { "term": "202310", "crn": "15809" },
      { "term": "202310", "crn": "10987" },
      { "term": "202310", "crn": "14349" },
      { "term": "202310", "crn": "11746" },
      { "term": "202310", "crn": "11925" },
      { "term": "202310", "crn": "13792" },
      { "term": "202310", "crn": "14392" },
      { "term": "202310", "crn": "11454" },
      { "term": "202310", "crn": "14419" },
      { "term": "202310", "crn": "11455" },
      { "term": "202310", "crn": "13828" },
      { "term": "202310", "crn": "11594" },
      { "term": "202310", "crn": "13829" },
      { "term": "202310", "crn": "14446" },
      { "term": "202310", "crn": "12548" },
      { "term": "202310", "crn": "14477" },
      { "term": "202310", "crn": "18089" },
      { "term": "202310", "crn": "15757" },
      { "term": "202310", "crn": "18114" },
      { "term": "202310", "crn": "18120" },
      { "term": "202310", "crn": "18143" },
      { "term": "202310", "crn": "18242" },
      { "term": "202310", "crn": "18278" },
      { "term": "202310", "crn": "18327" },
      { "term": "202310", "crn": "20209" },
      { "term": "202310", "crn": "20333" },
      { "term": "202310", "crn": "20457" },
      { "term": "202240", "crn": "41891" },
      { "term": "202240", "crn": "41915" }
    ],
    "description": "Offers continued dissertation work conducted under the supervision of a departmental faculty member. Includes attendance at Distinguished Lecture Series (DLS).",
    "coreqs": [],
    "prereqs": []
  }
]
