[
  {
    "subject": "EEMB",
    "number": "1101",
    "title": "Foundations in Ecology and Evolutionary Biology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND"],
    "sections": [{ "term": "202310", "crn": "14572" }],
    "description": "Introduces students to the foundational principles of ecology and evolutionary biology. Merges traditional lectures on foundational topics in ecology and evolutionary biology (adaptation, mechanisms of evolution, community and ecosystems ecology) with explorations of local field sites and an introduction to field ecology. Students spend several weeks of the semester designing and implementing independent field research projects, through which they are exposed to the foundation of scientific inquiry, including hypothesis testing, collecting, managing, and analyzing data, and presenting their findings.",
    "coreqs": [{ "number": "1102" }],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "1102",
    "title": "Lab for EEMB 1101",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13993" }],
    "description": "Accompanies EEMB 1101. Covers topics from the course through various experiments.",
    "coreqs": [{ "number": "1101" }],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "1105",
    "title": "Foundations in Ecological and Evolutionary Genomics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "ND"],
    "sections": [{ "term": "202330", "crn": "33766" }],
    "description": "Introduces students to the foundational principles of molecular ecology with an emphasis on applications of high-throughput sequencing techniques to answer questions in ecology and evolutionary biology. Covers foundational topics in ecological and evolutionary genomics (central dogma, structure of nucleic acids, genetic variation, tools in molecular ecology, understanding genomes, and genomics). Practical skills development includes clean technique and proper bench skills; basic command line programming; understanding, quantifying, and analyzing sequence variation; and visualizing genomic data for formal scientific presentations."
  },
  {
    "subject": "EEMB",
    "number": "1106",
    "title": "Lab for EEMB 1105",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "33767" },
      { "term": "202330", "crn": "35808" }
    ],
    "description": "Accompanies EEMB 1105. Covers topics from the course through various experiments. Focuses on providing firsthand experience using tools from molecular ecology to test ecological and/or evolutionary hypotheses."
  },
  {
    "subject": "EEMB",
    "number": "1145",
    "title": "Beginning Scuba",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16871" },
      { "term": "202310", "crn": "16873" },
      { "term": "202310", "crn": "19335" },
      { "term": "202310", "crn": "19334" },
      { "term": "202240", "crn": "41090" },
      { "term": "202240", "crn": "41091" },
      { "term": "202330", "crn": "32070" },
      { "term": "202330", "crn": "32071" },
      { "term": "202330", "crn": "32072" },
      { "term": "202330", "crn": "32073" }
    ],
    "description": "Focuses on basic skin diving and scuba diving skills, with emphasis on safety. Requires lab fee. Requires ability to pass a swim test and basic comfort in the water.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "2302",
    "title": "Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["FQ", "WI"],
    "sections": [
      { "term": "202310", "crn": "14573" },
      { "term": "202330", "crn": "33768" },
      { "term": "202310", "crn": "20735" }
    ],
    "description": "Offers students an opportunity to learn about the environmental and biological processes that control the distribution and abundance of species and controlling factors that operate on individuals, populations, and communities. The lecture and laboratory introduce a set of generalizable concepts that are of fundamental importance to plant and animal life on the land and in the sea and provide hands-on experiential learning that reinforce concepts covered in lecture. Offers students an opportunity to become proficient in the following: (a) understanding research results the primary literature; (b) conducting a research experiment; (c) interpreting the results of in-class research; (d) communicating results as manuscript.",
    "coreqs": [
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" },
      { "number": "2303" }
    ],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "2303",
    "title": "Lab for EEMB 2302",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14574" },
      { "term": "202310", "crn": "14575" },
      { "term": "202310", "crn": "17066" },
      { "term": "202310", "crn": "19336" },
      { "term": "202310", "crn": "19337" },
      { "term": "202330", "crn": "33769" },
      { "term": "202330", "crn": "33770" },
      { "term": "202330", "crn": "35084" },
      { "term": "202330", "crn": "35809" },
      { "term": "202330", "crn": "38329" },
      { "term": "202310", "crn": "20736" }
    ],
    "description": "Accompanies EEMB 2302. Covers topics from the course through various experiments.",
    "coreqs": [
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" },
      { "number": "2302" }
    ],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "2400",
    "title": "Introduction to Evolution",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND"],
    "sections": [
      { "term": "202310", "crn": "12400" },
      { "term": "202310", "crn": "20772" },
      { "term": "202330", "crn": "34460" },
      { "term": "202330", "crn": "39311" }
    ],
    "description": "Introduces evolutionary thinking, including contemporary examples of evolution. To understand the evolution of Charles Darwin's “endless forms most beautiful,” the course adopts an integrative approach that includes information from ecology, genetics, molecular biology, biogeography, and paleobiology. Considers mechanisms of evolutionary change—how does it happen? Examines adaptation, the process by which attributes of an organism change to enhance fitness and the evolutionary history of life on our planet—what was the first living thing, how does speciation occur, what have we learned about evolution of life in the distant past, and how did humans evolve. Includes student presentations and analysis of scientific literature.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "2700",
    "title": "Marine Biology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND", "WI"],
    "sections": [{ "term": "202330", "crn": "35810" }],
    "description": "Examines biological aspects of natural ocean ecosystems and the physical processes that regulate them. Covers distributions, abundances, and interactions of marine organisms; interactions between organisms and the transformation and flux of energy and matter in marine ecosystems; and aspects of physiology related to marine species distributions, abundances, and roles. Students generate, evaluate, discuss, and present data from primary research and apply their knowledge of the scientific method and biological concepts through the creation of a written grant proposal."
  },
  {
    "subject": "EEMB",
    "number": "2701",
    "title": "Lab for EEMB 2700",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "35811" },
      { "term": "202330", "crn": "35812" },
      { "term": "202330", "crn": "35813" }
    ],
    "description": "Accompanies EEMB 2700. Covers topics from the lecture course through discussions and experiments."
  },
  {
    "subject": "EEMB",
    "number": "3455",
    "title": "Ecosystems Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "ND"],
    "sections": [{ "term": "202310", "crn": "19338" }],
    "description": "Focuses on the foundational principles of ecosystems ecology. Examines the flow of energy and materials through both the biosphere (plants, animals, and microbes) and the geosphere (soils, atmospheres, and oceans) and the role that humans are playing in altering these key fluxes. Studies elemental cycles that are critically important for human and environmental sustainability—including carbon, nitrogen, and phosphorus—and examines similarities and differences in these cycles and flows while drawing on examples from both terrestrial and marine systems. Seeks to understand how changes in ecosystem structure ultimately affect ecosystem function and how this translates into the important services ecosystems provide.",
    "coreqs": [],
    "prereqs": [
      { "subject": "BIOL", "number": "1107" },
      "Or",
      { "subject": "BIOL", "number": "1111" },
      "Or",
      "Or",
      "Or",
      "Or",
      "Or"
    ]
  },
  {
    "subject": "EEMB",
    "number": "3460",
    "title": "Conservation Biology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202330", "crn": "38330" }],
    "description": "Explores conservation biology, an interdisciplinary science that focuses on conservation of biological diversity at multiple levels. Emphasizes the causes and consequences of biodiversity loss and demonstrates how ecological and evolutionary principles are applied to conservation problems. Covers sustainability; climate change; introduced species; conservation of threatened and endangered species; and pollution, disease, and habitat restoration using examples from marine, aquatic, and terrestrial systems. Offers students an opportunity to read, discuss, evaluate, and present data from primary research through written assignments and oral debates and to apply this knowledge to conservation issues. Emphasizes critical thinking, problem solving, and recognizing multiple perspectives."
  },
  {
    "subject": "EEMB",
    "number": "3465",
    "title": "Ecological and Conservation Genomics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "ND"],
    "sections": [{ "term": "202310", "crn": "19339" }],
    "description": "Offers an overview of ecological and conservation genetics, an interdisciplinary science that focuses on understanding the processes that determine genetic diversity at the individual to population level. Focuses on fundamental concepts in evolutionary ecology and population and quantitative genetics, then applies those concepts to solving real-world problems in conservation science. Covers harvested populations, inbreeding, climate change, introduced species, conservation of threatened and endangered species, adaptation, and habitat restoration. Exposes students to multiple sides of these issues and the science that underpins them. Offers students an opportunity to develop the R programming skills required to analyze the complex data sets that often emerge when addressing cutting-edge questions in genetics. Includes writing and coding exercises and mathematical derivations. Emphasizes critical thinking and problem solving.",
    "coreqs": [],
    "prereqs": [
      { "subject": "BIOL", "number": "2301" },
      "Or",
      { "subject": "CS", "number": "2500" },
      "Or",
      { "subject": "ECON", "number": "2350" },
      "Or",
      "Or",
      "Or",
      { "subject": "MATH", "number": "3081" }
    ]
  },
  {
    "subject": "EEMB",
    "number": "3466",
    "title": "Disease Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "ND"],
    "sections": [{ "term": "202330", "crn": "35814" }],
    "description": "Covers the fundamentals of disease ecology and evolution. Focuses on how disease can impact the physiology of organisms and how this can, in turn, alter communities and ecosystems. Topics include mathematical theory on host-pathogen interactions; empirical studies of human, wildlife, insect, and plant host populations; emerging infectious diseases; effects on host behavior; host-parasite coevolution; multihost and multipathogen systems; and anthropogenic effects on disease. Includes writing exercises, with a special emphasis on critical thinking and problem solving."
  },
  {
    "subject": "EEMB",
    "number": "3475",
    "title": "Wildlife Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "ND"],
    "sections": [{ "term": "202330", "crn": "35815" }],
    "description": "Focuses on wildlife ecology and management, with an emphasis on terrestrial species. Introduces habitat use, behavior, wildlife conservation, parasites and pathogens, wildlife sampling, wildlife management, food and nutrition, population viability, and conservation genetics. Offers students an opportunity to engage in analyzing primary literature, collection, interpretation, and wildlife data and using basic mathematical models."
  },
  {
    "subject": "EEMB",
    "number": "3600",
    "title": "Animal Behavior",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19340" }],
    "description": "Covers the fundamental principles of animal behavior by focusing on the physiological, ecological, and genetic factors that promote the evolution of diverse behavioral responses in the animal kingdom. Offers students an opportunity to become critical thinkers and readers through discussion of the how and why animals evolve behaviors that appear to increase and/or decrease their fitness.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "4001",
    "title": "Landscape and Restoration Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND"],
    "sections": [{ "term": "202330", "crn": "38331" }],
    "description": "Topics include ecosystem processes, spatial patterns, disturbance, species distributions, invasive species, and habitat loss. Offers students an opportunity to participate in activities in which they look at and interpret spatial data. Course format includes group work, analyzing the scientific literature, and in-class activities."
  },
  {
    "subject": "EEMB",
    "number": "5130",
    "title": "Population Dynamics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202330", "crn": "38332" }],
    "description": "Presents a comprehensive overview of the mathematical and computational concepts needed to construct population models. Describes how to mathematically derive and model processes such as growth, competition, predation, dispersal, and environmental variability to understand the dynamics of populations in a changing world. Emphasizes the mathematical tools required to analyze the dynamical behavior of models (e.g., stability, invasion, graphical, and numerical analyses) and validate predictions using empirical data (e.g., via maximum likelihood and optimization methods). Offers students an opportunity to learn how to derive, analyze, and test models using free R programming in a supervised lab environment."
  },
  {
    "subject": "EEMB",
    "number": "5303",
    "title": "Marine Biology Careers Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16476" }],
    "description": "Covers the information and tools needed to begin pursuing career opportunities in marine biology. Encourages students to explore a variety of career paths, construct résumés, contact potential employers for their internship and permanent positions. Presents invited speakers from state and federal agencies, and from private consulting firms, to talk about their work and career track.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5305",
    "title": "Professional Development for Ocean Sciences",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38334" }],
    "description": "Designed to assist Three Seas students in securing a graduate research internship. Seeks to provide students with the information needed to pursue diverse career opportunities in marine biology. Provides hands-on experience with an array of science communication tools, including resumés/CVs, cover letters, and social media. Speakers from academia, informal science education organizations, and the media present talks on their work and career tracks."
  },
  {
    "subject": "EEMB",
    "number": "5504",
    "title": "Biology of Corals",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": ["AD"],
    "sections": [
      { "term": "202310", "crn": "20018" },
      { "term": "202330", "crn": "36731" }
    ],
    "description": "Covers a variety of topics including basic coral biology, the coral/algal symbioses, the mechanisms of coral bleaching, coral microbiology and disease, coral calcification and ocean acidification, and coral speciation and hybridization. Supplements lectures with readings from the primary literature. Focuses on active areas of research and hands-on learning through lab and field activities.",
    "coreqs": [
      { "number": "5505" },
      { "number": "5505" },
      { "number": "5505" },
      { "number": "5505" }
    ],
    "prereqs": [
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EEMB",
    "number": "5505",
    "title": "Lab for EEMB 5504",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20019" },
      { "term": "202330", "crn": "36732" }
    ],
    "description": "Accompanies EEMB 5504. Focuses on relevant research questions while providing practical training techniques in coral biology. Hands-on learning includes visual surveys of reef transects, quadrat sampling, coral identification, enumeration of zooxanthellae with a hemocytometer, PAM fluorometry, ImageJ analysis, coral homogenization, and Vibrio plating.",
    "coreqs": [
      { "number": "5504" },
      { "number": "5504" },
      { "number": "5504" },
      { "number": "5504" }
    ],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5506",
    "title": "Biology and Ecology of Fishes",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20020" },
      { "term": "202330", "crn": "36733" }
    ],
    "description": "Covers fundamental concepts in reef fish biology, ecology, and conservation. Additional lecture coursework includes analysis of both group and individual research projects conducted in lab. Presents recent or ongoing research projects by the instructor and guest lecturers. Discussions are based on papers from the scientific literature and relate topics about processes and patterns of fish recruitment, reproduction, dispersal, evolution, conservation, and management.",
    "coreqs": [
      { "number": "5507" },
      { "number": "5507" },
      { "number": "5507" },
      { "number": "5507" }
    ],
    "prereqs": [
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EEMB",
    "number": "5507",
    "title": "Lab for EEMB 5506",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20022" },
      { "term": "202330", "crn": "36734" }
    ],
    "description": "Accompanies EEMB 5506. Studies methods to conduct research on reef fishes through class exercises and individual research projects. Hands-on learning includes common fish transect methodology, reef fish identification, cast net and handline (on scuba) fishing techniques, and specimen dissection. Emphasizes analyzing and presenting the data and writing clearly and effectively about scientific research through the lab reports.",
    "coreqs": [
      { "number": "5506" },
      { "number": "5506" },
      { "number": "5506" },
      { "number": "5506" }
    ],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5508",
    "title": "Marine Birds and Mammals",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20021" },
      { "term": "202330", "crn": "36735" }
    ],
    "description": "Studies principles of classification, anatomy, physiology, behavior, and evolution of seabirds and marine mammals. Also addresses conservation and protection of animals and essential habitat. Includes field trips to observe local species.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5510",
    "title": "New England Marine Biomes",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16774" }],
    "description": "Investigates the major biomes in the northwest Atlantic, including their habitats—rocky intertidal, tidal estuaries, seagrass beds, kelp forest/rocky reef complex, soft sediments, salt marshes, and continental shelf. Studies the major chemical, physical, geological, and biological forces that shape each habitat. Investigates the ecological framework of each habitat, both in the field and in hands-on exercises. Examines the adaptations of plants, algae, and animals to their respective ecosystem. Offers students an opportunity to develop an appreciation for human-induced changes in each habitat and biome and the conservation and restoration efforts currently being used.",
    "coreqs": [],
    "prereqs": ["(", "Or", "Or", "Or", "Or", ")", "Or", "Graduate Admission"]
  },
  {
    "subject": "EEMB",
    "number": "5518",
    "title": "Ocean and Coastal Processes",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20023" },
      { "term": "202330", "crn": "36736" }
    ],
    "description": "Examines the coupling between physical and biological processes on coral reefs and adjacent habitats. Focuses on biophysical, oceanographic, and benthic-pelagic processes acting in coral reef and associated nearshore ecosystems. Specific topics include oceanographic forcing mechanisms, organismal biomechanics, hydrodynamics, and nutrient dynamics.",
    "coreqs": [
      { "number": "5519" },
      { "number": "5519" },
      { "number": "5519" },
      { "number": "5519" }
    ],
    "prereqs": [
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission",
      { "subject": "BIOL", "number": "2311" },
      "Or",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "EEMB",
    "number": "5519",
    "title": "Lab for EEMB 5518",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20024" },
      { "term": "202330", "crn": "36737" }
    ],
    "description": "Accompanies EEMB 5518. Studies techniques such as estimation of turbulent diffusion coefficients, mean speed, and logarithmic layer parameters using analysis of video imagery (NIH ImageJ); deploying and recovering zooplankton traps and nets and estimating mortality using vital dyes; use of GoPro for behavioral analyses (sediment shedding in corals); estimating flux rates from active suspension feeders like sponges using dye release; and use of the YSI Exo Sonde to measure different water quality parameters.",
    "coreqs": [
      { "number": "5518" },
      { "number": "5518" },
      { "number": "5518" },
      { "number": "5518" }
    ],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5520",
    "title": "Tropical Marine Ecology",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20025" },
      { "term": "202330", "crn": "36738" }
    ],
    "description": "Highlights and explores the ecological characteristics and current threats facing four tropical ecosystems—coral reefs, seagrass beds, mangrove forests, and tropical lowland rain forests. Explores the connectivity between these ecosystems and the services each provides. Examines how these ecosystems have changed under past threats and are projected to change in future conditions. Includes formal lectures, informal lectures provided in the field, field demonstrations, and interpretive hikes.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5522",
    "title": "Experimental Design Marine Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "WI"],
    "sections": [{ "term": "202310", "crn": "16477" }],
    "description": "Includes introduction to and application of observational methods in three local marine habitats, experimental design, statistical analysis, R statistical computing and graphics software, and principles of marine ecology. Combines lecture, hand-on research experience, and computer laboratory and includes reading and analyzing the scientific literature and developing research projects. At the end of the semester, students are expected to demonstrate an integrative mastery of course topics by writing a scientific manuscript about a class experiment. Seeks to prepare students for practicing ecology in new environments and to provide students with the foundational knowledge necessary for pursuing more complex concepts in experimental design, statistical analysis, and marine ecology.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5525",
    "title": "Advanced Field Methods in Marine Ecology",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202260", "crn": "61297" }],
    "description": "Explores the methods used to build and complete scientific studies in marine ecology from observation to data analysis and interpretation within the context of the northwest Atlantic Ocean. Offers students an opportunity to build quantitative skills by understanding how and when to apply different statistical methods to a range of ecological datasets. Studies how to appropriately interpret results and effectively communicate the interpretation to any audience. Applies these skills to additional study systems outside the marine environment of the northwest Atlantic.",
    "coreqs": [],
    "prereqs": ["Or", "Graduate Admission"]
  },
  {
    "subject": "EEMB",
    "number": "5533",
    "title": "Marine Invertebrate Zoology and Botany",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20026" }],
    "description": "Explores major groups of marine macroalgae and marine invertebrates, their ecological roles, and interrelationships. Identifies defining features of these groups and the evolutionary and ecological drivers leading to adaptations. Emphasizes important groups in the Pacific Northwest habitats, including kelp forest and rocky intertidal habitats. Hands-on learning with corequisite lab includes field identification; visits to intertidal and subtidal marine environments; and specimen observation, dissection, preparation, and cataloging.",
    "coreqs": [{ "number": "5535" }],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5535",
    "title": "Lab for EEMB 5533",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20027" }],
    "description": "Accompanies EEMB 5533. Covers topics from the course through various experiments.",
    "coreqs": [{ "number": "5533" }],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5538",
    "title": "Conservation and Restoration of Marine Systems",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20028" },
      { "term": "202330", "crn": "36739" }
    ],
    "description": "Designed to foster an understanding of conservation and restoration strategies in the nearshore marine system using a real-world case study approach. Students collect and analyze historical and newly collected data and use this to inform a conservation and restoration plan within the context of local, state, and federal laws. Uses real-world examples (such as aquaculture, seagrass restoration, and shoreline hardening) to build ecological goals. Seeks to build understanding and appreciation of the input of all stakeholders, including that of marginalized groups. Offers students an opportunity to produce a high-level and annotated deliverable that could serve as a template for real-world use.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5540",
    "title": "Changing Global Oceans",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38335" }],
    "description": "Investigates the major drivers to short-, medium-, and long-term changes in the world’s oceans. Compares the role of natural and human-induced changes in ocean systems. Key areas focus on the role of nonhuman animals in modifying and mitigating oceanic and atmospheric change. Explores the linkages among oceans and atmosphere through examples in the Pacific Northwest and worldwide."
  },
  {
    "subject": "EEMB",
    "number": "5541",
    "title": "Lab for EEMB 5540",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "37244" }],
    "description": "Accompanies EEMB 5540. Students participate in daily, topical, paper discussions, carry out laboratory exercises, or explore and collect data in field exercises. Offers students an opportunity to acquire skills such as using oceanographic equipment, modeling simulations, data collection, and data analysis."
  },
  {
    "subject": "EEMB",
    "number": "5542",
    "title": "Marine Spatial Planning",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE"],
    "sections": [
      { "term": "202310", "crn": "20015" },
      { "term": "202330", "crn": "38336" }
    ],
    "description": "Investigates issues of marine and coastal spatial planning (MCSP) that include offshore wind power siting, fisheries and aquaculture management, natural resource extraction, marine mammal conservation, and/or living shoreline protection and mitigation. Covers the spatial planning process from question to deliverable strategy, including assessment of stakeholder needs and potential ecosystem impacts. Offers students an opportunity to acquire and assess data, apply appropriate statistical tools, and develop spatial maps using geographic information systems (GIS) and other software. Also covers how to synthesize the planning process and develop and evaluate recommendations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5546",
    "title": "Sustainability of the Land-Sea Interface",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": ["WI"],
    "sections": [
      { "term": "202310", "crn": "20016" },
      { "term": "202260", "crn": "61298" }
    ],
    "description": "Explores the current issues facing management and conservation of the land-sea interface, also known as the coastal transition zone (CTZ). Evaluates the mitigation, conservation, and restoration tools that are applied to human use of the land-sea interface. Observes these tools during site visits and discusses strategies with experts in sustainability of these habitats. Synthesizes the scientific literature on CTZ tools in the northwest Atlantic and other regions with pressing sustainable land-sea use issues. Offers students an opportunity to develop skills in prioritizing and advocating for particular conservation strategies and to practice science communication skills to effectively reach a broad audience.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "5589",
    "title": "Diving Research Methods",
    "scheduleType": "Lab",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "16478" },
      { "term": "202260", "crn": "61299" }
    ],
    "description": "Presents experimental design, sampling methodology, statistical analysis, techniques, and the use of underwater equipment to conduct subtidal research.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "6465",
    "title": "Ecological and Conservation Genomics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19341" }],
    "description": "Provides an overview of ecological and evolutionary genomics. Covers foundational mathematical concepts in population in quantitative genetics, from individual loci up to whole genomes. Concepts covered include Hardy-Weinberg equilibrium, F statistics, signatures of natural selection in genomes and methods for detecting them, analysis of quantitative genetic evolution, hybridization, and gene expression. Also covers modern statistical methods used to analyze genomic data using the free and open source R programming environment. Builds knowledge through reading of the primary literature and advanced problem sets. The final project requires students to complete a novel data analysis of an open source genomics data set and write a research paper.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "6475",
    "title": "Advanced Wildlife Ecology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "35816" }],
    "description": "Focuses on wildlife ecology and management, with an emphasis on terrestrial species. Covers habitat use, behavior, wildlife conservation, parasites and pathogens, wildlife sampling, wildlife management, food and nutrition, population viability, and conservation genetics. Engages students in analyzing primary literature and wildlife data, collection, interpretation, and using basic mathematical models."
  },
  {
    "subject": "EEMB",
    "number": "7101",
    "title": "Seminar in Marine Sciences",
    "scheduleType": "Seminar",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38337" }],
    "description": "Offers students an opportunity to lead critical discussions of recent and classic papers from primary and secondary literature in marine sciences. Discusses the important scientific paradigms and addresses strengths and weaknesses of these papers from the perspective of scientific communication, including design and presentation of data in figures and tables; the role of synthesis in justifying new concepts; and how terminology and jargon evolve in scientific subdisciplines. Students write occasional reviews of these papers as if they had just been submitted to a journal for consideration."
  },
  {
    "subject": "EEMB",
    "number": "7102",
    "title": "Seminar in Ecology and Evolutionary Biology",
    "scheduleType": "Seminar",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19342" }],
    "description": "Offers an overview of major concepts in the fields of ecology and evolution and how these concepts can be synthesized under a common framework. The first half of the course is organized according to major areas of evolutionary biology, from quantitative genetics to population genetics and phylogenetics and their synthesis. Quantitative genetics, population genetics, and phylogenetics have been historically separate fields and have only recently been synthesized through genomics. Note that quantitative genetics is a field that studies the evolution of phenotypes and requires no genetic information. The second half of the course introduces major concepts in ecology and is designed to introduce students to the major historical underpinnings of community ecology so as to understand the utility (or lack thereof) of these concepts for modern ecology.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "7674",
    "title": "Marine Biology Research Project",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15534" },
      { "term": "202330", "crn": "38338" }
    ],
    "description": "Offers an opportunity to design and implement a scientifically rigorous independent research project that builds upon current knowledge from the primary literature, under the supervision of a faculty advisor from the program. Students conduct research at any of the program’s locations and are then required to analyze data using rigorous statistical methods, write a journal-style research paper, and present their results in a research seminar.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "8101",
    "title": "Readings in Marine Sciences",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19343" },
      { "term": "202330", "crn": "38339" }
    ],
    "description": "Designed to prepare PhD students with a concentration in marine sciences for a career in their field by offering an opportunity to learn fundamental aspects of the discipline through readings. Each student works with their Northeastern committee members at their first committee meeting to identify one reading topic per committee member. Committee members provide guidance for the student’s readings around their topic. Students meet with each committee member throughout the semester to discuss the readings, ask questions, and clarify any aspects of their topics.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "8102",
    "title": "Readings in Ecology and Evolutionary Biology",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13872" },
      { "term": "202330", "crn": "38340" }
    ],
    "description": "Designed to prepare PhD students with a concentration in ecology and evolutionary biology for a career in their field by offering an opportunity to learn fundamental aspects of the discipline through readings. Each student works with their Northeastern committee members at their first committee meeting to identify one reading topic per committee member. Committee members provide guidance for the student’s readings around their topic. Students meet with each committee member throughout the semester to discuss the readings, ask questions, and clarify any aspects of their topics.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "8103",
    "title": "Readings in Sustainability Sciences",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17314" },
      { "term": "202330", "crn": "38341" }
    ],
    "description": "Designed to prepare PhD students with a concentration in sustainability for a career in their field by offering an opportunity to learn fundamental aspects of the discipline through readings. Each student works with their Northeastern committee members at their first committee meeting to identify one reading topic per committee member. Committee members provide guidance for the student’s readings around their topic. Students meet with each committee member throughout the semester to discuss the readings, ask questions, and clarify any aspects of their topics.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "8104",
    "title": "Readings in Geosciences",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19344" },
      { "term": "202330", "crn": "38342" }
    ],
    "description": "Designed to prepare PhD students with a concentration in geosciences for a career in their field by offering an opportunity to learn fundamental aspects of the discipline through readings. Each student works with their Northeastern committee members at their first committee meeting to identify one reading topic per committee member. Committee members provide guidance for the student’s readings around their topic. Students meet with each committee member throughout the semester to discuss the readings, ask questions, and clarify any aspects of their topics.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "8984",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12071" },
      { "term": "202330", "crn": "33023" }
    ],
    "description": "Offers students an opportunity to conduct research. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "8986",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12072" },
      { "term": "202330", "crn": "31739" }
    ],
    "description": "Offers students an opportunity to conduct full-time research under faculty supervision. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "9990",
    "title": "Dissertation Term 1",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12073" },
      { "term": "202330", "crn": "38343" }
    ],
    "description": "Offers theoretical and experimental research for the PhD degree.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EEMB",
    "number": "9991",
    "title": "Dissertation Term 2",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "34800" },
      { "term": "202310", "crn": "21556" }
    ],
    "description": "Offers dissertation supervision by members of the department."
  },
  {
    "subject": "EEMB",
    "number": "9996",
    "title": "Dissertation Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12074" },
      { "term": "202330", "crn": "31740" }
    ],
    "description": "Offers dissertation supervision by members of the department.",
    "coreqs": [],
    "prereqs": []
  }
]
