[
  {
    "subject": "EMGT",
    "number": "5220",
    "title": "Engineering Project Management",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [
      { "term": "202310", "crn": "12318" },
      { "term": "202310", "crn": "12184" },
      { "term": "202310", "crn": "11901" },
      { "term": "202310", "crn": "20561" },
      { "term": "202260", "crn": "60240" },
      { "term": "202260", "crn": "60617" },
      { "term": "202240", "crn": "41746" },
      { "term": "202240", "crn": "40405" },
      { "term": "202240", "crn": "41857" },
      { "term": "202330", "crn": "32433" },
      { "term": "202330", "crn": "31478" },
      { "term": "202330", "crn": "32019" },
      { "term": "202330", "crn": "30623" }
    ],
    "description": "Examines the theory and practice of managing projects. Explores human, mathematical, entrepreneurial, managerial, and engineering aspects of project management. The systems development life cycle is the framework for the course. Addresses needs analysis, requirements definition, design, and implementation in the context of project management. Introduces mathematical and software tools for planning, monitoring, and controlling projects.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EMGT",
    "number": "5300",
    "title": "Engineering/Organizational Psychology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11856" },
      { "term": "202310", "crn": "10848" },
      { "term": "202330", "crn": "36102" },
      { "term": "202330", "crn": "31727" }
    ],
    "description": "Offers an analysis of the purpose and functioning of organizations as the basic networks for achieving goals through coordination of effort, communication, and responsibility. Studies the role and function of engineering organizations based on modern behavioral science concepts as well as the application of psychology to industry relative to human relations, group dynamics, tests and measurements, personnel practices, training, and motivation. Examines the evolution of the learning organization and its role in the management of R&D and technology, the influence of the rapid changes in technology, and the globalization of the marketplace through group-oriented case studies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EMGT",
    "number": "6225",
    "title": "Economic Decision Making",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11794" },
      { "term": "202310", "crn": "12339" },
      { "term": "202310", "crn": "12187" },
      { "term": "202310", "crn": "12189" },
      { "term": "202260", "crn": "60327" },
      { "term": "202240", "crn": "40417" },
      { "term": "202240", "crn": "41856" },
      { "term": "202330", "crn": "30783" },
      { "term": "202330", "crn": "31997" },
      { "term": "202330", "crn": "32562" },
      { "term": "202330", "crn": "32254" }
    ],
    "description": "Explores economic modeling and analysis techniques for selecting alternatives from potential solutions to an engineering problem. Considers measures of merit, such as present worth, annual worth, rate of return, and benefit/cost techniques. Examines recent techniques of economic analysis, especially the tools of decision making. Explores decisions under uncertainty. Studies the causes of risk and uncertainty, and examines ways to change and influence the degree of risk and uncertainty through sensitivity analysis, expectation-variance criterion, decision tree analysis, statistical decision techniques, and multiple attribute decision making through group case studies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EMGT",
    "number": "6305",
    "title": "Financial Management for Engineers",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12860" },
      { "term": "202310", "crn": "10640" },
      { "term": "202310", "crn": "16692" },
      { "term": "202240", "crn": "41779" },
      { "term": "202240", "crn": "40096" },
      { "term": "202330", "crn": "38679" },
      { "term": "202330", "crn": "31754" },
      { "term": "202330", "crn": "30574" }
    ],
    "description": "Examines the issues and processes of short-term financing on industrial firms, financial analysis of cases, supplemented by readings to develop familiarity with sources and uses of working capital as well as the goals and problems involved in its management. Also covers the analysis necessary for such long-term financial decisions as issuance of stock or bonds; contracting of leases or loans, and financing of a new enterprise; mergers, capital budgeting, the cost of capital, and the valuation of a business. Examines financial statement ratio analysis along with the use of the capital asset pricing model as it relates to risk and return. Explores leverage and capital structure and international managerial finance in the examination of the overall financial policy decision-making process.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EMGT",
    "number": "6600",
    "title": "Engineering Team Performance",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "36647" }],
    "description": "Offers students an opportunity to obtain foundational knowledge of team performance and learn the practical application of principles to enable them to develop practical skills in managing engineering and other technical team development initiatives. Teaming is a critical technique used to make a positive impact on personal and organizational performance and is essential for engineering and other technical disciplines. Designed to help students understand why and how team skills are critical to organizational success, learn how to use team skills to more effectively achieve engineering and technical goals as well as to organize and influence others to work more effectively, and to apply cognition to develop higher-performing teams."
  },
  {
    "subject": "EMGT",
    "number": "7374",
    "title": "ST:Advanced Product Management",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "18274" },
      { "term": "202310", "crn": "20172" },
      { "term": "202330", "crn": "36779" },
      { "term": "202330", "crn": "38680" }
    ],
    "description": "Offers topics of interest to the staff member conducting this class for advanced study. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "EMGT",
    "number": "7945",
    "title": "Master's Project",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "33959" }],
    "description": "Offers theoretical or experimental work under individual faculty supervision."
  },
  {
    "subject": "EMGT",
    "number": "7978",
    "title": "Independent Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "33534" }],
    "description": "Offers theoretical or experimental work under individual faculty supervision. May be repeated without limit."
  }
]
