[
  {
    "subject": "GAME",
    "number": "1110",
    "title": "Games and Society",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11117" },
      { "term": "202310", "crn": "17185" },
      { "term": "202240", "crn": "40693" },
      { "term": "202330", "crn": "30915" },
      { "term": "202330", "crn": "37470" },
      { "term": "202330", "crn": "39288" }
    ],
    "description": "Provides an historical and cultural perspective on games and other forms of interactive entertainment. Examines the present state and future directions of paper, card, and board games; physical games and sports; and video games. Introduces students to current issues, experiments, and directions in the field of game design. Through weekly lectures and small-group labs, students have an opportunity to develop a critical basis for analyzing game play.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "1850",
    "title": "Experimental Game Design",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12590" }],
    "description": "Explores traditions of games, play, participation, and procedurality in twentieth-century art movements, including Dada, Surrealism, Fluxus, conceptual art, the Situationists, Happenings, participatory performance and Tactical Media, avant-garde music, and contemporary art games. Through readings, lectures, and studio assignments, offers students an opportunity to understand and apply key principles by creating a series of artworks using various strategies drawn from these traditions, including appropriation, scores, intervention, and expression.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "2010",
    "title": "The Business of Games",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12374" }],
    "description": "Surveys a wide array of game-specific industry topics, including pitching and development of talking points, business models and revenue structures, studio organization and style, intellectual property, contracts, project management expectations, project green-lighting, production pipelines, return on investment, outsourcing, and marketing. Exploring historical shifts and evolution of the video game market offers students an opportunity to obtain perspective on the status of the industry and potential growth in the economy.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "2355",
    "title": "Narrative for Games",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": ["EI"],
    "sections": [{ "term": "202310", "crn": "13141" }],
    "description": "Offers students an opportunity to learn how contemporary narrative theories evolved and their uses in various media. Examines various mediated texts to understand how best to use storytelling strategies for students' own narrative-forward games so as to best take advantage of designing narratives for different platforms and audiences. Uses presentations and performances to enhance students' understanding of how audiences assimilate information and to critique. Students write, play, and study narrative-driven games in the context of various narrative theories and practice writing with the awareness and intention that actors and audiences will read their work and respond.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "2500",
    "title": "Foundations of Game Design",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EI"],
    "sections": [
      { "term": "202310", "crn": "12083" },
      { "term": "202310", "crn": "12801" },
      { "term": "202310", "crn": "13211" },
      { "term": "202310", "crn": "13656" },
      { "term": "202310", "crn": "14306" },
      { "term": "202310", "crn": "17984" },
      { "term": "202240", "crn": "40694" },
      { "term": "202330", "crn": "34270" },
      { "term": "202330", "crn": "34271" },
      { "term": "202330", "crn": "36080" },
      { "term": "202330", "crn": "36081" },
      { "term": "202330", "crn": "37290" }
    ],
    "description": "Seeks to define the practice of game design within the larger context of playful interaction design, while constantly maintaining a player-centric approach. Unfolds the process of designing games between phases of analysis, synthesis, and evaluation. Establishes the role of game designer as an expert with a vision for determined player experiences and a vocal advocate for players. Seeks to offer students a broad methodology consisting of brainstorming methods, prototyping techniques, process management practices, and evaluation procedures to solve a wide array of design problems in an iterative manner.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "2650",
    "title": "Introduction to Game Research Methods",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["AD"],
    "sections": [{ "term": "202330", "crn": "32136" }],
    "description": "Surveys research methods and epistemologies relevant to game researchers, designers, and artists, including experimental studies; analytics, formal and historical analysis; ethnography; qualitative social research; and design research. Engages students in lectures, readings, and game faculty guest lectures presenting practical examples of methods discussed in the class. Seeks to familiarize students with core literatures on games, library research, and research design through a series of hypothetical research project drafts and the completion of a research project using a specific method covered in the class."
  },
  {
    "subject": "GAME",
    "number": "2750",
    "title": "Games Criticism and Theory",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202330", "crn": "32137" }],
    "description": "Covers fundamental theories of art, meaning-making, expression, cultural reflection, and criticism concerning media, games, and playful artifacts. Assigns several papers that offer students an opportunity to choose and apply different critical lenses to games, game criticism, and their own gameplay experience. A long-form paper allows students to train writing theoretically informed and argumentatively cogent critical presentations of games and gameplay experience."
  },
  {
    "subject": "GAME",
    "number": "2755",
    "title": "Games and Social Justice",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32563" }],
    "description": "Analyzes games from a social justice perspective, encouraging students to consider issues of social stereotyping, normalization, exclusion, and inequity as they apply to games from all sectors of the industry. Discusses and analyzes games using a variety of social theories from a diverse set of fields, including gender studies, critical race theory, and LGBTQ studies. Provides a studio setting in which students have an opportunity to engage in critical making of playable experiences that are based upon and deeply integrate social justice theories in their design."
  },
  {
    "subject": "GAME",
    "number": "2950",
    "title": "Game Studio",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13498" },
      { "term": "202310", "crn": "20167" },
      { "term": "202310", "crn": "20277" },
      { "term": "202310", "crn": "21064" }
    ],
    "description": "Offers an experiential learning course in which students collaborate with faculty on a project for credit, which may include research, game creation, or a combination of the two. Offers students an opportunity to co-produce a publishable, distributable, or exhibitable game and/or research paper, which can become part of the student's portfolio. Course may be taught by an individual faculty member or team-taught to explore a specific topic, such as documentary games, art games, physical interfaces, installations, historical games, live-action role-playing, etc. Offers students an opportunity to gain experience working on a real-world project, as well as being credited for collaboration with an established practitioner/researcher. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "3300",
    "title": "Game Interface Design",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15251" },
      { "term": "202310", "crn": "20384" }
    ],
    "description": "Introduces interface design for games. A game interface is the point at which the player interacts with the game system, which pertains to visual, auditory, and haptic cues; screens and graphical user interfaces; the player character; and the game controller. Analyzes successful and unsuccessful game interfaces from historical, theoretical, and cultural perspectives. Offers students an opportunity to learn to analyze, critique, and iteratively design innovative game user interfaces; learn about and practice game usability and game feel, as well as design techniques for user interfaces and user experience; and focus on designing innovative game interfaces as they iteratively develop and test a game interface from beginning to end, resulting in a portfolio-ready game interface prototype. Designed as an intermediate course for undergraduate students across disciplines.",
    "coreqs": [],
    "prereqs": [
      { "subject": "GAME", "number": "1110" },
      { "subject": "GAME", "number": "1110" },
      { "subject": "GAME", "number": "1110" },
      { "subject": "GAME", "number": "1110" }
    ]
  },
  {
    "subject": "GAME",
    "number": "3400",
    "title": "Level Design and Game Architecture",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EI"],
    "sections": [
      { "term": "202240", "crn": "41438" },
      { "term": "202330", "crn": "33197" },
      { "term": "202330", "crn": "33982" }
    ],
    "description": "Analyzes game-level designs in a variety of genres and forms. Building upon basic drawing and design skills, students have an opportunity to develop paper prototypes and simple game “mods” in the context of story and game play. Students use computer-based tools to examine game-level architecture. Encourages students to take this elective in preparation for or in parallel to the Game Projects courses.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "3700",
    "title": "Rapid Idea Prototyping for Games",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EI"],
    "sections": [
      { "term": "202310", "crn": "11136" },
      { "term": "202310", "crn": "12591" },
      { "term": "202330", "crn": "34272" }
    ],
    "description": "Studies digital and nondigital prototyping techniques through weekly activities in which students build and critique prototypes around a variety of game design themes. Offers students an opportunity to build a portfolio of small proof-of-concept game prototypes over the course of the semester. Additionally, covers how to iterate on a single prototype through a semesterlong project in which students have an opportunity to work individually on a larger game design.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GAME",
    "number": "3800",
    "title": "Game Concept Development",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EI", "WI"],
    "sections": [{ "term": "202330", "crn": "35080" }],
    "description": "Offers student teams an opportunity to conceptualize, design, document, and develop a complete game, including content, level design, user interface, and game mechanics as specified in design documents. Offers a set of brainstorming techniques. Students segment the concepts into individual systems and prototype them in an iterative manner, formally iterating over the whole game to improve the player experience. Requires students to maintain a schedule and project management documents. Results in the presentation of the complete game for critique."
  },
  {
    "subject": "GAME",
    "number": "4155",
    "title": "Designing Imaginary Worlds",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": ["EI"],
    "sections": [{ "term": "202330", "crn": "32505" }],
    "description": "Offers students an opportunity to learn to conceive, design, and convey imaginary worlds across a wide range of media. The crafting of fictional worlds has become an important skill in the media landscape, whether for video and tabletop games, comic books, novels, film, or television. Analyzes existing works in diverse genres such as fantasy, science fiction, superhero, and supernatural worlds. Explores, through creative projects, the ways in which the use of different media are suited to portray different aspects of an imaginary world."
  },
  {
    "subject": "GAME",
    "number": "4460",
    "title": "Generative Game Design",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "36643" }],
    "description": "Studies principles of procedural content generation and generative methods, including modular design, the role of randomness in design, and designing for emergence. Examines the role of generative design in games and its impact on both designers and players. Through assignments and a semester-long project, encourages student creation of generative systems for playful experiences."
  },
  {
    "subject": "GAME",
    "number": "4700",
    "title": "Game Design Capstone",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE"],
    "sections": [
      { "term": "202310", "crn": "11428" },
      { "term": "202330", "crn": "39095" }
    ],
    "description": "Offers students an opportunity to develop a fully functional game using the iterative design skills they develop in GAME 3700 and GAME 3800. Students take on individual roles in a large-group project, with the goal of creating a complete game from preproduction through implementation and testing. Focuses on developing, playtesting, and iteratively refining a multilevel game, in addition to class discussions and exercises oriented toward professional and portfolio development. This class is an opportunity to complete, polish, and potentially publish that project. Integrated into the capstone are opportunities for the students to gain exposure for their games and to practice their professional development skills.",
    "coreqs": [],
    "prereqs": [
      { "subject": "GAME", "number": "3700" },
      "And",
      { "subject": "GAME", "number": "3800" },
      { "subject": "GAME", "number": "3700" },
      "And",
      { "subject": "GAME", "number": "3800" },
      { "subject": "GAME", "number": "3700" },
      "And",
      { "subject": "GAME", "number": "3800" },
      { "subject": "GAME", "number": "3700" },
      "And",
      { "subject": "GAME", "number": "3800" }
    ]
  }
]
