[
  {
    "subject": "GRMN",
    "number": "1101",
    "title": "Elementary German 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13214" }],
    "description": "Designed for students with very little or no prior knowledge of German. Provides a lively introduction to basic oral expression, listening comprehension, and elementary reading and writing. Each lesson incorporates helpful information about daily life in German. Laboratory practice complements class work, enables students to work aloud at their own speed, reinforces their acquisition of essential structures, and acquaints them with a vast library of audio-visual resources.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GRMN",
    "number": "1102",
    "title": "Elementary German 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11350" }],
    "description": "Continues GRMN 1101. Includes completion of basic grammatical usage, reading of contemporary German material, and increased stress on oral and aural skills.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GRMN",
    "number": "2101",
    "title": "Intermediate German 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [{ "term": "202310", "crn": "10842" }],
    "description": "Emphasizes further vocabulary building. Offers students an opportunity to master the fine points of grammar through written composition, prepared oral reports, and reading and discussion from contemporary German materials.",
    "coreqs": [],
    "prereqs": [
      { "subject": "GRMN", "number": "1102" },
      "Or",
      { "subject": "GRMN", "number": "1302" },
      "Or",
      "German Placement Test"
    ]
  },
  {
    "subject": "GRMN",
    "number": "2102",
    "title": "Intermediate German 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX", "WI"],
    "sections": [{ "term": "202310", "crn": "15984" }],
    "description": "Builds on GRMN 2101 and focuses on further development of vocabulary. Offers students an opportunity to continue to master grammar and conversation through written composition, prepared oral reports, and reading and discussion from contemporary German materials.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GRMN",
    "number": "3800",
    "title": "Germany Today: Current Topics",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15985" },
      { "term": "202240", "crn": "40706" }
    ],
    "description": "Focuses on a unique aspect of the German language. The specific topics are chosen to reflect current developments in the language and expressed student interests. Focuses on the use of the language for specific purposes or its use in specialized settings (e.g., media, business, health). Requires at least an intermediate level of skill in the language. May be repeated up to three times.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "GRMN",
    "number": "5976",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202240", "crn": "41775" }],
    "description": "Offers independent work under the direction of members of the department on a chosen topic. Course content depends on instructor. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  }
]
