[
  {
    "subject": "HSCI",
    "number": "1000",
    "title": "College: An Introduction",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11253" },
      { "term": "202310", "crn": "13205" },
      { "term": "202310", "crn": "11179" },
      { "term": "202310", "crn": "10140" },
      { "term": "202310", "crn": "15307" },
      { "term": "202310", "crn": "15308" },
      { "term": "202310", "crn": "19397" },
      { "term": "202310", "crn": "19398" }
    ],
    "description": "Provides an introduction to the University, college, and health professions to enhance students&amp;#8217; understanding of self and the decisions they make academically and socially as members of the University&amp;#8217;s diverse, multicultural community. Group activities and individual assignments along with active participation in a learning community help students adjust to life on an urban campus, develop a better understanding of the learning process, acquire essential academic skills, and make connections with the faculty and students in the college.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "1105",
    "title": "Human Nutrition",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND"],
    "sections": [
      { "term": "202310", "crn": "13698" },
      { "term": "202310", "crn": "11197" },
      { "term": "202310", "crn": "16295" },
      { "term": "202260", "crn": "61260" },
      { "term": "202240", "crn": "40956" }
    ],
    "description": "Examines the fundamental role of nutrition in promoting health and how lifestyle and the socioecological model work together. Covers the physiological functions of energy-providing nutrients in the body and interrelationships, including the key functions of macronutrients and micronutrients. Introduces the use of two different diet assessment tools to assist individuals in selecting food for health promotion. Offers students an opportunity to gain a deeper understanding of what it means to make healthy choices and the role nutrients have on a person&rsquo;s wellness.",
    "coreqs": [],
    "prereqs": [
      { "subject": "BIOL", "number": "1107" },
      "Or",
      { "subject": "BIOL", "number": "1111" },
      "Or",
      { "subject": "BIOL", "number": "1115" },
      "Or",
      { "subject": "BIOL", "number": "1117" },
      "Or",
      { "subject": "BIOL", "number": "1147" },
      "Or",
      { "subject": "BIOL", "number": "2217" },
      "Or",
      "Or",
      "Or",
      "Or",
      { "subject": "HSCI", "number": "1106" },
      "Or",
      { "subject": "PHSC", "number": "2301" },
      "Or",
      { "subject": "PHSC", "number": "2303" }
    ]
  },
  {
    "subject": "HSCI",
    "number": "1106",
    "title": "Contemporary Issues in Nutrition",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND"],
    "sections": [{ "term": "202310", "crn": "11549" }],
    "description": "Explores the fundamental role of nutrition in promoting health. Offers an overview of nutrient functions, compositions, and digestion/absorption. Relates concepts covered in class to current topics of interest in nutrition. Offers students an opportunity to discuss their dietary behaviors in relation to the Dietary Guidelines for Americans.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "2000",
    "title": "Professional Development for Bouv&amp;#233; Co-op",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10022" },
      { "term": "202310", "crn": "13002" },
      { "term": "202310", "crn": "11957" },
      { "term": "202310", "crn": "10179" },
      { "term": "202310", "crn": "17243" },
      { "term": "202310", "crn": "17359" },
      { "term": "202310", "crn": "19400" },
      { "term": "202310", "crn": "19401" },
      { "term": "202310", "crn": "19402" }
    ],
    "description": "Introduces students to the Bouv&amp;#233; Cooperative Education Program and provides them with the opportunity to develop job-search and career-management skills. Offers students an opportunity to perform assessments of their workplace skills, interests, and values and discuss how they impact personal career decisions. Students also have an opportunity to prepare a professional-style r&amp;#233;sum&amp;#233;, learn proper interviewing techniques, and gain an understanding of the opportunities available to them for co-op. Introduces career paths, choices, and career decision making. Familiarizes students with workplace issues relative to their field of study and teaches them to use myNEUCOOL database in the job-search and referral process. Presents and discusses co-op policies, procedures, and expectations of the Bouv&amp;#233; Cooperative Education Program and co-op employers.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "2350",
    "title": "Advanced Nutrition in Health and Disease",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19412" },
      { "term": "202310", "crn": "19413" }
    ],
    "description": "Designed for health professionals to increase their knowledge and skills in advanced nutrition in health and disease. Builds on a foundation of nutrition and introduces nutrients and their physiological impacts, including the nutritional guidelines for good health and disease prevention. Through case studies, offers students an opportunity to interpret nutrition in the prevention and treatment of diet-related health problems, such as obesity, diabetes, and cardiovascular disease.",
    "coreqs": [],
    "prereqs": [{ "subject": "HSCI", "number": "1105" }]
  },
  {
    "subject": "HSCI",
    "number": "2500",
    "title": "Public Health Nutrition in the Community",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [{ "term": "202310", "crn": "14163" }],
    "description": "Explores the role nutrition plays in promoting and improving health in the community. Examines modern aspects of public health nutrition in the healthcare system by applying the principles of nutrition to design policies, behavior, program planning, food insecurity, marketing, and children and adult nutrition programs. Offers students an opportunity to develop and deliver nutrition education to various populations in the community, including school-age children, college students, and the elderly population.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "2850",
    "title": "Special Topics",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [{ "term": "202310", "crn": "19828" }],
    "description": "Interdisciplinary Seminar on Rural Health: This seminar addresses current issues in rural health, utilizing Maine, the nation&rsquo;s most rural state, as a case example. The seminar will focus on interdisciplinary approaches which identify rural health issues, address root causes of diseases, and develop sustainable policy and programmatic interventions to improve health outcomes of individuals, families and communities in rural areas.  Topics addressed will include models of rural health care delivery, rural public health practices, rural public policy and health reform, the role of health technologies in rural practice, and health issues faced by vulnerable rural populations (including immigrants and migrant workers). The overall goal of this course is to critically analyze the complex contextual factors that must be addressed to sustainably improve health outcomes in rural settings.  This course is open to all students, regardless of major or year.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "4700",
    "title": "Health Science Capstone Introduction",
    "scheduleType": "Lecture",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12443" }],
    "description": "Offers students an opportunity to integrate their coursework, knowledge, and experiences into a proposal for a spring semester capstone experience. Students propose their health science culminating experience from options in the form of developing and implementing their own project with faculty mentor support or participating in a faculty-led seminar.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "5130",
    "title": "Introduction to Real-World Evidence",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19416" }],
    "description": "Introduces students to the generation of real-world evidence (RWE) from real-world data (RWD) collected through different forms of observational health data. Examines how RWE is used to inform regulators and other stakeholder groups in life sciences and healthcare. Emphasizes the role of team science in executing an RWE analysis.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "5140",
    "title": "Foundations of Data Models",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19418" }],
    "description": "Introduces students to design principles behind data modeling in life sciences and healthcare. Examines and compares approaches to common data models across different research communities. Explores the rationale for popular data models through the use of industry case studies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "5150",
    "title": "Methods for Observational Research 1",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19420" }],
    "description": "Surveys approaches to observational research across pharmacoepidemiology, emphasizing approaches used by the Observational Health Data Sciences and Informatics community.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "HSCI",
    "number": "5230",
    "title": "Clinical Nutrition Applications in Health and Disease",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20905" }],
    "description": "Prepares health professionals to effectively communicate principles of diet and nutrition to their clients and the public. Covers public health promotion strategies, techniques used to teach diet and nutrition, and behavioral theories used in diet and nutrition intervention. Emphasizes clinical applications for the treatment of weight disorders, diabetes, cardiovascular disease, eating disorders, and nutrition in the life cycle.",
    "coreqs": [],
    "prereqs": []
  }
]
