[
  {
    "subject": "INAM",
    "number": "2000",
    "title": "Ethics in Creativity",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EI", "ER"],
    "sections": [{ "term": "202310", "crn": "15991" }],
    "description": "Studies the role of ethics in creative practice. Offers students an opportunity to reflect on many of the concerns creative professionals face, such as how creative practitioners manifest care as a social intervention for building intimacy, healing, and hope across communities and how to develop and articulate creative goals. From the rhetoric of trust and authenticity, to honesty and generosity, ethical concepts consistently make their way into creative practice. Examines (and affords students an opportunity to hone) strategies to systematically navigate uncertainty and iteration within creative practice, culminating in a student final creative project. Readings focus on ethical paradigms that illustrate how systems of power shape the role of creative practices in society.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "5983",
    "title": "Special Topic: UG Music",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20864" },
      { "term": "202310", "crn": "20969" },
      { "term": "202310", "crn": "20970" },
      { "term": "202310", "crn": "20971" },
      { "term": "202310", "crn": "20972" },
      { "term": "202310", "crn": "20973" },
      { "term": "202310", "crn": "20974" },
      { "term": "202310", "crn": "20975" },
      { "term": "202310", "crn": "20976" },
      { "term": "202310", "crn": "20977" },
      { "term": "202310", "crn": "20978" },
      { "term": "202310", "crn": "21066" },
      { "term": "202310", "crn": "21067" },
      { "term": "202310", "crn": "21068" }
    ],
    "description": "Addresses timely trends, issues, and events. Offers students an opportunity to learn about and respond to issues of the day in an immersive, interdisciplinary format. Content and instructors vary by offering.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "6100",
    "title": "Critical Foundations of Creative Practice",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14928" }],
    "description": "Introduces core theoretical foundations of the creative practice and creativity studies fields. Considers interdisciplinary, contemporary, and critical frameworks alongside themes such as creative economies; performance and reception studies; placemaking; social and ecological justice; critical race and gender studies; and the intersection of ethics, culture, politics, and public policy around modes of creative practice.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "6200",
    "title": "Topics in Communication Strategies",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14929" }],
    "description": "Explores methods and techniques of professional writing to build creative narratives for cultural leaders as well as written and nonwritten communication. Covers strategies for advocacy, including artists/program notes, grant opportunities, business plans, blogs, op-eds, new media, marketing/promotion, and strategic positioning. Offers students an opportunity to develop a portfolio of documents (written and nonwritten) to establish a core for future communication platforms.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "6210",
    "title": "Projects in Interdisciplinary Creative Practice",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20719" }],
    "description": "Focuses on project management and assessment for creative projects and related entrepreneurial enterprises; critiques of creative work and creative organizing projects; analysis and application of multiple forms of assessment of the professional practice; and planning for intellectual property, branding, and marketing challenges. Offers students an opportunity to learn how to articulate and implement medium-to-long-range strategies for reaching next career stages and achieving larger goals in their creative enterprises.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "6301",
    "title": "Integrative Research Project",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20722" }],
    "description": "Offers students an opportunity to work independently on a research project of choice that integrates two or more creative disciplines. The research project results in students crafting their artist statement.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "7100",
    "title": "Thesis Proposal",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20723" }],
    "description": "Offers students an opportunity to develop and present a proposal for a topic of study/research based on their creative disciplines to a faculty committee for approval. Requires a definition of the scope of the project, a description of the interdisciplinary nature of the work, the methodologies for the research, and the assumptions being questioned or analyzed. The thesis research proposal must demonstrate the student&rsquo;s ability to carry out independent interdisciplinary creative practice research.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "7990",
    "title": "Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20866" }],
    "description": "Offers the candidate, working with a thesis advisor, an opportunity to continue to complete the research project defined and proposed in INAM 7100. The research is carried out in an independent manner, with periodic presentations to the thesis committee. These presentations define the benchmarks for determination of successful progress in the project. The ultimate result is an exhibition, screening, performance, or other form of public display or presentation, together with a thesis paper or written corollary.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INAM",
    "number": "7996",
    "title": "Thesis Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20867" }],
    "description": "Offers continued work on the thesis project.",
    "coreqs": [],
    "prereqs": []
  }
]
