[
  {
    "subject": "INTP",
    "number": "1000",
    "title": "American Sign Language at Northeastern",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10332" }],
    "description": "For American Sign Language Majors, Combined ASL majors, and ASL minors only",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INTP",
    "number": "3500",
    "title": "The Interpreting Profession",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10327" }],
    "description": "Presents an overview of the ASL&ndash;English interpreting profession. Discusses the emergence of sign language interpretation and translation; the responsibilities, ethics, and aptitudes of interpreters; professional associations; the bilingual and bicultural context; basic translation and interpretation; environments where interpreters work; special populations; and professional interpreter certifications.",
    "coreqs": [],
    "prereqs": [{ "subject": "AMSL", "number": "2101" }]
  },
  {
    "subject": "INTP",
    "number": "3510",
    "title": "Interpreting Inquiry Texts",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10569" }],
    "description": "Focuses on the practical skills required for effective translation and interpretation in dialogue-type inquiry texts (job interviews, case histories, and applications). Presents an overview of linguistic and sociolinguistic features and situational aspects of inquiry texts. Introduces theoretical models of interpretation to students&rsquo; development of analytic and cognitive skills, in order that they may effectively identify message meaning and manage the cognitive processes of message transfer. Introduces intralingual translation and text analysis techniques. Offers students an opportunity to develop skills in translation, consecutive interpretation, and simultaneous interpretation and to gain decision-making skills and strategies to achieve cross-culturally effective and appropriate message mediation in contexts where interactive inquiry texts occur.",
    "coreqs": [],
    "prereqs": [{ "subject": "AMSL", "number": "2102" }]
  },
  {
    "subject": "INTP",
    "number": "3550",
    "title": "Interpreting Scripted Texts",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202310", "crn": "19744" }],
    "description": "Guides students through the process of analyzing and interpreting frozen texts (plays, poems, and ceremonial scripts), from first read-through to final interpreted rendering of the performed text. Interpreting for theatrical or otherwise scripted communication is markedly different from other forms of interpreting. The availability of a script, ample time to rehearse, and the possibility of feedback makes this a hybrid practice&mdash;part interpreting, part translation, and part performance. Offers students an opportunity to learn how to analyze scripts for both content and interpreting issues; how to solve production problems of logistics, placement, and lighting; and how to interpret a series of performances for the Deaf Community. This course is offered in conjunction with or in advance of a theatre department production or other performed text.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INTP",
    "number": "3970",
    "title": "Research Methods for Interpreting and Translation",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["AD", "WI"],
    "sections": [{ "term": "202310", "crn": "17034" }],
    "description": "Offers an overview of research methodologies in interpreting and translation studies for students preparing for research capstone projects. Focuses on foundational theoretical knowledge and skills in research design, hypothesis testing, sampling and measurement, research ethics with deaf populations, as well as basic data analysis and interpretation. Offers students an opportunity to evaluate current literature in the discipline, write a project proposal to plan a research study or community-based project, and link social science research methods to sign language interpreting and translation practice.",
    "coreqs": [],
    "prereqs": [{ "subject": "INTP", "number": "3500" }]
  },
  {
    "subject": "INTP",
    "number": "4510",
    "title": "Interpreting Expository Texts",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14843" }],
    "description": "Focuses on the interpretation of expository texts (lectures, procedural texts) and the development of strategic decision-making skills within the context of expository texts. Presents an overview of linguistic and sociolinguistic features and situational aspects of expository texts. Reinforces models of interpretation in students&rsquo; practical development of analytic and cognitive skills, in order that they may effectively identify and transfer message meaning. Offers students an opportunity to further develop the cognitive processes and team interpretation skills to manage temporal constraints of simultaneous interpretation and to develop and apply the decision-making skills needed for achieving cross-cultural, cross-linguistic message mediation in these settings.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INTP",
    "number": "4650",
    "title": "Ethical Decision Making",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["ER"],
    "sections": [{ "term": "202310", "crn": "14069" }],
    "description": "Explores ethical standards and dilemmas in American Sign Language-English interpreting and other professions through discussions, hypothetical situations, and role-playing. Topics include culturally objective standards, ethics and professional principles, power relations within groups, and the Registry of Interpreters for the Deaf (RID) code of ethics. Compares various alternatives (i.e., consequence-based ethics) to a duty-based approach to the RID code and draws upon ethical fieldwork experience to analyze the principles that guide ethical decision making among professional interpreters.",
    "coreqs": [{ "subject": "INTP", "number": "4651" }],
    "prereqs": []
  },
  {
    "subject": "INTP",
    "number": "4651",
    "title": "Ethical Fieldwork",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10326" }],
    "description": "Comprises the fieldwork component of INTP 4650. Places students in practical interpreting experiences in educational settings, agencies serving Deaf people, and with freelance interpreters. Focuses on ethical questions and dilemmas and decision making in a bi-weekly seminar format. Requires students to maintain a log and participate in online discussions. Fulfills the experiential education requirement for ASL majors.",
    "coreqs": [{ "subject": "INTP", "number": "4650" }],
    "prereqs": [{ "subject": "INTP", "number": "3515" }]
  }
]
