[
  {
    "subject": "INTP",
    "number": "1000",
    "title": "American Sign Language at Northeastern",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10332" }],
    "description": "For American Sign Language Majors, Combined ASL majors, and ASL minors only",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "INTP",
    "number": "3500",
    "title": "The Interpreting Profession",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10327" }],
    "description": "Presents an overview of the ASL–English interpreting profession. Discusses the emergence of sign language interpretation and translation; the responsibilities, ethics, and aptitudes of interpreters; professional associations; the bilingual and bicultural context; basic translation and interpretation; environments where interpreters work; special populations; and professional interpreter certifications.",
    "coreqs": [],
    "prereqs": [{ "subject": "AMSL", "number": "2101" }]
  },
  {
    "subject": "INTP",
    "number": "3510",
    "title": "Interpreting Inquiry Texts",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10569" }],
    "description": "Focuses on the practical skills required for effective translation and interpretation in dialogue-type inquiry texts (job interviews, case histories, and applications). Presents an overview of linguistic and sociolinguistic features and situational aspects of inquiry texts. Introduces theoretical models of interpretation to students’ development of analytic and cognitive skills, in order that they may effectively identify message meaning and manage the cognitive processes of message transfer. Introduces intralingual translation and text analysis techniques. Offers students an opportunity to develop skills in translation, consecutive interpretation, and simultaneous interpretation and to gain decision-making skills and strategies to achieve cross-culturally effective and appropriate message mediation in contexts where interactive inquiry texts occur.",
    "coreqs": [],
    "prereqs": [{ "subject": "AMSL", "number": "2102" }]
  },
  {
    "subject": "INTP",
    "number": "3515",
    "title": "Interpreting Narrative Texts",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30508" }],
    "description": "Focuses on the translation and interpretation of narrative texts (personal narratives, storytelling) and the development of strategic decision-making skills within the context of narrative texts. Presents an overview of linguistic and sociolinguistic features and situational aspects of narrative texts. Guides students in building cognitive processes and skills in translation, consecutive interpretation, simultaneous interpretation, and team interpretation. Offers students an opportunity to develop the decision-making skills needed for achieving cross-cultural, cross-linguistic message mediation in these settings.",
    "coreqs": [],
    "prereqs": [{ "subject": "INTP", "number": "3510" }]
  },
  {
    "subject": "INTP",
    "number": "3550",
    "title": "Interpreting Scripted Texts",
    "scheduleType": "Studio",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202310", "crn": "19744" }],
    "description": "Guides students through the process of analyzing and interpreting frozen texts (plays, poems, and ceremonial scripts), from first read-through to final interpreted rendering of the performed text. Interpreting for theatrical or otherwise scripted communication is markedly different from other forms of interpreting. The availability of a script, ample time to rehearse, and the possibility of feedback makes this a hybrid practice—part interpreting, part translation, and part performance. Offers students an opportunity to learn how to analyze scripts for both content and interpreting issues; how to solve production problems of logistics, placement, and lighting; and how to interpret a series of performances for the Deaf Community. This course is offered in conjunction with or in advance of a theatre department production or other performed text.",
    "coreqs": [],
    "prereqs": [
      { "subject": "AMSL", "number": "2102" },
      "And",
      "(",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      ")"
    ]
  },
  {
    "subject": "INTP",
    "number": "4940",
    "title": "Interpreting Research Capstone",
    "scheduleType": "Off-campus instruction",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [{ "term": "202330", "crn": "30051" }],
    "description": "Requires students to undertake a research project focused on some aspect of American Sign Language-English interpretation. Students work individually or in research teams (with approval). In consultation with a faculty advisor, students select a research question, design and implement the data collection component of the project, analyze results, and write up their research findings. In addition to a written report, students also present their research results to ASL majors and community stakeholders at an annual ASL research symposium.",
    "coreqs": [],
    "prereqs": [{ "subject": "INTP", "number": "3970" }]
  }
]
