[
  {
    "subject": "LING",
    "number": "1150",
    "title": "Introduction to Language and Linguistics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ND", "SI"],
    "sections": [
      { "term": "202310", "crn": "11926" },
      { "term": "202310", "crn": "18906" },
      { "term": "202310", "crn": "18908" },
      { "term": "202310", "crn": "18905" },
      { "term": "202310", "crn": "18907" },
      { "term": "202310", "crn": "18909" },
      { "term": "202310", "crn": "20415" },
      { "term": "202260", "crn": "60243" },
      { "term": "202240", "crn": "41538" },
      { "term": "202330", "crn": "30195" },
      { "term": "202330", "crn": "30926" },
      { "term": "202330", "crn": "35856" },
      { "term": "202330", "crn": "35857" },
      { "term": "202330", "crn": "38653" }
    ],
    "description": "Explores linguistics, the scientific study of language. Major topics include phonetics (production of speech sounds), phonology (sound systems in languages), morphology (structure of words), syntax (grammatical relationships between words and sentences), and semantics (meaning of words and sentences). Other topics may be surveyed such as the relationship between language and culture, language use within speech communities, languages in contact, the study of language change, language and brain, animal communication, and first language acquisition.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "LING",
    "number": "2350",
    "title": "Linguistic Analysis",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "18911" },
      { "term": "202330", "crn": "30903" }
    ],
    "description": "Builds on the foundations of linguistic analysis developed in LING 1150. Offers students an opportunity to obtain a foundational basis for future study by focusing on four core areas of linguistics: phonetics, phonology, morphology, and syntax. Students hone their analytic abilities as they work with increasingly complex datasets. Adopting a descriptive, nontheoretical approach, students conduct linguistic research through a semester-long analysis of a world language.",
    "coreqs": [],
    "prereqs": [
      { "subject": "LING", "number": "1449" },
      "Or",
      { "subject": "LING", "number": "1150" }
    ]
  },
  {
    "subject": "LING",
    "number": "3412",
    "title": "Language and Culture",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC", "WI"],
    "sections": [{ "term": "202310", "crn": "18912" }],
    "description": "Explores the complex, often inexplicit relationship between language and culture, using a variety of methods drawn from the fields of anthropological linguistics and sociolinguistics. Questions may include: How do language and thought interact? How is language used to create and maintain social institutions and individual personae? How is language used differently by and across gender, ethnicity, and social class?",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "LING", "number": "1150" },
      "Or",
      { "subject": "ENGL", "number": "1150" },
      ")",
      "And",
      "(",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      ")"
    ]
  },
  {
    "subject": "LING",
    "number": "3420",
    "title": "Phonetics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD"],
    "sections": [{ "term": "202330", "crn": "38654" }],
    "description": "Surveys phonetics, the study of speech sounds, including articulatory, acoustic, and auditory phonetics. Articulatory phonetics topics include anatomy and physiology; cross-linguistic consonant and vowel articulation; aerodynamics of speech production; coarticulation phenomena; and phonetics of supersegmentals such as syllables, stress, tone, and pitch accent. Acoustic phonetics topics include the physics of sound waves, reading spectrograms, and performing acoustic analyses. Auditory phonetics topics include audition and speech perception.",
    "coreqs": [],
    "prereqs": [{ "subject": "LING", "number": "2350" }]
  },
  {
    "subject": "LING",
    "number": "3422",
    "title": "Phonology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [{ "term": "202310", "crn": "18913" }],
    "description": "Examines phonology, the study of the mental representation, organization, and patterning of sounds in human language. Major topics include phonological typology, phonemes, underlying and surface representations, phonological rules and alternations, natural classes of sounds, syllables and prosody, autosegmental phonology, rule-based vs. constraint-based approaches, morphophonology, diachronic phonology, and current theoretic models of sound systems.",
    "coreqs": [],
    "prereqs": [{ "subject": "LING", "number": "2350" }]
  },
  {
    "subject": "LING",
    "number": "3424",
    "title": "Morphology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [{ "term": "202310", "crn": "18914" }],
    "description": "Introduces morphology, the study of the structure, distributional behavior, and use of words. Covers descriptive methods of analysis, hierarchical word structure, morphological processes and rules, productivity, morphological change, and the interaction of morphology with phonology and syntax. Introduces major contemporary theories, including split morphology and single-component architecture.",
    "coreqs": [],
    "prereqs": [{ "subject": "LING", "number": "2350" }]
  },
  {
    "subject": "LING",
    "number": "3440",
    "title": "Language Acquisition",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38655" }],
    "description": "Examines the milestones and developmental patterns of typical first language acquisition across the linguistic system. Details the patterns and expected norms for the acquisition and development of speech perception and production, semantics, morphosyntax, pragmatics, and the lexicon. Considers biological, environmental, linguistic, and other factors that contribute to the processes of language acquisition, as well as major theories in the field. Students gain hands-on experience transcribing, analyzing, and evaluating child language data throughout the semester.",
    "coreqs": [],
    "prereqs": [
      { "subject": "LING", "number": "1449" },
      "Or",
      { "subject": "LING", "number": "1150" }
    ]
  },
  {
    "subject": "LING",
    "number": "3442",
    "title": "Sociolinguistics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI", "WI"],
    "sections": [{ "term": "202330", "crn": "38656" }],
    "description": "Focuses on why people choose to say things in different ways in different situations. Examines language behavior in its social context and outlines the linguistic constructs that allow conversation to occur, the types of variation that can occur in registers and dialects, and the possible reasons for choosing different linguistic varieties. Also explores linguistic variation in relation to social context, gender, socioeconomic class, race, and ethnicity.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "ENGL", "number": "1150" },
      "Or",
      { "subject": "LING", "number": "1449" },
      "Or",
      { "subject": "LING", "number": "1150" },
      ")",
      "And",
      "(",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      ")"
    ]
  },
  {
    "subject": "LING",
    "number": "3450",
    "title": "Syntax",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [
      { "term": "202310", "crn": "18915" },
      { "term": "202330", "crn": "33150" }
    ],
    "description": "Introduces syntax, the theory of sentence structure. Explores how to do syntactic analysis using linguistic evidence and argumentation. Focuses primarily on English, with some discussion on the syntax of other languages. Other topics include syntactic universals and the relation between syntax and semantics.",
    "coreqs": [],
    "prereqs": [{ "subject": "LING", "number": "2350" }]
  },
  {
    "subject": "LING",
    "number": "3452",
    "title": "Semantics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [{ "term": "202330", "crn": "38657" }],
    "description": "Focuses on meaning and how it is expressed in language—through words, sentence structure, intonation, stress patterns, and speech acts. Considers how content, logic, and speakers’ and listeners’ assumptions affect what sentences can mean and how linguistic meaning is determined by one’s perceptual system or culture.",
    "coreqs": [],
    "prereqs": [
      { "subject": "LING", "number": "1449" },
      "Or",
      { "subject": "LING", "number": "1150" }
    ]
  },
  {
    "subject": "LING",
    "number": "3454",
    "title": "History of English",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "18916" }],
    "description": "Surveys the linguistic and social history of the English language from its Indo-European beginnings to the present. Examines the changes that have occurred in the sound system, word and sentence structures, vocabulary, semantics, and spelling from a formal linguistic perspective. Considers issues in language change—the influence of foreign invasion and migration, differences in dialect, and the emergence of English as a “world” language.",
    "coreqs": [],
    "prereqs": [{ "subject": "LING", "number": "1150" }]
  },
  {
    "subject": "LING",
    "number": "4654",
    "title": "Seminar in Linguistics",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [{ "term": "202330", "crn": "34792" }],
    "description": "Explores a topic in current linguistics research. Requires prior completion of either two 3000-level LING courses or one 3000-level LING course and permission of instructor. May be repeated without limit.",
    "coreqs": [],
    "prereqs": [{ "subject": "LING", "number": "2350" }]
  },
  {
    "subject": "LING",
    "number": "4891",
    "title": "Research Seminar in Linguistics",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [{ "term": "202330", "crn": "32977" }],
    "description": "Offers individualized research experience on a chosen topic under the direction of a faculty member. Also includes group meetings of students and the faculty member to study relevant research methods, to discuss relevant research literature, and to present research progress and results. Research content and requisites depend on the instructor, and prior arrangements should be made with the faculty member well in advance of registration. May be repeated up to eight times.",
    "coreqs": [],
    "prereqs": []
  }
]
