[
  {
    "subject": "MATL",
    "number": "5380",
    "title": "Particulate Materials Processing",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38698" }],
    "description": "Covers the processing of metallic and ceramic materials from particulate form. Includes particulate fabrication, characterization, handling, and consolidation for alloys, ceramics, and composites. Other topics include the principles of sintering in the absence and presence of liquid, advanced materials processing by rapid-solidification powder metallurgy, and the processing and structures of advanced ceramics."
  },
  {
    "subject": "MATL",
    "number": "6250",
    "title": "Soft Matter",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "36110" }],
    "description": "Introduces the relatively young field of soft matter, which encompasses the physical description of various states of soft materials including liquids, colloids, polymers, foams, gels, granular materials, and a number of biological materials. Soft matter (also known as &#8220;soft condensed matter&#8221; or &#8220;complex fluids&#8221;) is less ordered than metals and oxides (hard condensed matter) and is more subject to thermal fluctuations and applied forces. Focuses on critical thinking, problem diagnosis, estimation, statistical analysis, and data-based decision making. Includes many in-class demonstrations from colloidal assembly to emulsion stability to cellular apoptosis. Highlights applications such as industrial processing, life sciences, and environmental remediation. Requires graduate study in related field or permission of instructor."
  },
  {
    "subject": "MATL",
    "number": "6270",
    "title": "Principles, Devices, and Materials for Energy Storage and Energy Harvesting",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "15091" }],
    "description": "Introduces students to materials, devices, and mechanisms for clean and sustainable energy while providing a broad overview of energy storage and energy harvesting. Offers examples related to materials and devices used in energy storage and harvesting and delves into the principles that underlie the performance of advanced electrochemical storage and harvesting systems, for example solar energy and mechanical energy. Also covers efficient energy usage, such as energy-efficient lighting and building. Beyond course content, assignments provide students with opportunities to practice concise writing and peer review of abstracts, deliver scientific presentations, and explore optimum ways to present technical information. Students should have some prior knowledge of materials science, electrochemistry, and/or semiconductor physics.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "MATL",
    "number": "6285",
    "title": "Structure, Properties, and Processing of Polymeric Materials",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11493" },
      { "term": "202310", "crn": "16888" }
    ],
    "description": "Provides an introduction to the organic chemistry of polymers, the effects of chemical composition on structure, melting point, and degradation, and the thermodynamics of polymers. Other topics include the mechanical properties of polymers, analysis and testing, the effects of processing on structures and properties, and the processing of industrial polymers, with applications.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "MATL",
    "number": "7350",
    "title": "Mechanical Behavior and Strengthening Mechanisms",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32143" }],
    "description": "Covers dislocation theory and includes such topics as crystalline defects, elastic properties of dislocation, movement of dislocations, multiplication, intersection, annihilation, dislocations in crystalline materials, and dislocation arrays and crystal boundaries. Examines application of dislocation theory to microplasticity, dynamic recovery and recrystallization, strengthening mechanisms, and high-temperature deformation. Requires knowledge of materials science."
  },
  {
    "subject": "MATL",
    "number": "7355",
    "title": "Thermodynamics of Materials",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13001" }],
    "description": "Covers fundamentals of materials thermodynamics that encompass the first, second, and third laws, entropy, enthalpy, and free energy. Emphasis is on phase stability and equilibria, phase diagram computation with applications to phases in metals, alloys, and ionic compounds. Requires knowledge of thermodynamics course and materials science course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "MATL",
    "number": "7360",
    "title": "Kinetics of Phase Transformations",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32832" }],
    "description": "Focuses on the different types of phase transformations that occur in materials in relation to theory and practice. Topics include the diffusion equations, mechanisms of diffusion in crystalline solids, random walk theory, ionic conduction, high-diffusivity paths, diffusional and nondiffusional phase transformations, and microstructural evolution in material processing."
  },
  {
    "subject": "MATL",
    "number": "7365",
    "title": "Properties and Processing of Electronic Materials",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38699" }],
    "description": "Focuses on electronic principles and the processing techniques underlying the processing/structure/property relationships of materials. Covers metals and alloys, semiconductors, and insulators. Topics include electronic structures, band theory; thermal, electrical, and magnetic properties; and processing methods including film deposition."
  },
  {
    "subject": "MATL",
    "number": "7945",
    "title": "Master's Project",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "34122" },
      { "term": "202330", "crn": "34150" }
    ],
    "description": "Offers theoretical or experimental work under individual faculty supervision."
  },
  {
    "subject": "MATL",
    "number": "7978",
    "title": "Independent Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "31982" },
      { "term": "202330", "crn": "30973" },
      { "term": "202330", "crn": "31486" },
      { "term": "202330", "crn": "33390" }
    ],
    "description": "Offers theoretical or experimental work under individual faculty supervision. May be repeated without limit."
  },
  {
    "subject": "MATL",
    "number": "7990",
    "title": "Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "31293" },
      { "term": "202330", "crn": "33033" },
      { "term": "202330", "crn": "35285" },
      { "term": "202330", "crn": "30679" },
      { "term": "202330", "crn": "30678" },
      { "term": "202330", "crn": "30825" },
      { "term": "202330", "crn": "31653" }
    ],
    "description": "Offers analytical and/or experimental work conducted under the direction of the faculty in fulfillment of the requirements for the degree. Requires first-year students to attend a graduate seminar program that introduces the students to the methods of choosing a research topic, conducting research, and preparing a thesis. Requires successful completion of the seminar program. May be repeated without limit."
  },
  {
    "subject": "MATL",
    "number": "7996",
    "title": "Thesis Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "32303" },
      { "term": "202330", "crn": "30677" },
      { "term": "202330", "crn": "30676" },
      { "term": "202330", "crn": "31294" },
      { "term": "202330", "crn": "31295" },
      { "term": "202330", "crn": "31296" }
    ],
    "description": "Offers continuing master's thesis supervision under individual faculty supervision."
  }
]
