[
  {
    "subject": "PA",
    "number": "6200",
    "title": "Anatomy and Physiology 1",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10772" }],
    "description": "Emphasizes the structure and function of the human body including cells, tissues, and organs. Highlights interrelationships among systems and regulation of physiological functions involved in maintaining homeostasis. Focuses on features of clinical importance. Covers musculoskeletal, neurologic, cardiovascular, respiratory, gastrointestinal, endocrine, immunologic, and renal systems. Requires cadaver laboratory sessions. This course is the first in a two-course sequence.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6201",
    "title": "Anatomy and Physiology 2",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30624" }],
    "description": "Emphasizes the structure and function of the human body including cells, tissues, and organs. Highlights interrelationships among systems and regulation of physiological functions involved in maintaining homeostasis. Focuses on features of clinical importance. Covers musculoskeletal, neurologic, cardiovascular, respiratory, gastrointestinal, endocrine, immunologic, and renal systems. Requires cadaver laboratory sessions. This is the second of a two-course sequence."
  },
  {
    "subject": "PA",
    "number": "6203",
    "title": "Physical Diagnosis and Patient Evaluation 1",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10769" }],
    "description": "Presents the techniques for eliciting an accurate history, performing an appropriate physical examination, making case presentations, and documenting patient information. Includes issues such as effective communication, confidentiality, cultural competence, and dealing with patients who are terminally ill or disabled. Emphasizes skill development. Students participate in all aspects of the clinical encounter.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6204",
    "title": "Physical Diagnosis and Patient Evaluation 2",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30698" }],
    "description": "Presents the techniques for eliciting an accurate history, performing an appropriate physical examination, making case presentations, and documenting patients' information. Includes issues such as effective communication, confidentiality, cultural competence, and dealing with patients who are terminally ill or disabled. Emphasizes the correlation of pertinent physical findings with their respective clinical conditions. Students participate in all aspects of the clinical encounter."
  },
  {
    "subject": "PA",
    "number": "6205",
    "title": "Pharmacology 1",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10770" }],
    "description": "Examines the classification, mechanisms of action, and use of a broad spectrum of therapeutic agents. Focuses on dose response, side effects, adverse reactions, and the role of patient concordance in medication effectiveness.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6206",
    "title": "Pharmacology 2",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30697" }],
    "description": "Continues PA 6205. Examines the classification, mechanisms of action, and use of a broad spectrum of therapeutic agents. Focuses on dose response, side effects, adverse reactions, and the role of patient concordance in medication effectiveness."
  },
  {
    "subject": "PA",
    "number": "6207",
    "title": "Clinical Laboratory and Diagnostic Methods",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30998" }],
    "description": "Covers a variety of diagnostic and therapeutic evaluations including clinical laboratory methods, radiologic studies, and electrocardiography. Includes basic principles of diagnostic and therapeutic patient evaluation, radiology, indications and interpretation of clinical laboratory studies, demonstration and practice of various diagnostic methods, and electrocardiography theory and interpretation."
  },
  {
    "subject": "PA",
    "number": "6208",
    "title": "Professional Issues for Physician Assistants",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "18129" }],
    "description": "Offers students the opportunity to understand their professional environment, community resources, legal parameters, and ethical situations they may face. Also addresses interpersonal dynamics in working with physicians and other healthcare providers. Some material is covered in problem-based learning sessions.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6311",
    "title": "Principles of Medicine 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10771" }],
    "description": "Presents a systems approach to the principles of disease processes and includes such topics as physiology, pathophysiology, the natural history of disease, diagnostic procedures, and therapeutic measures. This course is the first of a three-semester series covering core medical concepts and knowledge grounded in scientific principles and evidence-based medicine on the diseases and conditions commonly encountered in clinical practice.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6312",
    "title": "Principles of Medicine 2",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30696" }],
    "description": "Continues PA 6311. Presents a systems approach to the principles of disease processes and includes such topics as physiology, pathophysiology, the natural history of disease, diagnostic procedures, and therapeutics measures. This course is thesecond of a three-semester series covering core medical concepts and knowledge grounded in scientific principles and evidence-based medicine on the diseases and conditions commonly encountered in clinical practice."
  },
  {
    "subject": "PA",
    "number": "6323",
    "title": "Clinical Neurology",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30695" }],
    "description": "Presents the clinical application of neuroanatomy and neurophysiology. Offers the opportunity to develop an understanding of the nervous system's normal functioning as well as a clinical approach to assessing and managing nervous system disorders and disease states, and their effects on patients and their families."
  },
  {
    "subject": "PA",
    "number": "6324",
    "title": "Principles of Pediatrics",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30599" }],
    "description": "Presents the physiological and psychological fundamentals of child development. Focuses on the major common pediatric illnesses, including their signs, symptoms, and treatment regimens; various immunizations and medications used in pediatrics and their indication and dosage in relation to specific disorders; and management of pediatric emergencies."
  },
  {
    "subject": "PA",
    "number": "6325",
    "title": "Principles of Psychiatry",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10618" }],
    "description": "Provides an opportunity to understand how to work with patients and families exhibiting psychiatric problems. Includes such topics as psychological growth and development, psychiatric diagnoses, and the effect of social milieu on behavior, the psychological bases of drug and alcohol abuse, the dynamics of psychosomatic problems, the role of culture in self-concepts, and family attitudes toward mental illness as well as appropriate psychotropic medications.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6400",
    "title": "Applied Clinical Study in Medicine",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10774" },
      { "term": "202330", "crn": "30693" }
    ],
    "description": "Offers supervised clinical practice experience that is designed to foster students' growth regarding general medical knowledge and clinical reasoning skills. Students may have the opportunity to review historical information, interview patients, perform physical exams, order and interpret studies, perform procedures, present assessments, develop differentials, educate patients, coordinate interdisciplinary communication, document encounters, develop professionalism skills, and improve the ability to triage and manage tasks efficiently.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6401",
    "title": "Applied Clinical Study in Ambulatory Medicine",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10773" },
      { "term": "202330", "crn": "30694" }
    ],
    "description": "Offers supervised clinical practice experience. Allows students to further hone their content knowledge and clinical skills either in the area of primary care or in a selected subspecialty area of medicine. Offers students an opportunity to develop skills related to both the initial assessment, as well as the ongoing management of patients with established diagnoses, while working to develop their clinical reasoning skills given initial presentations. Emphasizes assessing and managing both acute and chronic medical problems.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6402",
    "title": "Applied Clinical Study in Family Practice",
    "scheduleType": "Off-campus instruction w/ lec",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10777" },
      { "term": "202330", "crn": "33704" }
    ],
    "description": "Offers supervised clinical practice experience. Offers students an opportunity to evaluate and treat patients while emphasizing the patient as an individual and family member. Clinical rotation experience may include exposure to preventative medicine, patient education, integration of community services, and medical diagnosis and management for both acute and chronic conditions.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6403",
    "title": "Applied Clinical Study in Emergency Medicine",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10814" },
      { "term": "202330", "crn": "30689" }
    ],
    "description": "Offers supervised clinical practice experience. Offers students an opportunity to gain experience triaging, evaluating, and managing patients in an emergency medicine setting. Clinical skills honed may include the ability to diagnose and manage patients who present with urgent and emergent complaints, ranging from acute illnesses and traumatic injuries to life-threatening issues.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6404",
    "title": "Applied Clinical Study in Women's Health",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10775" },
      { "term": "202330", "crn": "30692" }
    ],
    "description": "Offers supervised clinical practice experience. Offers students exposure to clinical medicine as it relates to typical women’s health issues. May include common gynecologic disorders, obstetrical complaints, and/or family planning.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6405",
    "title": "Applied Clinical Study in Pediatrics",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10776" },
      { "term": "202330", "crn": "30691" }
    ],
    "description": "Offers supervised clinical practice experience. Offers students an opportunity to manage care of pediatric patients. Common components of this rotation may include exposure to both well child and urgent care visits, offering students an opportunity to develop interview and physical examination skills with children of all ages.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6406",
    "title": "Applied Clinical Study in Surgery",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10779" },
      { "term": "202330", "crn": "35612" }
    ],
    "description": "Offers supervised clinical practice experience. Designed to allow students to gain experience in a surgical setting. Experiences may include preoperative, intraoperative, as well as postoperative patient care. Offers students an opportunity to hone their procedural and assessment skills, distinguish between surgical vs. nonsurgical presentations, and differentiate acute from elective complaints.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6407",
    "title": "Applied Clinical Study in Mental Health",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10778" },
      { "term": "202330", "crn": "30690" }
    ],
    "description": "Offers supervised clinical practice experience. Exposes students to a variety of behavioral medicine patient care experiences. Emphasizes recognizing various types of mental health disorders that may require referral to a specialist and managing problems that can be handled by the nonspecialist. Offers students an opportunity to further their understanding of effective patient interactions and the mental health components of health, disease, and disability.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PA",
    "number": "6408",
    "title": "Applied Clinical Study Elective",
    "scheduleType": "Off-campus instruction",
    "credits": 5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13419" },
      { "term": "202330", "crn": "30813" }
    ],
    "description": "Offers supervised clinical practice experience. Exposes students to a medical, surgical, or subspecialty of either field for further study. Offers students an opportunity to hone their ability to recognize and treat conditions within these fields of medicine to foster utilization or support of related specialists. Select students may participate in an elective that focuses on global health or on a clinical support role, such as administration, leadership, public health, or technology as it relates to healthcare.",
    "coreqs": [],
    "prereqs": []
  }
]
