[
  {
    "subject": "PHIL",
    "number": "1000",
    "title": "Philosophy at Northeastern",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10539" },
      { "term": "202330", "crn": "34896" }
    ],
    "description": "Intended for freshmen in the College of Social Sciences and Humanities. Introduces freshmen to the liberal arts in general; familiarizes them with their major; helps them develop the academic skills necessary to succeed (analytical ability and critical thinking); provides grounding in the culture and values of the University community; and helps them develop interpersonal skills—in short, familiarizes students with all skills needed to become a successful university student.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1101",
    "title": "Introduction to Philosophy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "10479" },
      { "term": "202310", "crn": "11089" },
      { "term": "202330", "crn": "30962" },
      { "term": "202330", "crn": "34226" }
    ],
    "description": "Introduces students to philosophy by acquainting them with the theories and arguments of classical and contemporary philosophers and by teaching skills of constructing and analyzing arguments. Emphasizes philosophical inquiry. Topics include the basis of morality, free will vs. determinism, the existence of God, the problem of suffering, and the nature of knowledge.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1102",
    "title": "Introduction to Contemporary Moral Issues",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "12913" },
      { "term": "202260", "crn": "60370" },
      { "term": "202260", "crn": "61440" },
      { "term": "202240", "crn": "40391" },
      { "term": "202330", "crn": "31136" },
      { "term": "202310", "crn": "21102" }
    ],
    "description": "Focuses on current controversial issues and moral debates. Specific topics vary but include subjects like abortion, euthanasia, global poverty, economic justice, affirmative action, gender relations, animal rights, the environment, the death penalty, war, cloning, and same-sex marriage. Offers an opportunity to learn to apply both the methods of philosophical analysis and various ethical and political theories to these controversies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1110",
    "title": "Introduction to Religious Studies",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC"],
    "sections": [
      { "term": "202310", "crn": "14881" },
      { "term": "202330", "crn": "33601" }
    ],
    "description": "Examines the methods, disciplines, and theories employed in the academic study of religion. Focuses on major theories of religion employed in the discipline of religious studies, including historical, psychological, anthropological, and sociological approaches. Introduces students to the primary methods of research in the academic study of religion.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1112",
    "title": "Debating Ethical Controversies",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "15964" },
      { "term": "202330", "crn": "36043" },
      { "term": "202330", "crn": "39280" }
    ],
    "description": "Introduces students to the fundamentals of moral theory; ethical reasoning; social and political philosophy; as well as theories of social, political, and institutional change. Emphasizes in-depth ethical analysis and evaluation of the issues studied, their social and historical sources and context, as well as the way in which responses to them can and should lead to institutional and policy changes. Offers students an opportunity to be selected for an off-campus competitive debate experience. This course is modeled after the Intercollegiate Ethics Bowl debates on current social and ethical issues.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1115",
    "title": "Introduction to Logic",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [
      { "term": "202310", "crn": "10125" },
      { "term": "202330", "crn": "30287" },
      { "term": "202330", "crn": "38614" }
    ],
    "description": "Covers the fundamentals of (formal) deductive and inductive logic. Begins with a thorough treatment of Boolean (i.e., truth-functional or propositional) logic, which provides the foundation for both mathematical and statistical reasoning. Discusses various applications of Boolean logic, including the reconstruction and evaluation of (natural language) deductive arguments. Covers inductive-logical reasoning, such as the fundamentals of the probability calculus and its applications to inductive (ampliative) inference. Offers students an opportunity to understand both deductive (e.g., mathematical) and inductive (e.g., statistical) reasoning.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1130",
    "title": "Comparative Ethics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "ER"],
    "sections": [
      { "term": "202310", "crn": "19605" },
      { "term": "202330", "crn": "36044" }
    ],
    "description": "Focuses on how traditions imagine the moral life in cross-cultural contexts. Topics may include ideals of human flourishing, notions of virtue and vice, and conceptions of self and community. Offers students an opportunity to learn methods of philosophical analysis and argumentation in cross-cultural contexts.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1145",
    "title": "Technology and Human Values",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "11942" },
      { "term": "202310", "crn": "12791" },
      { "term": "202310", "crn": "13128" },
      { "term": "202310", "crn": "13199" },
      { "term": "202310", "crn": "13198" },
      { "term": "202310", "crn": "15311" },
      { "term": "202310", "crn": "20425" },
      { "term": "202310", "crn": "20483" },
      { "term": "202310", "crn": "20567" },
      { "term": "202310", "crn": "21084" },
      { "term": "202310", "crn": "21085" },
      { "term": "202260", "crn": "60455" },
      { "term": "202240", "crn": "40455" },
      { "term": "202240", "crn": "41142" },
      { "term": "202330", "crn": "32357" },
      { "term": "202330", "crn": "32358" },
      { "term": "202330", "crn": "32579" },
      { "term": "202330", "crn": "32841" },
      { "term": "202330", "crn": "32842" },
      { "term": "202330", "crn": "36045" },
      { "term": "202330", "crn": "39278" },
      { "term": "202310", "crn": "21295" }
    ],
    "description": "Studies philosophy of technology, as well as ethics and modern technology. Considers the relationship between technology and humanity, the social dimensions of technology, and ethical issues raised by emerging technologies. Discusses emerging technologies such as biotechnology, information technology, nanotechnology, and virtual reality.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1160",
    "title": "Introduction to Economic Justice",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "12208" },
      { "term": "202310", "crn": "20800" },
      { "term": "202330", "crn": "34227" }
    ],
    "description": "Explores questions of economic justice from a philosophical perspective. Examines capitalism, what it is and what its ethical virtues and limitations are; if there are changes or alternatives to capitalism that would make our economic system more just; how much economic inequality we should consider morally acceptable; and in what ways racism and gender discrimination impact the fairness of our economy. Considers these questions by reading works in the history of philosophy while also engaging with contemporary philosophers writing about current challenges to economic justice, such as racism, gender discrimination, and economic inequality.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1165",
    "title": "Moral and Social Problems in Healthcare",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "10138" },
      { "term": "202310", "crn": "13593" },
      { "term": "202310", "crn": "11876" },
      { "term": "202310", "crn": "12179" },
      { "term": "202310", "crn": "15967" },
      { "term": "202260", "crn": "60209" },
      { "term": "202240", "crn": "40199" },
      { "term": "202330", "crn": "31468" },
      { "term": "202330", "crn": "31613" },
      { "term": "202330", "crn": "31721" },
      { "term": "202330", "crn": "32234" },
      { "term": "202330", "crn": "34714" }
    ],
    "description": "Introduces ethical theories and moral principles, and then uses these theories and principles to analyze the moral problems that arise in the medical context. Topics include euthanasia, medical paternalism, informed consent, patient confidentiality, the right to die, the ethics of medical research, abortion, the right to healthcare, distribution of scarce medical resources, and the ethical implications of health maintenance organizations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1170",
    "title": "Business, Ethics, and Human Rights",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "10857" },
      { "term": "202330", "crn": "33337" }
    ],
    "description": "Examines the moral, social, and human rights implications of business for individuals and communities, both globally and domestically. Topics include corporate social responsibility, stakeholder theory, advertising, and gun violence, diversity and racism, CEO activism, affirmative action in the tech sector, the gig economy and employee rights, as well as human rights violations by multinational companies, including sweatshops and environmental harms. Examines the contributions of both big and small businesses to making the world a better place and considers policy that can work to that end.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1180",
    "title": "Environmental Ethics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "14882" },
      { "term": "202240", "crn": "40896" },
      { "term": "202330", "crn": "32843" },
      { "term": "202330", "crn": "39279" }
    ],
    "description": "Focuses on a current ecological crisis and addresses the values that underlie our concern over this crisis, whether the values at issue are anthropocentric or biocentric. Explores the ethical implications these ecological concerns have for our individual lifestyles, and for our role as members of communities.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1185",
    "title": "The Ethics of Food",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [{ "term": "202330", "crn": "36046" }],
    "description": "Introduces the ethics of food. Elucidates a wide range of ethical issues associated with food production, processing, distribution, and consumption. Offers students an opportunity to develop skills in ethics and values analysis that can be applied to evaluate food-related practices and policies. Includes topics such as the ethics of different food systems, genetically modified crops, meat eating, hunting, food security, food justice, sustainability, synthetic meat, food advertising, food safety, and foodie culture.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1195",
    "title": "Research Ethics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "15968" },
      { "term": "202330", "crn": "32950" }
    ],
    "description": "Addresses how to engage in scientific, medical, and technological research in an ethically responsible manner. Research is crucial to understanding social, environmental, and health problems, as well as to developing effective responses to them. If the paradigm of responsible research is too restrictive, the benefits of scientific progress and technological innovation can be delayed or unrealized. At the same time, researchers have a responsibility to protect research subjects, to appropriately engage with members of the community, and to avoid behaving in ways that undermine scientific research in the long run. Explores the many ethical dimensions of research, and introduces students to the ethical foundations and controversies that are central to developing appropriate ethical frameworks for engaging in research.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1260",
    "title": "Apocalypticism in Film",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC"],
    "sections": [
      { "term": "202310", "crn": "12560" },
      { "term": "202310", "crn": "12562" },
      { "term": "202260", "crn": "61227" }
    ],
    "description": "Begins with an investigation of biblical texts that give rise to apocalypticism, definitions of apocalypticism, and an introductory exploration of the various ways in which apocalypticism has manifested itself in Western culture. Examines the diverse and changing presentation of apocalypticism in film and includes titles such as 'The Book of Eli,' 'The Day the Earth Stood Still,' 'Independence Day,' 'The Seventh Seal,' and 'Blade Runner.'",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1271",
    "title": "Sex in Judaism, Christianity, and Islam",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "ER"],
    "sections": [
      { "term": "202310", "crn": "20084" },
      { "term": "202240", "crn": "40527" }
    ],
    "description": "Explores approaches to gender, social organization of sexuality and gender, sexual ethics, and marriage in Judaism, Christianity, and Islam. Explores various sources within each tradition that serve as normative foundations, contemporary cultural and sociological dynamics that challenge those foundations, and psychological/existential considerations for understanding the general nature of human sexuality. Addresses how these traditions understand gender and gender roles, seek to shape and control interactions between men and women, regulate sexual relations outside of and within marriage, view sexuality education, regard homosexuality, and examine historical and contemporary approaches to marriage, divorce, and parenting. PHIL 1271 and WMNS 1271 are cross-listed.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1275",
    "title": "Hinduism, Buddhism, and Beyond",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "IC"],
    "sections": [{ "term": "202330", "crn": "34824" }],
    "description": "Examines Hinduism, Jainism, Theravada Buddhism, Mahayana Buddhism, Confucianism, Taoism, and Shinto within South Asia (India) and east Asia (China and Japan). Combines readings in primary source materials (the religious texts of these traditions) with secondary examinations of the historical and doctrinal developments within each tradition and region. This course intends to give students a context in which to examine the ways in which religions develop in interlocking sociocultural and political contexts and to provide a grounding in the lived experiences of these religious traditions.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1280",
    "title": "Islam: Rituals, Traditions, and Debates",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC"],
    "sections": [{ "term": "202310", "crn": "19606" }],
    "description": "Explores Islam through its foundations narrative, rituals, doctrines, and ethical teachings. Presents Islam in terms of its diversity by focusing on a series of key debates in Islamic thought and practice from its early history to the present day in cross-cultural perspectives.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1290",
    "title": "Chinese Philosophy and Religion",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "IC"],
    "sections": [{ "term": "202330", "crn": "38615" }],
    "description": "Requires prior completion of one philosophy course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1300",
    "title": "Knowledge in a Digital World",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "14883" },
      { "term": "202310", "crn": "19211" },
      { "term": "202330", "crn": "34252" },
      { "term": "202330", "crn": "38768" }
    ],
    "description": "Examines the impact that information technologies (such as the internet, search engines, blogs, wikis, and smartphones); information processing techniques (such as big data analysis, machine learning, crowdsourcing, and cryptography); and information policies (such as privacy norms and speech restrictions) have on what we know and how much we know, as individuals and as a society. The digital world can enhance our ability to acquire knowledge by providing us with fast and cheap access to huge amounts of information. However, it can also undermine our cognitive abilities and provide us with inaccurate or misleading information. Studies normative frameworks from epistemology and ethics (such as epistemic value theory, the extended mind hypothesis, and moral rights) to evaluate these technologies and policies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "1666",
    "title": "The Problem of Evil in Film",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "ER"],
    "sections": [
      { "term": "202310", "crn": "20250" },
      { "term": "202240", "crn": "41382" }
    ],
    "description": "Seeks to answer the question, \"What is evil?\" Uses a variety of film genres to examine the definitions of evil in relation to concepts such as power, sin, hate, greed, envy, murder, neglect, fear, terror, tragedy, and “the Other.” Studies the problem of evil from the perspectives of religious studies and philosophy. Examines the various explanations for evil from a variety of Western religious traditions and explores the presentation of ethical dilemmas and moral theory to assess the content of a variety of films. Studies film titles such as The Dark Knight, The Exorcist, Silence of the Lambs, Frankenstein, Life Is Beautiful, Rear Window, Dr. Strangelove, Phone Booth, Crash, Star Wars, and The Wizard of Oz.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2016",
    "title": "The Philosophy and Ethics of Lying and Deception",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [{ "term": "202330", "crn": "38616" }],
    "description": "Examines lying and other forms of deception in a wide range of modern contexts from advertising to politics, using different theoretical approaches. Offers students an opportunity to use philosophical and economic theories to investigate what lying is, why people lie, when and why it is wrong to lie, how we can learn from other people even though they might be lying, and how social institutions affect—and are affected by—all of this lying. In modern society, we are confronted with lies, spin, fake news, and even “BS” on a daily basis. Since these forms of deception play such a central role in human life, many philosophers—including Plato, Augustine, and Kant—have studied the ontology, ethics, epistemology, economics, and logic of lying and deception.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2143",
    "title": "Philosophy for Children",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EI", "EX"],
    "sections": [{ "term": "202310", "crn": "19607" }],
    "description": "Explores big questions in philosophy—how should one conduct oneself, what does it mean to know something, are there object values in an aesthetic domain such as art? Offers students an opportunity to learn methodologies and tools of philosophical inquiry and apply them to works of children’s literature in order to be able to facilitate philosophical discussions in the elementary school classroom. Emphasizes creating a community of inquiry and learning how to devise and communicate different answers to philosophical questions at the elementary level. Students develop lesson plans to help engage young children in philosophical discussion and reflection.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2155",
    "title": "Human Rights",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [{ "term": "202330", "crn": "36049" }],
    "description": "Offers students an opportunity to obtain a solid understanding of the political, philosophical, and legal dimensions of human rights as well as an overview of some of the current debates in human rights. Discusses the intellectual history of human rights and explores their philosophical and historical roots. Examines their legal and political dimensions and human rights laws and institutions. Explores in-depth a number of contemporary human rights issues including genocide, women’s rights, children’s rights, refugees, and torture.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2230",
    "title": "Music and Religion",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "EX", "IC"],
    "sections": [{ "term": "202330", "crn": "38617" }],
    "description": "Explores the relationship between religion, sound, and musical expression using the lenses of gender studies, cultural studies, and performance theory. Emphasizes the interpretive and symbolic understandings of sonic expressions of religiosity, including chanting, mantra use, choir and congregational singing, and speaking in tongues. Seeks to familiarize students with some of the key sonic expressions within the Christian, Islamic, Hindu, and Buddhist traditions; to explore the methods of studying musical and sonic theology; and to analyze these traditions’ own debates about the use of sound and music in religious practice.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2259",
    "title": "Sex, Gender, and Judaism",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC"],
    "sections": [{ "term": "202330", "crn": "39343" }],
    "description": "Introduces the representation of sex and gender in Jewish culture and religion. Explores varied representations of masculinity and femininity over time and place within Jewish communities; the role of biblical texts in the construction of Western conceptions of gender and sexuality; and how contemporary feminist, queer, and other sexual identities have influenced Jewish practices. Readings draw from a range of primary sources (memoirs, fiction, religious texts, etc.) and critical literature.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2303",
    "title": "Social and Political Philosophy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [
      { "term": "202310", "crn": "19608" },
      { "term": "202330", "crn": "31816" }
    ],
    "description": "Focuses on basic questions about the nature of the state and the relationship of individuals to the state. What basis is there for individuals to obey the laws of the state? What conditions must a government meet to be legitimate? What justification can be given for democratic forms of government? Also examines what sorts of controls the state should exert over citizens, and what benefits citizens have a right to expect from the state. Includes readings from both classical and contemporary sources. Not open to freshmen students.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2325",
    "title": "Ancient Philosophy and Political Thought",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "IC", "WI"],
    "sections": [
      { "term": "202310", "crn": "11943" },
      { "term": "202310", "crn": "14011" },
      { "term": "202310", "crn": "14885" },
      { "term": "202310", "crn": "15331" },
      { "term": "202260", "crn": "60605" },
      { "term": "202240", "crn": "40456" },
      { "term": "202330", "crn": "32056" },
      { "term": "202330", "crn": "33074" },
      { "term": "202330", "crn": "33842" },
      { "term": "202330", "crn": "34229" },
      { "term": "202330", "crn": "38378" },
      { "term": "202330", "crn": "38379" }
    ],
    "description": "Examines the philosophers of classical Greece, primarily Socrates, Plato, and Aristotle. These philosophers examined the nature of the material world, of the city, and of the person. The course takes up both the moral and political writings as well as the metaphysical writings. Devotes considerable attention to major works such as Plato's Republic. Some time is given to early Greek philosophers, to the Sophists, and to later developments. Requires written analysis of philosophical texts. PHIL 2325 and POLS 2325 are cross-listed.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" }
    ]
  },
  {
    "subject": "PHIL",
    "number": "2330",
    "title": "Modern Philosophy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["IC", "SI", "WI"],
    "sections": [
      { "term": "202310", "crn": "12323" },
      { "term": "202310", "crn": "16804" },
      { "term": "202330", "crn": "31817" },
      { "term": "202330", "crn": "38618" }
    ],
    "description": "Focuses on the hundred years between 1650 and 1750, sometimes called “the century of genius.” It was a period in which philosophers reacted to the new scientific discoveries of Copernicus, Kepler, and Galileo. Out of this reaction came new ways of thinking about the nature of knowledge and the nature of reality. Focuses on such major figures as the rationalists Descartes, Leibniz, and Spinoza, and the empiricists Locke, Berkeley, and Hume. Requires prior completion of one philosophy course.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" }
    ]
  },
  {
    "subject": "PHIL",
    "number": "2390",
    "title": "Cults and Sects",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC"],
    "sections": [{ "term": "202330", "crn": "38619" }],
    "description": "Examines radical religious innovation in the United States from historical, legal, and cultural analytic perspectives. Focuses on minoritized groups such as the Shakers, Peoples Temple, the Nation of Islam, and the Church of Scientology. Offers students an opportunity to acquire critical investigative tools with which to better understand the complexities of lived religion.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "2991",
    "title": "Research Practicum",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": ["EX"],
    "sections": [{ "term": "202310", "crn": "19609" }],
    "description": "Involves students in collaborative research under the supervision of a faculty member. Offers students an opportunity to learn basic research methods in the discipline. Requires permission of instructor. May be repeated once for up to 4 total credits.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3000",
    "title": "Interdisciplinary Methods for Politics, Philosophy, and Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX", "WI"],
    "sections": [{ "term": "202330", "crn": "38620" }],
    "description": "Offers students an opportunity to learn to think, research, and write in an interdisciplinary way and bring together the core methods of the three disciplines constituting the PPE major: philosophy, political science, and economics. Examines issues such as housing, environmental justice, and immigration, among others, through an interdisciplinary lens. Students analyze how systemic racism, gender, and other power structures have created asymmetrical distribution of resources, power, and political opportunities and shaped institutions, policies, and outcomes. Includes a service-learning requirement that takes place across the semester. PPE majors should plan to take this course when the majority of the major core courses are complete.",
    "coreqs": [],
    "prereqs": [{ "subject": "PHIL", "number": "1160" }]
  },
  {
    "subject": "PHIL",
    "number": "3050",
    "title": "Information and Uncertainty",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD", "FQ"],
    "sections": [{ "term": "202310", "crn": "19610" }],
    "description": "Introduces the foundations of probabilistic inference, information theory, and their uses for drawing conclusions from noisy data. Applications include diagnosing diseases with inconclusive medical tests, locating autonomous vehicles when sensors are imperfect, and how best to make inferences with incomplete or partial information. Central topics include distinguishing deductive and probabilistic inference, philosophical interpretations of probability, fundamental justifications for the rules of probability, and key concepts of information theory. Introduces analytic and mathematical methods of analysis in these cases and contemporary computational (i.e., programming) techniques for implementing and applying theories of information and probabilistic inference.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3100",
    "title": "The Religious Worlds of Boston: Faith and Devotion in Urban Life",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["EX", "IC", "SI"],
    "sections": [{ "term": "202310", "crn": "19611" }],
    "description": "Requires prior completion of one introductory-level course in the social sciences or humanities.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3305",
    "title": "Philosophy of Emotions",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER"],
    "sections": [{ "term": "202330", "crn": "38621" }],
    "description": "Requires prior completion of two philosophy courses or instructor's permission.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3343",
    "title": "Existentialism",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16598" }],
    "description": "Requires prior completion of two philosophy courses or instructor permission",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3360",
    "title": "Scientific Approaches to Philosophy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [{ "term": "202330", "crn": "36053" }],
    "description": "Requires prior completion of two philosophy and/or science courses, or instructor's permission.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3435",
    "title": "Moral Philosophy",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12914" },
      { "term": "202330", "crn": "36054" }
    ],
    "description": "Requires prior completion of two philosophy courses or instructor permission.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "3500",
    "title": "Sexuality, Gender, and the Law",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER", "SI"],
    "sections": [{ "term": "202330", "crn": "35841" }],
    "description": "Examines the legal regulation of gender and sexuality. Investigates concrete legal cases to study the history of constitutional interpretation and the current status of rights for women and sexual minorities. Focuses on important theoretical issues emerging in the writings of diverse feminist and queer legal scholars. Addresses debates over the value of conventional equality approaches in legal doctrine; equality vs. difference perspectives; ways in which legal language constructs gender and sexuality; the incorporation of sexuality and gender in ideologies of law; and the intersections of gender, sexuality, and race in legal doctrine and legal theory. PHIL 3500, POLS 3500, and WMNS 3500 are cross-listed.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "4500",
    "title": "Theory of Knowledge",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [{ "term": "202310", "crn": "15973" }],
    "description": "Requires prior completion of three philosophy courses or instructor's permission.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "4510",
    "title": "Philosophy of Science",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [{ "term": "202330", "crn": "36383" }],
    "description": "Requires prior completion of three philosophy courses (PHIL 1115 or PHIL 1215 recommended) or permission of instructor.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" }
    ]
  },
  {
    "subject": "PHIL",
    "number": "4535",
    "title": "Philosophy of Mind",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [
      { "term": "202310", "crn": "19612" },
      { "term": "202330", "crn": "36397" }
    ],
    "description": "Requires prior completion of three philosophy courses or instructor's permission.\n\nCourse Description: What does it mean for a system–whether biological or artificial–to have a mind, to understand the world around it, or to interact intelligently with it? This course approaches these questions about understanding the mind from the perspective of designing it. During the first part of the course, we closely examine influential frameworks for understanding and designing intelligent systems, develop a concrete sense of how these frameworks work, and critically assess their successes and shortcomings from philosophical, empirical, and design perspectives. In the second part of the course, we build on this background to explore some of the implications of emerging technologies, such as deep learning and large language models, augmented and virtual reality, brain-machine interface, memory transfer, and more.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "4550",
    "title": "Philosophy of Economics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["CE", "SI", "WI"],
    "sections": [{ "term": "202310", "crn": "19613" }],
    "description": "Requires prior completion of at least three philosophy and/or economics courses or instructor's permission.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "4901",
    "title": "Topics in Philosophy Seminar",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [
      { "term": "202310", "crn": "15974" },
      { "term": "202330", "crn": "34231" }
    ],
    "description": "Seminar topic: Metaethics. Requires prior completion of three philosophy courses or instructor's permission.\n\nCourse description: \"The Earth is spherical\" and \"it is wrong to kill innocent children for fun\" are both true sentences. Neither of these, the empirical claim nor the ethical claim are particularly controversial. However, while there is very little (reasonable) controversy about what makes the first sentence true (and how we know it is true), there is considerable controversy about both the metaphysics and epistemology of the second claim and others like it.\n\nThis seminar will provide a broad and deep overview of central answers to metaethical questions about what makes moral claims true and how we know them. The seminar will start with a quick refresher of answers to metaethical questions that are, for the most part and for good reason, not taken seriously by contemporary metaethicists, like Cultural Relativism and Divine Command Theory.  We will then turn to what are widely-considered the live options in contemporary Western metaethics. Some of these views deny that moral claims are true or false (Non-Cognitivism), some claim that all moral claims are false (Error Theory) or that moral language is simply a fiction where we pretend some moral claims are true (Fictionalism). On most views, there are genuine truth-makers for moral claims, but there is much disagreement about what they are. On some views, they are grounded in our subjective attitudes or desires (Subjectivism), on others they are tightly bound up with rationality (constructivism), on yet others, the moral truth-makers are entirely independent of us, either very much like the natural facts that make empirical claims true (Naturalist Realism) or some more mysterious kind of non-natural fact (Non-naturalist Realism). After a critical survey of the terrain, we'll turn our attention to book-length treatments of particular views or articles that push us to think about metaethical issues in new ways. ",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "4903",
    "title": "Seminar in Religion",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [
      { "term": "202310", "crn": "15975" },
      { "term": "202330", "crn": "34232" }
    ],
    "description": "Requires prior completion of three philosophy or religion courses or instructor's permission.\n\nDescription: We think we know cultural appropriation when we see it. Blackface, Native American headdresses, all manner of Halloween costumes—these clearly give offense. But what about Cardi B posing as the Hindu Goddess Durga in a Reebok ad, AA’s twelve-step invocation of God, or the earnest namaste you utter at the end of yoga class?\n\nIn this class we will unpack the ethical dilemmas of a messy form of cultural appropriation: the borrowing of religious doctrines, rituals, and dress for political, educational, and therapeutic reasons. Does borrowing from another’s religion harm believers? Who can consent to such borrowings? Religion is an especially vexing arena for appropriation debates because diversity within religious groups scrambles our sense of who is an insider and who is not. In order to understand why some appropriations are insulting and others benign, we will have to ask difficult philosophical questions about what religions really are.\n\nStudents will develop their own independent research projects and create public-facing ways to share their findings.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "4992",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "39347" },
      { "term": "202310", "crn": "21872" }
    ],
    "description": "Offers independent work under the direction of members of the department on a chosen topic. Course content depends on instructor. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "5001",
    "title": "Global Justice",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE", "ER", "SI", "WI"],
    "sections": [{ "term": "202330", "crn": "38622" }],
    "description": "Explores the theoretical, political, and philosophical foundations of the obligations that underlie global justice. Theoretical approaches include human rights, human capabilities, cosmopolitanism, particularism, and universalism. Examines nationalism and the particular set of obligations that it generates. Following the theoretical component, the course considers social issues that arise in a global context: (1) the duties to the distant poor, (2) global philanthropy and problems of donee accountability, (3) global health and essential medicines and issues in environmental justice, and (4) issues in international law.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHIL",
    "number": "5005",
    "title": "Information Ethics",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38623" }],
    "description": "Covers issues of justice and the public good in relation to the creation, collection, storage, analysis, processing, dissemination, and use of information. Discusses theories of justice and human rights, as well as ethical theories such as utilitarianism and principlism. Topics include intellectual and cultural property, freedom of expression, access to information, fair representation, and information privacy. Discusses how to create and use information technologies that promote individual flourishing and the public good while avoiding bias, exploitation, and manipulation.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHIL", "number": "1145" },
      "Or",
      { "subject": "PHIL", "number": "1300" },
      "Or",
      { "subject": "IS", "number": "1300" },
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "PHIL",
    "number": "5010",
    "title": "AI Ethics",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19614" }],
    "description": "Discusses artificial intelligence and the host of ethical issues it raises: decisions turned over to machine-learning algorithms can be opaque and unfair; autonomous vehicles promise to increase safety but raise challenges for assigning responsibility for accidents; diffusion of AI is likely to transform the labor market in unpredictable ways; and the data that powers machine-learning algorithms raise questions about privacy and security. In order to realize the benefits of AI while responsibly developing and implementing it, it is necessary to identify the ethical issues at stake and work to resolve them. This course takes up the philosophical and ethical questions essential to this project.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHIL", "number": "1145" },
      "Or",
      { "subject": "PHIL", "number": "1300" },
      "Or",
      { "subject": "IS", "number": "1300" },
      "Or",
      "Graduate Admission"
    ]
  }
]
