[
  {
    "subject": "PHMD",
    "number": "1000",
    "title": "College: An Introduction",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10893" },
      { "term": "202310", "crn": "10894" },
      { "term": "202310", "crn": "10895" },
      { "term": "202330", "crn": "32555" }
    ],
    "description": "Introduces the University, college, and health professions to enhance students' understanding of self and the decisions they make academically and socially as members of the University's diverse, multicultural community. Offers students an opportunity to engage in group activities and individual assignments along with active participation in a learning community to help them adjust to life on an urban campus, develop a better understanding of the learning process, acquire essential academic skills, and make connections with the faculty and students in the college.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "1001",
    "title": "Introduction to the Profession of Pharmacy",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "30240" },
      { "term": "202330", "crn": "35798" },
      { "term": "202330", "crn": "35800" }
    ],
    "description": "Introduces the profession of pharmacy. Addresses professionalism, pharmacists' responsibilities, and the education and training of pharmacists."
  },
  {
    "subject": "PHMD",
    "number": "1201",
    "title": "Introduction to Pharmacy Practice",
    "scheduleType": "Lecture",
    "credits": 2.5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17418" },
      { "term": "202310", "crn": "17196" },
      { "term": "202330", "crn": "30511" }
    ],
    "description": "Seeks to prepare pharmacy students for their first introductory pharmacy practice experience (IPPE)/co-op. Introduces students to the policies, procedures, and expectations of the Cooperative Education Program. Offers students an opportunity to develop the skills needed to be successful in the preparation, activity, and reflection components of the pharmacy co-op program; to prepare their first résumés; and to learn proper interviewing techniques. Exposes students to the various co-op opportunities available to them as well as potential career paths within the pharmacy profession. Covers workplace issues including diversity, sexual harassment, ethics, and confidence of information. Introduces students to the technical knowledge and skills required for their first pharmacy experiences in both community and institutional pharmacy practice and to drug information resources. Offers students an opportunity to develop basic communication skills to aid them in successful completion of their first IPPE.",
    "coreqs": [
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" },
      { "subject": "PHMD", "number": "1202" }
    ],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "1202",
    "title": "Lab for PHMD 1201",
    "scheduleType": "Lab",
    "credits": 0.5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17152" },
      { "term": "202310", "crn": "17153" },
      { "term": "202330", "crn": "31552" },
      { "term": "202330", "crn": "35801" },
      { "term": "202330", "crn": "31553" },
      { "term": "202330", "crn": "35802" }
    ],
    "description": "Offers students an opportunity to learn several skills needed for future patient-care experiences. Supplements lecture content and provides practical reinforcement of concepts. Students apply knowledge learned in the classroom related to the appropriate and effective use of communication strategies and basic sterile techniques/manipulations. Labs related to the learning of communication skills support a patient-centered approach in assessing, adapting, and evaluating patient medication use needs.",
    "coreqs": [
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" },
      { "subject": "PHMD", "number": "1201" }
    ],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "2100",
    "title": "Entrepreneurship in Health Sciences",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "18917" },
      { "term": "202330", "crn": "35803" }
    ],
    "description": "Addresses principles and applications of entrepreneurship in the healthcare industry, focusing on healthcare ventures and technology. Explores different business organizations, including sole proprietorships, partnerships, corporations, joint ventures and not-for-profit enterprises. Such explorations offer students an opportunity to identify and evaluate business skills and commitment necessary to successfully operate an entrepreneurial venture and address the challenges and rewards of entrepreneurship. Considers the requirements, costs, and benefits of various forms of financial options open to entrepreneurs. Presentations and discussions are led by accomplished entrepreneurs and practitioners engaged in healthcare teaching, research, and business. Case studies identify the challenges and rewards of successful entrepreneurial ventures that set positive examples for budding entrepreneurs in leading change and innovation.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "2350",
    "title": "Healthcare Systems",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12662" }],
    "description": "Examines the evolution of the American healthcare delivery system from the early forms of organized institutional healthcare through the dynamic, and increasingly integrated, delivery systems of the present. Explores the interactions of regulatory, economic, political, and social aspects of the healthcare system with particular emphasis on pharmacy practices. Compares current policies and proposals for health reform and pharmacy benefit coverage. Analyzes the impact and consequences of national and international actions in one era on the structure, function, and outcomes of healthcare and professional pharmacy practice in later years. Major emphases include factors affecting American population health, health disparities, and strategies, including pharmacy/pharmacists, to improve the nation’s health.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "2550",
    "title": "Innovation, Entrepreneurship, and Drug and Medical Device Development",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "17078" }],
    "description": "Introduces the process of innovation and entrepreneurship within drug and medical device development. Explores the perspectives of the pharmaceutical industry and medical device industry, as well as regulatory agencies, within the United States. Presents drug/device discovery, development, deployment, and life cycle as it pertains to business development and planning. Examines the roles of individuals in innovation and entrepreneurship across the industry.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "3450",
    "title": "Research Methodology and Biostatistics",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": ["ER", "ND"],
    "sections": [{ "term": "202330", "crn": "30989" }],
    "description": "Offers an interactive course covering aspects of research designs used in experimental and observational studies, hypothesis testing, and an introduction to basic biostatistics. Offers students an opportunity to critically examine selected articles from the clinical literature, to analyze the framing of the research question and the methods used to insure the validity and generalizability of the study's findings, and to assess for potential ethical issues in research design and conduct. Clinical trials, observational studies, and problem sets illustrate principles of research design, conduct, and data analysis."
  },
  {
    "subject": "PHMD",
    "number": "4350",
    "title": "Exploring Academic Careers",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11342" }],
    "description": "Designed to prepare students to become more confident and effective as educators for many audiences, including peers, colleagues, clients, and patients. Offers students an opportunity to increase their awareness of teaching and learning principles and related roles and responsibilities as they apply to academic careers and faculty in the classroom, in experiential settings, and in university units. Discusses and explores knowledge, skills, and attitudes that are applicable across professions.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "4585",
    "title": "Research Methods in Health Systems",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "15328" }],
    "description": "Exposes students to research skills and methods used by health system pharmacists when planning and conducting research. Builds on content from prior courses. Designed for students planning to pursue a career in a health system or the pharmaceutical industry. Focuses on discussion and application; taught by healthcare-system-based pharmacists actively involved in clinical research. Emphasizes the process used to generate robust research questions and research plans throughout. Uses practice statements/guidelines, published studies, patient databases, and faculty's current research projects to illustrate course topics.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHMD", "number": "3450" },
      "Or",
      { "subject": "PHMD", "number": "3450" }
    ]
  },
  {
    "subject": "PHMD",
    "number": "4611",
    "title": "Comprehensive Disease Management 1",
    "scheduleType": "Lecture",
    "credits": 6,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "31725" }],
    "description": "Covers foundational concepts of pharmacy practice, including patient evaluation; identification of drug-related problems; pathophysiology; and clinical management of diseases of the respiratory, cardiovascular, and endocrine systems. Specifically covers asthma and COPD, hypertension, hyperlipidemia, diabetes, fluids/electrolytes, and renal disorders. Reviews, system-by-system, the mechanisms of these diseases and their evidence-based prevention and treatment strategies. Offers students an opportunity to apply scientific knowledge and principles of medicinal chemistry, pharmacology, pharmaceutics, and pharmacokinetics to the design of rational, evidence-based therapeutic strategies to provide care to patients in inpatient, ambulatory, and community settings. Emphasizes pathophysiology, self-care, patient education, assessment, medication administration, management, monitoring, and preventative health and population-based health outcomes."
  },
  {
    "subject": "PHMD",
    "number": "4612",
    "title": "Comprehensive Disease Management 1 Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "31726" },
      { "term": "202330", "crn": "31729" },
      { "term": "202330", "crn": "31730" },
      { "term": "202330", "crn": "31731" },
      { "term": "202330", "crn": "31732" },
      { "term": "202330", "crn": "31733" },
      { "term": "202330", "crn": "31734" }
    ],
    "description": "Designed to provide students with opportunities to apply concepts from PHMD 4611 to patient cases, special projects, and other medication-related issues focusing on foundational aspects of pharmacy practice, identification of drug-related problems, and diseases of the respiratory, endocrine, cardiovascular, and renal systems. Accompanies PHMD 4611 and seeks to facilitate accomplishment of course objectives using an active learning format. While completing seminar work, students are expected to review, discuss, integrate, and apply information presented in comprehensive disease management lectures and readings as well as previous and concurrent course work."
  },
  {
    "subject": "PHMD",
    "number": "4631",
    "title": "Comprehensive Disease Management 3",
    "scheduleType": "Lecture",
    "credits": 6,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11960" }],
    "description": "Covers the pathophysiology and clinical management of infectious diseases, solid organ transplant, dermatology, and otic/ophthalmic disorders. Reinforces foundational concepts of pharmacy practice and diseases covered in PHMD 4611 and PHMD 4612, while completing a system-by-system review of the mechanisms of infectious diseases and their evidence-based prevention and treatment strategies. Offers students an opportunity to design rational therapeutic strategies to provide care to patients with these disease states in inpatient, ambulatory, and community settings. Emphasizes pathophysiology, self-care, patient education, assessment, medication administration, management, monitoring, and preventative health and population-based health outcomes.",
    "coreqs": [
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4633" }
    ],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "4632",
    "title": "Comprehensive Disease Management 3 Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11966" },
      { "term": "202310", "crn": "11967" },
      { "term": "202310", "crn": "11968" },
      { "term": "202310", "crn": "11970" },
      { "term": "202310", "crn": "11971" },
      { "term": "202310", "crn": "11972" },
      { "term": "202310", "crn": "13160" }
    ],
    "description": "Designed to provide students with opportunities to apply concepts from PHMD 4631 to patient cases, special projects, and other medication-related issues focusing on foundational aspects of pharmacy practice, identification of drug-related problems, and management of the infectious diseases and dermatologic and oral/otic disorders. Accompanies PHMD 4631 and seeks to facilitate accomplishment of course objectives using an active-learning format. While completing seminar work, students are expected to review, discuss, integrate, and apply information presented in comprehensive disease management lectures and readings as well as previous and concurrent course work. Activities in seminar are reinforced by laboratory skill-building exercises in PHMD 4633.",
    "coreqs": [
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4633" }
    ],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "4633",
    "title": "Comprehensive Disease Management 3 Skills Lab",
    "scheduleType": "Lab",
    "credits": 0.5,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12028" },
      { "term": "202310", "crn": "12029" },
      { "term": "202310", "crn": "12030" },
      { "term": "202310", "crn": "15252" },
      { "term": "202310", "crn": "19323" }
    ],
    "description": "Teaches and assesses various skills, including interpretation, processing, and verification of medication orders; detection and resolution of drug-related problems; use of current pharmacy software programs; and patient education and counseling in the community pharmacy setting. Uses discussions, videos, podcasts, simulations, and hands-on learning activities in the lab. While completing laboratory work, students are expected to review, discuss, integrate, and apply information presented in the closely aligned PHMD 4631 and PHMD 4632 as well as previous and concurrent course work.",
    "coreqs": [
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" },
      { "subject": "PHMD", "number": "4631" },
      { "subject": "PHMD", "number": "4632" }
    ],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "4641",
    "title": "Comprehensive Disease Management 4",
    "scheduleType": "Lecture",
    "credits": 6,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "31791" }],
    "description": "Covers the pathophysiology and clinical management of men's and women's health issues and neurological, psychiatric, and oncologic disorders. Reinforces foundational concepts of pharmacy practice and diseases covered in PHMD 4611, PHMD 4612, and PHMD 4613, while completing a system-by-system review of the mechanisms of infectious diseases and their evidence-based prevention and treatment strategies. Offers students an opportunity to design rational therapeutic strategies to provide care to patients with these disease states in inpatient, ambulatory, and community settings. Emphasizes pathophysiology, self-care, patient education, assessment, medication administration, management, monitoring, and preventative health and population-based health outcomes."
  },
  {
    "subject": "PHMD",
    "number": "4642",
    "title": "Comprehensive Disease Management 4 Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "31792" },
      { "term": "202330", "crn": "31793" },
      { "term": "202330", "crn": "31796" },
      { "term": "202330", "crn": "31797" },
      { "term": "202330", "crn": "31798" },
      { "term": "202330", "crn": "31799" }
    ],
    "description": "Designed to provide students with opportunities to apply concepts from PHMD 4641 to patient cases, special projects, and other medication-related issues focusing on foundational aspects of pharmacy practice, identification of drug-related problems, and management of women's and men's disease, psychological disorders, and cancers. Accompanies PHMD 4641 and seeks to facilitate accomplishment of course objectives using an active-learning format. While completing seminar work, students are expected to review, discuss, integrate, and apply information presented in comprehensive disease management lectures and readings as well as previous and concurrent course work. Activities in seminar are reinforced by laboratory skill-building exercises in PHMD 4643."
  },
  {
    "subject": "PHMD",
    "number": "4643",
    "title": "Comprehensive Disease Management 4 Skills Lab",
    "scheduleType": "Seminar",
    "credits": 0.5,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "31800" },
      { "term": "202330", "crn": "31801" },
      { "term": "202330", "crn": "31802" },
      { "term": "202330", "crn": "34710" }
    ],
    "description": "Teaches and assesses various skills, including interpretation, processing, and verification of medication orders; detection and resolution of drug-related problems; use of current pharmacy software programs; medication reconciliation; presentation of hospitalized patients; and management of sterile compounding systems in the hospital pharmacy setting. Uses discussions, videos, podcasts, simulations, and hands-on learning activities in the lab. While completing laboratory work, students are expected to review, discuss, integrate, and apply information presented in the closely aligned PHMD 4641 and PHMD 4642 as well as previous and concurrent course work."
  },
  {
    "subject": "PHMD",
    "number": "4890",
    "title": "Contemporary Issues in Geriatric Pharmacy",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12926" }],
    "description": "Focuses on the physiological and practical aspects of medication use in the elderly; healthcare delivery systems; the role of healthcare professionals in providing geriatric care; and the management of geriatric syndromes. Caring for the aging population requires a patient-centered approach that encompasses the patient’s health goals, a complex psychosocial landscape, as well as the physiologic changes associated with aging. It is imperative for healthcare professionals to understand the interplay of these factors in order to appropriately assess, treat, and improve outcomes for the older adult population. Offers students an opportunity to utilize problem-based learning (PBL), where students work in groups to analyze patient cases, identify problems, and develop action plans to resolve problems.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "5223",
    "title": "Evidence-Based Medicine",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": ["WI"],
    "sections": [{ "term": "202330", "crn": "35804" }],
    "description": "Studies the principles of evidence-based medicine and how to apply them to patient-centered care. Offers students an opportunity to develop skills in critical appraisal of the scientific literature and practical application of the evidence to clinical decision making. Consists of didactic instruction, in-class group projects, and a group-based written assignment. Applies principles of research methodology, biostatistics, and professional writing."
  },
  {
    "subject": "PHMD",
    "number": "5270",
    "title": "Economic Evaluation of Pharmaceuticals and Pharmacy Practice",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "32504" },
      { "term": "202330", "crn": "38454" }
    ],
    "description": "Introduces the principles of economic theory of healthcare markets and economic evaluation of health products and services. Economic theory topics include fundamentals of supply and demand, market structure, market failure, and the role of government. Economic evaluation topics include measuring costs and benefits of a specific treatment, types of formal decision analysis, ethical considerations, and implementation in the real world. Restricted to students with fifth-year PharmD standing."
  },
  {
    "subject": "PHMD",
    "number": "5450",
    "title": "Advanced Pharmacy Practice Experience Preparatory Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "36489" }],
    "description": "Offers students an opportunity to collect relevant information to make informed decisions concerning the selection of advanced pharmacy practice experiences (APPEs). Designed to provide new knowledge (e.g., what is expected of a P4 student) and to strengthen existing knowledge (e.g., from didactic courses) to offer a smooth transition from the didactic courses to APPEs."
  },
  {
    "subject": "PHMD",
    "number": "5560",
    "title": "Applied Drug Information",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": ["WI"],
    "sections": [
      { "term": "202310", "crn": "15247" },
      { "term": "202310", "crn": "16996" },
      { "term": "202310", "crn": "16997" },
      { "term": "202310", "crn": "18151" }
    ],
    "description": "Offers students an opportunity to obtain the skills necessary to become effective providers of drug information. An effective provider assesses drug information needs and evaluates, applies, and communicates data from the published literature and other sources to optimize patient care. Designed to help students develop applied drug information skills important to the pharmacist in areas of formulary support, health informatics, medication error and adverse event reporting, and quality assurance. Students complete a variety of active learning exercises, including multiple evidence-based written drug information responses and a current events analysis. Emphasizes writing for a variety of audiences, including pharmacists, other healthcare providers, and the lay public, as well as use of peer review.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")",
      { "subject": "PHMD", "number": "3450" },
      "And",
      "(",
      { "subject": "ENGW", "number": "3306" },
      "Or",
      "Graduate Admission",
      ")"
    ]
  },
  {
    "subject": "PHMD",
    "number": "5600",
    "title": "Pharmacy Capstone",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [
      { "term": "202310", "crn": "15735" },
      { "term": "202310", "crn": "13322" },
      { "term": "202310", "crn": "12889" },
      { "term": "202310", "crn": "13354" },
      { "term": "202310", "crn": "14386" },
      { "term": "202310", "crn": "17574" },
      { "term": "202310", "crn": "17575" },
      { "term": "202310", "crn": "17642" },
      { "term": "202310", "crn": "18140" },
      { "term": "202310", "crn": "18153" },
      { "term": "202310", "crn": "18154" },
      { "term": "202310", "crn": "18155" },
      { "term": "202310", "crn": "18156" },
      { "term": "202310", "crn": "18918" },
      { "term": "202310", "crn": "20245" },
      { "term": "202310", "crn": "20398" },
      { "term": "202330", "crn": "32880" },
      { "term": "202330", "crn": "33361" },
      { "term": "202330", "crn": "33559" },
      { "term": "202330", "crn": "32644" },
      { "term": "202330", "crn": "32922" },
      { "term": "202330", "crn": "33883" },
      { "term": "202330", "crn": "33884" },
      { "term": "202330", "crn": "36995" },
      { "term": "202330", "crn": "37002" },
      { "term": "202330", "crn": "37036" },
      { "term": "202310", "crn": "21282" },
      { "term": "202310", "crn": "21271" },
      { "term": "202310", "crn": "21272" },
      { "term": "202310", "crn": "21279" }
    ],
    "description": "Acts as a final integrator of the major, general education, and experiential aspects of the student's education. Expects students to demonstrate motivation and initiative and to work cooperatively with their faculty mentor, community partners, and fellow students (where applicable) in order to complete a comprehensive, high-quality scholarly work (e.g., a research project, educational project, administrative project, business plan, case report, or community-service learning project or professional manuscript) appropriate for dissemination to the university and professional community. The timeline for completion is set by the faculty mentor and agreed to by the individual or all members of the student group. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6440",
    "title": "Internal Medicine Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10661" },
      { "term": "202310", "crn": "10995" },
      { "term": "202330", "crn": "30638" },
      { "term": "202330", "crn": "30857" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in the hospital setting. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6441",
    "title": "Acute Care Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10660" },
      { "term": "202310", "crn": "13599" },
      { "term": "202330", "crn": "30637" },
      { "term": "202330", "crn": "33295" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6442",
    "title": "Ambulatory Care Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10659" },
      { "term": "202310", "crn": "10996" },
      { "term": "202330", "crn": "30636" },
      { "term": "202330", "crn": "30858" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in an ambulatory clinic environment. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6443",
    "title": "Community Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10658" },
      { "term": "202310", "crn": "10997" },
      { "term": "202330", "crn": "30635" },
      { "term": "202330", "crn": "30859" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a community setting. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6444",
    "title": "Internal Medicine Elective Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20385" },
      { "term": "202330", "crn": "35270" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in the hospital setting. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6446",
    "title": "Psychiatry Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14219" },
      { "term": "202310", "crn": "13600" },
      { "term": "202330", "crn": "33296" },
      { "term": "202330", "crn": "35565" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients under psychiatric care. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6447",
    "title": "Community Elective Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10657" },
      { "term": "202310", "crn": "13711" },
      { "term": "202330", "crn": "30634" },
      { "term": "202330", "crn": "33297" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a community setting. In collaboration with other members of the healthcare team, and under the supervision of a clinical preceptor, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6449",
    "title": "Geriatrics Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10825" },
      { "term": "202310", "crn": "13601" },
      { "term": "202330", "crn": "30652" },
      { "term": "202330", "crn": "33298" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a geriatric practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6450",
    "title": "Pediatrics Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10656" },
      { "term": "202310", "crn": "13602" },
      { "term": "202330", "crn": "30651" },
      { "term": "202330", "crn": "33299" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a pediatric practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6451",
    "title": "Neonatology Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13603" },
      { "term": "202310", "crn": "17370" },
      { "term": "202330", "crn": "30650" },
      { "term": "202330", "crn": "33748" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a neonatal practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6452",
    "title": "Critical Care Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13604" },
      { "term": "202310", "crn": "15264" },
      { "term": "202330", "crn": "30649" },
      { "term": "202330", "crn": "33300" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a critical-care practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6453",
    "title": "Surgery Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10654" },
      { "term": "202330", "crn": "30648" },
      { "term": "202330", "crn": "33749" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a surgical practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6454",
    "title": "Cardiology Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10653" },
      { "term": "202310", "crn": "13605" },
      { "term": "202330", "crn": "30647" },
      { "term": "202330", "crn": "33301" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a cardiology practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6456",
    "title": "Drug Information Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14217" },
      { "term": "202310", "crn": "20454" },
      { "term": "202330", "crn": "30646" }
    ],
    "description": "Applies drug information skills to site-specific drug information requests under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the site team. Using appropriate sources, the student analyzes drug information findings, such as dosing, monitoring, indications, efficacy, and adverse drug reactions. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6457",
    "title": "Oncology Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10792" },
      { "term": "202310", "crn": "13606" },
      { "term": "202330", "crn": "30645" },
      { "term": "202330", "crn": "33303" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in an oncology practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6461",
    "title": "Infectious Disease Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10651" },
      { "term": "202310", "crn": "13607" },
      { "term": "202330", "crn": "32952" },
      { "term": "202330", "crn": "33305" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients on an infectious disease consult service. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6462",
    "title": "Pharmacy Industry Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10824" },
      { "term": "202310", "crn": "14218" },
      { "term": "202330", "crn": "30644" },
      { "term": "202330", "crn": "33306" }
    ],
    "description": "Focuses on the application of regulatory affairs and healthcare principles in the pharmaceutical industry. Under the supervision of a preceptor, and, when appropriate, in conjunction with other members of the site team, participates in appropriate activities, such as drug research and development, marketing, medical affairs, regulatory affairs, and information service. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6463",
    "title": "Pharmacy Administration Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10650" }],
    "description": "Applies healthcare and management principles, with emphasis on pharmacy administration, under the supervision of a preceptor, and, when appropriate, in conjunction with other members of the site team. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6464",
    "title": "Regulatory Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "33308" }],
    "description": "Participates in appropriate activities including but not limited to principles of and compliance with pharmacy law and review of regulations governing the FDA's mandatory reporting of adverse drug reactions under the supervision of a preceptor, and, when appropriate, in conjunction with other members of the site team. In addition, students may have the opportunity to be given a step-by-step introduction to public record laws, Board Regulations at 247 CMR, and pharmacy statutes at Massachusetts General Laws, Chapter 112, 24(A)&#8211;42(A). May be repeated without limit."
  },
  {
    "subject": "PHMD",
    "number": "6465",
    "title": "Managed Care Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13609" },
      { "term": "202310", "crn": "17364" },
      { "term": "202330", "crn": "33750" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a managed-care practice setting. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6466",
    "title": "Transplantation Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10823" },
      { "term": "202310", "crn": "13610" },
      { "term": "202330", "crn": "30643" },
      { "term": "202330", "crn": "33309" }
    ],
    "description": "Applies principles of pathophysiology, therapeutics, and communication to the pharmacy-care management of individual patients in a transplantation unit. Under the supervision of a clinical preceptor, and, when appropriate, in conjunction with other members of the healthcare team, offers identification of appropriate drug therapy and monitoring requirements for common pathophysiologic processes, and, when indicated, modification of population-based treatment strategies based on the unique characteristics of individual patients. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6467",
    "title": "Directed Practice Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10791" },
      { "term": "202310", "crn": "13611" },
      { "term": "202330", "crn": "30642" },
      { "term": "202330", "crn": "33310" }
    ],
    "description": "Offers nontraditional experience with an approved preceptor at an appropriate site. Based on availability. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6470",
    "title": "Education Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10989" },
      { "term": "202310", "crn": "13612" },
      { "term": "202310", "crn": "17360" },
      { "term": "202310", "crn": "17361" },
      { "term": "202330", "crn": "30860" },
      { "term": "202330", "crn": "33453" },
      { "term": "202330", "crn": "35805" }
    ],
    "description": "Offers students an opportunity to teach in the pharmacy curriculum under the supervision of a faculty member. Students have an opportunity to examine how teachers use experience-based and problem-based approaches to engage the range of student learners (third- through fifth-year pharmacy students) to attain their learning goals. May be repeated up to two times.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6471",
    "title": "Research 1 Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13613" },
      { "term": "202310", "crn": "17367" },
      { "term": "202310", "crn": "20392" },
      { "term": "202330", "crn": "33454" },
      { "term": "202330", "crn": "33455" },
      { "term": "202330", "crn": "35806" }
    ],
    "description": "Offers students interested in gaining basic or clinical research experience an opportunity to work under the direction of an experienced researcher at an appropriate site. Students can elect either a basic science (lab-based) preceptor or a clinical (patient-based) preceptor. Students can expect to be an active participant in a variety of different research activities and experiences that are deemed appropriate by the preceptor. The research efforts of the student may result in a peer-reviewed research abstract and/or presentation. May be repeated up to two times.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHMD",
    "number": "6473",
    "title": "Radiopharmacy Advanced Pharmacy Practice Experience",
    "scheduleType": "Off-campus instruction",
    "credits": 6,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "33311" }],
    "description": "Offers students an opportunity to examine the application of radiopharmaceuticals in medical imaging methods. Includes but is not limited to computed tomography (CT), magnetic resonance imaging (MRI), positron emission tomography (PET), and single-photon tomography (SPECT). Students completing this course may cover aspects of product preparation, administration, and data interpretation. May be repeated up to two times."
  }
]
