[
  {
    "subject": "PHSC",
    "number": "1001",
    "title": "Introduction to Contemporary Pharmaceutical Sciences",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17231" },
      { "term": "202310", "crn": "17740" },
      { "term": "202310", "crn": "20507" }
    ],
    "description": "Introduces multiple aspects of the contemporary pharmaceutical sciences. Explores how these disciplines are used to solve real-world medical problems. Offers students an opportunity to learn about foundational concepts in pharmacology; drug development and translational medicine; and the nexus of biotechnology, engineering, industry, entrepreneurship, and the career landscape for scientists. Discussion-based classes that introduce fundamental concepts are followed by student-driven classes that explore the real-world application and societal context of the material. Seeks to help students interested in pharmaceutical sciences to identify and interact with like-minded students and faculty researchers.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2100",
    "title": "Lab Research Rotation",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13675" }],
    "description": "Offers students an opportunity to conduct laboratory research under the direct supervision of a laboratory mentor, generally a faculty member or laboratory director, gain experience in research techniques, and develop good laboratory practices as they learn about research topics under investigation in the laboratory of their choice. Students attend seminars, departmental events, and other activities relevant to the mentor&rsquo;s laboratory. The time commitment is at least eight hours a week. Mentor expectations and grading criteria are decided upon between the student and the mentor prior to the start of the rotation and must be approved by the course director. Students prepare a presentation that encompasses the research performed by the student that includes description, experimental design, data generated, data interpretation, and discussion of their research project.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2301",
    "title": "Human Physiology 1",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10380" }],
    "description": "Provides students with an understanding of the principles of physiology. Discusses physiological information mostly related to cardiovascular, respiratory, digestive, urinary, and endocrine systems. Focuses on the physiological mechanisms of the major organ systems. Physiological information is related to the specific areas of pharmacology.",
    "coreqs": [{ "subject": "PHSC", "number": "2302" }],
    "prereqs": [{ "subject": "BIOL", "number": "1113" }]
  },
  {
    "subject": "PHSC",
    "number": "2302",
    "title": "Human Anatomy Lab",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10379" },
      { "term": "202310", "crn": "10378" },
      { "term": "202310", "crn": "10359" },
      { "term": "202310", "crn": "10536" }
    ],
    "description": "Accompanies PHSC 2301. Focuses on the anatomy of the major organ systems. Digital images allow each student to study the structure of each organ system in-depth.",
    "coreqs": [{ "subject": "PHSC", "number": "2301" }],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2320",
    "title": "Biochemistry",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10481" }],
    "description": "Introduces the structures, functions, and metabolism of amino acids, proteins, carbohydrates, lipids, and nucleic acids. Discusses the mechanisms of enzyme reactions, enzyme kinetics, vitamins, biological oxidation-reduction reactions, and bioenergetics, as well as various inborn errors of metabolism.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "PHSC", "number": "2301" },
      "Or",
      { "subject": "BIOL", "number": "2217" },
      "Or",
      { "subject": "BIOL", "number": "1117" },
      ")",
      "And",
      "(",
      { "subject": "BIOL", "number": "1113" },
      "Or",
      { "subject": "BIOL", "number": "1103" },
      ")",
      "And"
    ]
  },
  {
    "subject": "PHSC",
    "number": "2400",
    "title": "Research Ethics for Beginning Health Scientists",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER"],
    "sections": [{ "term": "202310", "crn": "15152" }],
    "description": "Explores various dimensions of ethical research. Introduces ethical foundations and controversies that are central to understanding and developing appropriate ethical frameworks for engaging in research. Requires students to work collaboratively to carefully develop essential skills for ethical analysis and evaluation of professional code of conduct concerns.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "3411",
    "title": "Pharmaceutics 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10482" }],
    "description": "Develops an understanding of pharmaceutical dosage forms, with emphasis on solids, liquids, semisolids, parenterals, inhalation, and novel drug delivery systems. Combines the discussion of pharmaceutical products developed in industry and those compounded in local pharmacies. Focuses on application of mathematical principles and problem-solving skills in pharmaceutical compounding.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "4501",
    "title": "Pharmacology/Medicinal Chemistry 1",
    "scheduleType": "Lecture",
    "credits": 5,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10358" }],
    "description": "Introduces the principles and basic concepts of pharmacology and the general mechanisms of drug action including drug receptor interactions. Discusses the major drug classes affecting the peripheral autonomic and central nervous systems including anxiolytics, sedative-hypnotics, anesthetics, anticonvulsants, neuroleptics, antidepressants, and antimanic agents. Considers therapeutic uses, mechanisms of drug action, and undesirable actions including side effects and adverse reactions.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "4991",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": ["EX"],
    "sections": [{ "term": "202310", "crn": "15394" }],
    "description": "Extends current knowledge or offers novel insights through faculty-directed and supervised individual undergraduate research or creative projects. The project must be designed in concert with and obtain formal prior approval from relevant faculty and program director. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5100",
    "title": "Concepts in Pharmaceutical Science",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10730" }],
    "description": "Introduces new students in the Pharmaceutical Science Graduate Program to important concepts in medicinal and combinatorial chemistry as they relate to drug discovery, and a brief overview of pharmacology, drug metabolism, pharmacokinetics, and toxicology. Also introduces the major drug receptor families and their signaling pathways.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5102",
    "title": "Concepts in Pharmaceutical Science 2",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13638" }],
    "description": "Presents key concepts and challenges of drug design, development, and evaluation. Integrates the principles of drug design, development, and delivery in a discussion of both small-molecule formulations and biologics. Contextualizes the hallmarks along the path of preclinical drug design to clinical translation. Components of the course include Team-Based Learning (TBL) and professionalism. The TBL sessions offer students an opportunity to work on course-related team applications and include graded peer evaluations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5212",
    "title": "Research Skills and Ethics",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14220" }],
    "description": "Teaches students the basics of laboratory safety, safekeeping laboratory data, and the process of writing a grant proposal. Also, case studies explore the concepts of data distortion or fabrication, conflicts of interest, confidentiality, ethical aspects of peer review, and the attribution of credit in science.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5305",
    "title": "Professional Development for Pharmaceutical Sciences",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12044" }],
    "description": "Introduces and examines the goals, expectations, policies, and procedures of the Masters&amp;#8217; in Pharmaceutical Sciences internship program and professionalism in the field. Discusses the role and involvement of internship employers. Offers students an opportunity to develop job search and career management skills; assess their workplace skills, interests, and values; discuss how those qualities impact career decisions; prepare a professional resum&amp;#233;; and learn proper interviewing techniques. Issues of ethics and professionalism are designed to inform students of issues they will face in the pharmaceutical field. Content of this course is geared to students&amp;#8217; participation in the internship program and overall professional development in pharmaceutical sciences.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5400",
    "title": "Principles of Drug Design",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12691" }],
    "description": "Studies important aspects of drug discovery and development with a focus on drug design. Covers basic organic medicinal chemistry concepts and seeks to build students&amp;#8217; skills in lead compound discovery, structure-activity relationship studies, and lead optimization strategies. Topics include the fundamentals of pharmacology, pharmacokinetics, and pharmacodynamics of therapeutic agents relevant to the drug-structure optimization. These skills often help develop a strong foundation in the concepts that govern the multidisciplinary process of drug discovery. Uses lectures and peer-reviewed seminar presentations to help students to incrementally increase their knowledge required to identify new, marketable therapeutic agents. Requires organic or medicinal chemistry at the undergraduate level.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5555",
    "title": "Pharmaceutical Toxicology",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12659" }],
    "description": "Covers fundamental concepts of toxicology and technical methods in toxicology along with comprehensive analysis of both in-vitro and in-vivo toxicity in drug discovery and development. Through lectures given by experts in various fields in toxicology on several topics required for specialized work in research, industrial, and clinical settings, offers students an opportunity to become familiar with methods and analyses including in-vitro and in-vivo toxicity assessments and toxicokinetic-toxicodynamic models and analyses. Includes mechanistic basis of toxicity, methods of toxicological analysis, and case studies pertinent to topics. Requires undergraduate physiology or biochemistry.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5560",
    "title": "Nanotoxicity",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14261" }],
    "description": "Studies nanotoxicity, the adverse health effects of nanoparticles. Due to their small size, nanoparticles easily cross biological barriers, entering body fluids and cells. Nanoparticles toxicity may cause chronic and acute pathologies. Offers students an opportunity to develop and understand the principles of nanotoxicity. Focuses on mechanisms of cellular and organ damage by nanoparticles. Discusses ports of nanoparticle entry and detrimental effects upon blood, CNS, lungs, and GI system. Stresses mechanisms of intracellular degradation of nanoparticles and toxic effects of nanoparticles upon human cells and major organ systems. Reviews mechanisms of cellular and organ damage including oxidative stress, inflammation, and DNA, as well as toxic effects on nonmammalian cells.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5619",
    "title": "Mass Spectrometry in Drug Development",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "16463" }],
    "description": "Offers students an opportunity to obtain a fundamental understanding of modern mass spectrometers, to conceptually operate these instruments, and the ability to prepare biological samples. Undoubtedly the most popular analytical method in science, mass spectrometry is utilized in fields ranging from subatomic physics to biology. Focuses on the analysis of proteins, with applications including biomarker discovery, tissue characterization, detection of blood doping, drug discovery, and the characterization of protein-based therapeutics. By the end of the course, the student is expected to be able to solve a particular chemistry- or biology-related problem by choosing the appropriate sample preparation methods and mass spectrometer.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5976",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13671" }],
    "description": "Offers independent work under the direction of members of the department on a chosen topic. Course content depends on instructor. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6216",
    "title": "Human Physiology and Pathophysiology",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10729" }],
    "description": "Introduces major topics in human physiology, emphasizing knowledge essential to health-related laboratory research. Topics include neurophysiology, immunology, cardiovascular, respiratory, renal, and gastrointestinal physiology and endocrinology.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6222",
    "title": "The Chemistry and Biology of Drugs of Abuse",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14204" }],
    "description": "Provides an interdisciplinary introduction to substance abuse, including the medicinal chemistry and neurobiology of drugs that act through the opioid, dopamine, acetylcholine, and cannabinoid systems.  Compares and contrasts neurochemical mechanisms that are common to many addictive agents and those that are specific to individual drug classes.  Highlights the involvement of the brain dopamine system and differences and discusses similarities between the pharmacology of abused and therapeutic drugs, together with the development of medications for treating drug dependence.  Includes lectures by experts on particular topics of their own recent research.  Introduces students to key aspects of biological and chemical research as they pertain to drug abuse and its treatment.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6235",
    "title": "Magnetic Resonance Imaging in Drug Discovery 1",
    "scheduleType": "Lab",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14174" }],
    "description": "Integrates physics, mathematics, and neuroscience with the cutting-edge technology of magnetic resonance imaging (MRI) to address drug discovery in the treatment of CNS disorders. Students design their own experiments guided by knowledge of the literature and technical and statistical limitations. Offers students an opportunity to run a state-of-the-art 7.0 Tesla MR animal scanner housed in the Center for Translational NeuroImaging (CTNI) at Northeastern and set parameters for anatomical and functional imaging protocols. Original imaging data is collected and analyzed. This is a discovery-based research course that encourages critical thinking and transdisciplinary learning skills involving an original research project in magnetic resonance imaging related to early drug discovery.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "5100" },
      "Or",
      { "subject": "PHSC", "number": "5100" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "6300",
    "title": "Pharmaceutical Science Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10728" },
      { "term": "202310", "crn": "10636" },
      { "term": "202310", "crn": "11239" }
    ],
    "description": "Teaches students to evaluate critically the scientific literature in a journal club format. Several sections may be offered each semester to accommodate different specializations or interest groups. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6401",
    "title": "Pharmaceutical Science Internship",
    "scheduleType": "Off-campus instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10583" },
      { "term": "202260", "crn": "60163" },
      { "term": "202240", "crn": "40130" }
    ],
    "description": "Offers an experiential component of the graduate curriculum that fosters professional development through internship in drug discovery, development, and/or regulatory affairs in a pharmaceutical or biotechnology company. Requires students to work in a company for a minimum of twenty hours per week. Offers students an opportunity to engage in pharmaceutical science research or to work in an environment outside the University but under the supervision of a faculty instructor. May be repeated up to three times.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6760",
    "title": "Doctoral Pharmaceutical Science Research 1",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20237" }],
    "description": "Offers PhD research in preparation for thesis proposal.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6810",
    "title": "Pharmaceutical Science Colloquium",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13684" }],
    "description": "Requires students to present one formal seminar on their research. This presentation is open to all those interested.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6990",
    "title": "Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15408" },
      { "term": "202310", "crn": "18148" },
      { "term": "202310", "crn": "18571" },
      { "term": "202310", "crn": "21047" }
    ],
    "description": "Offers research/experimental work for master&amp;#8217;s thesis. Students may register twice. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6996",
    "title": "Thesis Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "18574" }],
    "description": "Offers continued registration while student completes master&amp;#8217;s thesis or other research project to meet the research requirement in pharmaceutical science.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "7010",
    "title": "Pharmaceutical Sciences Laboratory",
    "scheduleType": "Lab",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11172" }],
    "description": "Offers a hands-on graduate laboratory course that introduces students to the investigative approaches and laboratory methods used in contemporary pharmaceutical sciences research. Laboratory exercises have a practical relationship to essential techniques in modern drug discovery, drug targeting and delivery, and determining mechanisms of drug action. These exercises cover basic laboratory skills, the rationale for and application of standard laboratory methods, training in the use of equipment and techniques central to pharmaceutical sciences research, how to maintain a laboratory notebook, statistical analysis and interpretation of data, and how to present research results in technical laboratory reports.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "8940",
    "title": "Doctoral Training and Research",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11079" }],
    "description": "Intended to show full-time status for pharmaceutical science PhD students in the semester in which they are taking the comprehensive exam. In addition to successfully completing the comprehensive exam, students are expected to perform research in preparation for the doctoral proposal; the grade for this course documents successful performance.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "8986",
    "title": "Doctoral Full-Time Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10667" }],
    "description": "Expects student to conduct full-time research in an adviser&amp;#8217;s laboratory. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "9681",
    "title": "Doctoral Proposal",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11031" }],
    "description": "Offers preparation of PhD dissertation proposal and proposal defense before dissertation committee. Requires passing of comprehensive exam. May be repeated without limit.",
    "coreqs": [],
    "prereqs": [{ "subject": "PHSC", "number": "8940" }]
  },
  {
    "subject": "PHSC",
    "number": "9990",
    "title": "Dissertation Term 1",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10725" }],
    "description": "Offers research/experimental work for PhD thesis.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "9991",
    "title": "Dissertation Term 2",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14959" }],
    "description": "Offers dissertation supervision by members of the department.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "9996",
    "title": "Dissertation Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10724" }],
    "description": "Offers continuation of PhD dissertation research.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "9991" },
      "Or",
      "Dissertation Check"
    ]
  }
]
