[
  {
    "subject": "PHSC",
    "number": "1001",
    "title": "Introduction to Contemporary Pharmaceutical Sciences",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17231" },
      { "term": "202310", "crn": "17740" },
      { "term": "202310", "crn": "20507" }
    ],
    "description": "Introduces multiple aspects of the contemporary pharmaceutical sciences. Explores how these disciplines are used to solve real-world medical problems. Offers students an opportunity to learn about foundational concepts in pharmacology; drug development and translational medicine; and the nexus of biotechnology, engineering, industry, entrepreneurship, and the career landscape for scientists. Discussion-based classes that introduce fundamental concepts are followed by student-driven classes that explore the real-world application and societal context of the material. Seeks to help students interested in pharmaceutical sciences to identify and interact with like-minded students and faculty researchers.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2000",
    "title": "Professional Development for Pharmaceutical Sciences Co-op",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38362" }],
    "description": "Introduces students to the pharmaceutical sciences cooperative education program and professionalism in the field. Students assess their workplace skills, interests, and values and discuss how these impact personal career decisions. Offers students an opportunity to develop effective job search and career management skills, prepare a professional resumé, learn proper interviewing techniques, develop a strong online professional profile, and learn how to use the Northeastern job database and referral process.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2100",
    "title": "Lab Research Rotation",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13675" }],
    "description": "Offers students an opportunity to conduct laboratory research under the direct supervision of a laboratory mentor, generally a faculty member or laboratory director, gain experience in research techniques, and develop good laboratory practices as they learn about research topics under investigation in the laboratory of their choice. Students attend seminars, departmental events, and other activities relevant to the mentor’s laboratory. The time commitment is at least eight hours a week. Mentor expectations and grading criteria are decided upon between the student and the mentor prior to the start of the rotation and must be approved by the course director. Students prepare a presentation that encompasses the research performed by the student that includes description, experimental design, data generated, data interpretation, and discussion of their research project.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2301",
    "title": "Human Physiology 1",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10380" }],
    "description": "Provides students with an understanding of the principles of physiology. Discusses physiological information mostly related to cardiovascular, respiratory, digestive, urinary, and endocrine systems. Focuses on the physiological mechanisms of the major organ systems. Physiological information is related to the specific areas of pharmacology.",
    "coreqs": [{ "subject": "PHSC", "number": "2302" }],
    "prereqs": [{ "subject": "BIOL", "number": "1113" }]
  },
  {
    "subject": "PHSC",
    "number": "2302",
    "title": "Human Anatomy Lab",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10379" },
      { "term": "202310", "crn": "10378" },
      { "term": "202310", "crn": "10359" },
      { "term": "202310", "crn": "10536" }
    ],
    "description": "Accompanies PHSC 2301. Focuses on the anatomy of the major organ systems. Digital images allow each student to study the structure of each organ system in-depth.",
    "coreqs": [{ "subject": "PHSC", "number": "2301" }],
    "prereqs": [{ "subject": "BIOL", "number": "1113" }]
  },
  {
    "subject": "PHSC",
    "number": "2303",
    "title": "Human Physiology 2",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38363" }],
    "description": "Continues PHSC 2301. Provides students with an understanding of the principles of physiology. Discusses physiological information mostly related to cell physiology, muscle physiology, and physiology of the nervous system. Focuses on the physiological mechanisms of the major organ systems. Physiological information is related to the specific areas of pharmacology.",
    "coreqs": [{ "subject": "PHSC", "number": "2304" }],
    "prereqs": [
      { "subject": "PHSC", "number": "2301" },
      "And",
      { "subject": "PHSC", "number": "2302" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "2304",
    "title": "Human Physiology Lab",
    "scheduleType": "Lab",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "30298" },
      { "term": "202330", "crn": "30297" },
      { "term": "202330", "crn": "30032" },
      { "term": "202330", "crn": "30039" }
    ],
    "description": "Accompanies PHSC 2303. Covers topics from the course through various experiments.",
    "coreqs": [{ "subject": "PHSC", "number": "2303" }],
    "prereqs": [
      { "subject": "PHSC", "number": "2301" },
      "And",
      { "subject": "PHSC", "number": "2302" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "2320",
    "title": "Biochemistry",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10481" }],
    "description": "Introduces the structures, functions, and metabolism of amino acids, proteins, carbohydrates, lipids, and nucleic acids. Discusses the mechanisms of enzyme reactions, enzyme kinetics, vitamins, biological oxidation-reduction reactions, and bioenergetics, as well as various inborn errors of metabolism.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "PHSC", "number": "2301" },
      "Or",
      { "subject": "BIOL", "number": "2217" },
      "Or",
      { "subject": "BIOL", "number": "1117" },
      ")",
      "And",
      "(",
      { "subject": "BIOL", "number": "1113" },
      "Or",
      { "subject": "BIOL", "number": "1103" },
      ")",
      "And"
    ]
  },
  {
    "subject": "PHSC",
    "number": "2330",
    "title": "Immunology",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30461" }],
    "description": "Provides students with an understanding of the principles, mechanisms, organs, cells, and molecules of the innate and adaptive immunity. Monoclonal antibodies, organ transplant immunity, hypersensitivity, tolerance, tumor immunity, autoimmunity, and immunodeficiencies are discussed in light of potential therapeutic interventions. Weekly journal club-style presentation of related assigned topic is required.",
    "coreqs": [],
    "prereqs": [
      "(",
      "(",
      { "subject": "PHSC", "number": "2303" },
      "Or",
      { "subject": "BIOL", "number": "2219" },
      ")",
      "And",
      { "subject": "PHSC", "number": "2320" },
      ")",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "PHSC",
    "number": "2400",
    "title": "Research Ethics for Beginning Health Scientists",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["ER"],
    "sections": [{ "term": "202310", "crn": "15152" }],
    "description": "Explores various dimensions of ethical research. Introduces ethical foundations and controversies that are central to understanding and developing appropriate ethical frameworks for engaging in research. Requires students to work collaboratively to carefully develop essential skills for ethical analysis and evaluation of professional code of conduct concerns.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "2650",
    "title": "Introduction to Health Science Research",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32582" }],
    "description": "Surveys research methods and topics relevant to health science research with the goal of engaging undergraduate students to commit to research training throughout at least one semester and possibly continuing throughout their undergraduate program. Exposes students to lectures addressing the benefits of a research experience and readings of original literature. Health science faculty from across the university present their lines of research focusing on projects that would be available to students. Seeks to familiarize students with use of the scientific method in addressing unsolved problems and to prepare them to select the most appropriate research laboratory to engage in research.",
    "coreqs": [],
    "prereqs": [
      { "subject": "BIOL", "number": "1111" },
      "And",
      "(",
      "Or",
      ")",
      "And",
      "(",
      { "subject": "MATH", "number": "1241" },
      "Or",
      { "subject": "MATH", "number": "1245" },
      ")"
    ]
  },
  {
    "subject": "PHSC",
    "number": "3411",
    "title": "Pharmaceutics 1",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10482" }],
    "description": "Develops an understanding of pharmaceutical dosage forms, with emphasis on solids, liquids, semisolids, parenterals, inhalation, and novel drug delivery systems. Combines the discussion of pharmaceutical products developed in industry and those compounded in local pharmacies. Focuses on application of mathematical principles and problem-solving skills in pharmaceutical compounding.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "MATH", "number": "1241" },
      "Or",
      { "subject": "MATH", "number": "1245" },
      "Or",
      { "subject": "MATH", "number": "1341" },
      ")",
      "And",
      "And",
      "(",
      { "subject": "PHYS", "number": "1145" },
      "Or",
      { "subject": "PHYS", "number": "1149" },
      "Or",
      { "subject": "PHYS", "number": "1161" },
      ")",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "PHSC",
    "number": "3430",
    "title": "Pharmacokinetics and Biopharmaceutics",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": ["AD"],
    "sections": [{ "term": "202330", "crn": "30456" }],
    "description": "Focuses on the basic principles and methods of biopharmaceutics and pharmacokinetics. Covers the kinetics of drug absorption, distribution, metabolism, and excretion; linear and nonlinear pharmacokinetics; general concept of one- and two-compartment models with instantaneous (i.v. bolus), zero order (i.v. infusion), or first order (oral administration or i.m. injection) input; evaluation of bioavailability and investigation of the factors affecting drug availability; influence of the route of administration, dosage form, and regimen on bioavailability of drugs; bioequivalence study; multiple dosing kinetics; general approaches to dosage adjustment in renal disease; noncompartmental analysis; and pharmacokinetic-pharmacodynamic modeling.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "3412" },
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "PHSC",
    "number": "4501",
    "title": "Pharmacology/Medicinal Chemistry 1",
    "scheduleType": "Lecture",
    "credits": 5,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10358" }],
    "description": "Introduces the principles and basic concepts of pharmacology and the general mechanisms of drug action including drug receptor interactions. Discusses the major drug classes affecting the peripheral autonomic and central nervous systems including anxiolytics, sedative-hypnotics, anesthetics, anticonvulsants, neuroleptics, antidepressants, and antimanic agents. Considers therapeutic uses, mechanisms of drug action, and undesirable actions including side effects and adverse reactions.",
    "coreqs": [],
    "prereqs": [
      "(",
      "(",
      { "subject": "PHSC", "number": "2303" },
      "Or",
      { "subject": "BIOL", "number": "2219" },
      ")",
      "And",
      ")",
      "Or",
      "Graduate Admission"
    ]
  },
  {
    "subject": "PHSC",
    "number": "4997",
    "title": "Senior Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [{ "term": "202310", "crn": "21195" }],
    "description": "Offers students an opportunity to prepare an undergraduate thesis under faculty supervision.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "4998",
    "title": "Senior Thesis Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202330", "crn": "39310" }],
    "description": "Offers students an opportunity to execute a project as described in PHSC 4997, which involves laboratory work; skill development; and the ability to generate, analyze, and report valid and reproducible data with the highest level of honesty and integrity. Students write and defend a thesis project to a public audience that describes the scientific background and context of the research, the hypothesis tested, methods utilized, and experimental results obtained. The thesis also includes interpretation of data, its contribution to the field, and future directions for the research. Students are expected to demonstrate motivation and initiative and to develop skills necessary to work cooperatively with a faculty mentor and other lab personnel.",
    "coreqs": [],
    "prereqs": [{ "subject": "PHSC", "number": "4997" }]
  },
  {
    "subject": "PHSC",
    "number": "5100",
    "title": "Concepts in Pharmaceutical Science",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10730" }],
    "description": "Introduces new students in the Pharmaceutical Science Graduate Program to important concepts in medicinal and combinatorial chemistry as they relate to drug discovery, and a brief overview of pharmacology, drug metabolism, pharmacokinetics, and toxicology. Also introduces the major drug receptor families and their signaling pathways.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5102",
    "title": "Concepts in Pharmaceutical Science 2",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13638" }],
    "description": "Presents key concepts and challenges of drug design, development, and evaluation. Integrates the principles of drug design, development, and delivery in a discussion of both small-molecule formulations and biologics. Contextualizes the hallmarks along the path of preclinical drug design to clinical translation. Components of the course include Team-Based Learning (TBL) and professionalism. The TBL sessions offer students an opportunity to work on course-related team applications and include graded peer evaluations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5212",
    "title": "Research Skills and Ethics",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14220" },
      { "term": "202330", "crn": "33880" }
    ],
    "description": "Teaches students the basics of laboratory safety, safekeeping laboratory data, and the process of writing a grant proposal. Also, case studies explore the concepts of data distortion or fabrication, conflicts of interest, confidentiality, ethical aspects of peer review, and the attribution of credit in science.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5305",
    "title": "Professional Development for Pharmaceutical Sciences",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12044" },
      { "term": "202330", "crn": "31789" }
    ],
    "description": "Introduces and examines the goals, expectations, policies, and procedures of the Masters' in Pharmaceutical Sciences internship program and professionalism in the field. Discusses the role and involvement of internship employers. Offers students an opportunity to develop job search and career management skills; assess their workplace skills, interests, and values; discuss how those qualities impact career decisions; prepare a professional resumé; and learn proper interviewing techniques. Issues of ethics and professionalism are designed to inform students of issues they will face in the pharmaceutical field. Content of this course is geared to students' participation in the internship program and overall professional development in pharmaceutical sciences.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5310",
    "title": "Cellular Physiology",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "31445" }],
    "description": "Focuses in-depth on the major cellular physiological mechanisms, including physiology of the cell membrane, ion channels and transport phenomena, energy production, signal transduction, synapses, and physiological processes in the cytosol. Relates physiological information on the specific areas of pharmacology, pharmaceutics, and drug discovery/development. Offers students an opportunity to obtain an understanding of the principles of cellular physiology.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5400",
    "title": "Principles of Drug Design",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12691" }],
    "description": "Studies important aspects of drug discovery and development with a focus on drug design. Covers basic organic medicinal chemistry concepts and seeks to build students' skills in lead compound discovery, structure-activity relationship studies, and lead optimization strategies. Topics include the fundamentals of pharmacology, pharmacokinetics, and pharmacodynamics of therapeutic agents relevant to the drug-structure optimization. These skills often help develop a strong foundation in the concepts that govern the multidisciplinary process of drug discovery. Uses lectures and peer-reviewed seminar presentations to help students to incrementally increase their knowledge required to identify new, marketable therapeutic agents. Requires organic or medicinal chemistry at the undergraduate level.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5450",
    "title": "Contemporary Approaches to Drug Design",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38364" }],
    "description": "Introduces current and emerging trends and concepts in drug discovery in the context of targeted disease therapy and structure-based drug design. Reviews and discusses topics on target selection and validation, computational drug design tools, kinase inhibitors, proteolysis targeting chimeras and molecular glues, covalent drugs, cannabinoid receptors, RNA-targeting small molecule agents, and protein-protein interaction modulators. Exemplifies the applications of general medicinal chemistry and pharmacology principles to real-world drug discovery and development.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5500",
    "title": "Repurposing Drugs for Cancer Immunotherapies",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32030" }],
    "description": "Offers a multidisciplinary course targeted to students interested in recent advances in biomedical research, clinical practice, and personalized medicine as related to cancer immunotherapies. Describes current promises and disappointments with cancer immunotherapies and recent FDA drug approvals for personalized cancer therapies. Explains the role of immunological and physiological negative regulators of antitumor and tumor biology as needed. Explains underlying principles of immunology, biochemistry, genetics, and preclinical and clinical studies when introducing new concepts. Assigned detailed study of specific areas and discussion of assigned papers are designed to complement classroom material.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5555",
    "title": "Pharmaceutical Toxicology",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "12659" }],
    "description": "Covers fundamental concepts of toxicology and technical methods in toxicology along with comprehensive analysis of both in-vitro and in-vivo toxicity in drug discovery and development. Through lectures given by experts in various fields in toxicology on several topics required for specialized work in research, industrial, and clinical settings, offers students an opportunity to become familiar with methods and analyses including in-vitro and in-vivo toxicity assessments and toxicokinetic-toxicodynamic models and analyses. Includes mechanistic basis of toxicity, methods of toxicological analysis, and case studies pertinent to topics. Requires undergraduate physiology or biochemistry.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5560",
    "title": "Nanotoxicity",
    "scheduleType": "Lecture",
    "credits": 3,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14261" }],
    "description": "Studies nanotoxicity, the adverse health effects of nanoparticles. Due to their small size, nanoparticles easily cross biological barriers, entering body fluids and cells. Nanoparticles toxicity may cause chronic and acute pathologies. Offers students an opportunity to develop and understand the principles of nanotoxicity. Focuses on mechanisms of cellular and organ damage by nanoparticles. Discusses ports of nanoparticle entry and detrimental effects upon blood, CNS, lungs, and GI system. Stresses mechanisms of intracellular degradation of nanoparticles and toxic effects of nanoparticles upon human cells and major organ systems. Reviews mechanisms of cellular and organ damage including oxidative stress, inflammation, and DNA, as well as toxic effects on nonmammalian cells.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "5976",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13671" },
      { "term": "202330", "crn": "37944" },
      { "term": "202310", "crn": "21283" }
    ],
    "description": "Offers independent work under the direction of members of the department on a chosen topic. Course content depends on instructor. May be repeated without limit.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "5100" },
      "Or",
      { "subject": "PHSC", "number": "5100" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "6213",
    "title": "Ethical Problems in Health Sciences Research",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "34234" }],
    "description": "Focuses on a series of cases that raise ethical and professional code of conduct concerns and engages with them collaboratively and carefully to develop essential skills for ethical analysis and evaluation. Scientific practice presents researchers and citizens with myriad ethical challenges. Engaging with those ethical challenges in ways that help yield the benefits of research while respecting ethical boundaries is furthered by not only understanding ethical frameworks but by carefully analyzing and evaluating ethical concerns in context.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "6212" },
      "Or",
      { "subject": "PHSC", "number": "5212" },
      "Or",
      { "subject": "PHSC", "number": "2400" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "6214",
    "title": "Experimental Design and Biostatistics",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32165" }],
    "description": "Discusses fundamental principles of experimental design and statistical analysis, with emphasis on clinical research. Topics include descriptive statistics, hypothesis testing, analysis of variance, correlation, regression, chi-square test, and nonparametric methods.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6216",
    "title": "Human Physiology and Pathophysiology",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "10729" }],
    "description": "Introduces major topics in human physiology, emphasizing knowledge essential to health-related laboratory research. Topics include neurophysiology, immunology, cardiovascular, respiratory, renal, and gastrointestinal physiology and endocrinology.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6222",
    "title": "The Chemistry and Biology of Drugs of Abuse",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14204" }],
    "description": "Provides an interdisciplinary introduction to substance abuse, including the medicinal chemistry and neurobiology of drugs that act through the opioid, dopamine, acetylcholine, and cannabinoid systems.  Compares and contrasts neurochemical mechanisms that are common to many addictive agents and those that are specific to individual drug classes.  Highlights the involvement of the brain dopamine system and differences and discusses similarities between the pharmacology of abused and therapeutic drugs, together with the development of medications for treating drug dependence.  Includes lectures by experts on particular topics of their own recent research.  Introduces students to key aspects of biological and chemical research as they pertain to drug abuse and its treatment.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6224",
    "title": "Behavioral Pharmacology and Drug Discovery",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38365" }],
    "description": "Designed to prepare students to understand the advantages, shortcomings, and pitfalls of the use of live, behaving animals in drug discovery.  Covers an in-depth analysis of ethical issues in animal research, as well as aspects of animal behavioral models, behavior and brain biochemistry, and methods of behavioral analysis.  Specific topics include psychopharmacology; fear and anxiety; pain and stress; depression and reward; general arousal and tolerance; drug abuse and habitual behaviors.  The ways in which animal behaviors can be described in a quantitative manner and the effects of medications and abused drugs quantified and related to human diseases and drug responses are an important component of the course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6235",
    "title": "Magnetic Resonance Imaging in Drug Discovery 1",
    "scheduleType": "Lab",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "14174" }],
    "description": "Integrates physics, mathematics, and neuroscience with the cutting-edge technology of magnetic resonance imaging (MRI) to address drug discovery in the treatment of CNS disorders. Students design their own experiments guided by knowledge of the literature and technical and statistical limitations. Offers students an opportunity to run a state-of-the-art 7.0 Tesla MR animal scanner housed in the Center for Translational NeuroImaging (CTNI) at Northeastern and set parameters for anatomical and functional imaging protocols. Original imaging data is collected and analyzed. This is a discovery-based research course that encourages critical thinking and transdisciplinary learning skills involving an original research project in magnetic resonance imaging related to early drug discovery.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "5100" },
      "Or",
      { "subject": "PHSC", "number": "5100" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "6237",
    "title": "Magnetic Resonance Imaging in Drug Discovery 2",
    "scheduleType": "Lab",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "35586" }],
    "description": "Continues PHSC 6235. Offers students an opportunity to continue their research work in early drug discovery using original imaging data that was previously analyzed. Focuses on manuscript preparation and submission to a peer-reviewed journal.",
    "coreqs": [],
    "prereqs": [{ "subject": "PHSC", "number": "6235" }]
  },
  {
    "subject": "PHSC",
    "number": "6290",
    "title": "Biophysical Methods in Drug Discovery",
    "scheduleType": "Lecture",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "32706" }],
    "description": "Provides an interdisciplinary introduction to biophysical methods used in modern drug discovery, including hit generation and lead optimization. Emphasizes key experimental methods, including nuclear magnetic resonance (NMR) spectroscopy and X-ray crystallography, as well as computer modeling as applied to ligand- and structure-based drug design. Includes lectures by experts on related topics from their recent drug-discovery research. Presented under the auspices of the Center for Drug Discovery. Requires permission of instructor for students of junior or senior standing.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6300",
    "title": "Pharmaceutical Science Seminar",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10728" },
      { "term": "202310", "crn": "10636" },
      { "term": "202310", "crn": "11239" },
      { "term": "202330", "crn": "30751" },
      { "term": "202330", "crn": "31109" },
      { "term": "202330", "crn": "31130" }
    ],
    "description": "Teaches students to evaluate critically the scientific literature in a journal club format. Several sections may be offered each semester to accommodate different specializations or interest groups. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6401",
    "title": "Pharmaceutical Science Internship",
    "scheduleType": "Off-campus instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10583" },
      { "term": "202260", "crn": "60163" },
      { "term": "202240", "crn": "40130" },
      { "term": "202330", "crn": "31508" }
    ],
    "description": "Offers an experiential component of the graduate curriculum that fosters professional development through internship in drug discovery, development, and/or regulatory affairs in a pharmaceutical or biotechnology company. Requires students to work in a company for a minimum of twenty hours per week. Offers students an opportunity to engage in pharmaceutical science research or to work in an environment outside the University but under the supervision of a faculty instructor. May be repeated up to three times.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6760",
    "title": "Doctoral Pharmaceutical Science Research 1",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20237" }],
    "description": "Offers PhD research in preparation for thesis proposal.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6810",
    "title": "Pharmaceutical Science Colloquium",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "13684" },
      { "term": "202330", "crn": "30750" }
    ],
    "description": "Requires students to present one formal seminar on their research. This presentation is open to all those interested.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "6990",
    "title": "Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "15408" },
      { "term": "202310", "crn": "18148" },
      { "term": "202310", "crn": "18571" },
      { "term": "202310", "crn": "21047" },
      { "term": "202330", "crn": "33510" },
      { "term": "202330", "crn": "37143" },
      { "term": "202310", "crn": "21491" }
    ],
    "description": "Offers research/experimental work for master's thesis. Students may register twice. May be repeated once.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "7010",
    "title": "Pharmaceutical Sciences Laboratory",
    "scheduleType": "Lab",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11172" },
      { "term": "202330", "crn": "30921" }
    ],
    "description": "Offers a hands-on graduate laboratory course that introduces students to the investigative approaches and laboratory methods used in contemporary pharmaceutical sciences research. Laboratory exercises have a practical relationship to essential techniques in modern drug discovery, drug targeting and delivery, and determining mechanisms of drug action. These exercises cover basic laboratory skills, the rationale for and application of standard laboratory methods, training in the use of equipment and techniques central to pharmaceutical sciences research, how to maintain a laboratory notebook, statistical analysis and interpretation of data, and how to present research results in technical laboratory reports.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "8940",
    "title": "Doctoral Training and Research",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11079" }],
    "description": "Intended to show full-time status for pharmaceutical science PhD students in the semester in which they are taking the comprehensive exam. In addition to successfully completing the comprehensive exam, students are expected to perform research in preparation for the doctoral proposal; the grade for this course documents successful performance.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "8986",
    "title": "Doctoral Full-Time Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10667" },
      { "term": "202330", "crn": "30749" }
    ],
    "description": "Expects student to conduct full-time research in an adviser's laboratory. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "PHSC",
    "number": "9681",
    "title": "Doctoral Proposal",
    "scheduleType": "Individual Instruction",
    "credits": 2,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "11031" },
      { "term": "202330", "crn": "31770" }
    ],
    "description": "Offers preparation of PhD dissertation proposal and proposal defense before dissertation committee. Requires passing of comprehensive exam. May be repeated without limit.",
    "coreqs": [],
    "prereqs": [{ "subject": "PHSC", "number": "8940" }]
  },
  {
    "subject": "PHSC",
    "number": "9990",
    "title": "Dissertation Term 1",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10725" },
      { "term": "202330", "crn": "30748" }
    ],
    "description": "Offers research/experimental work for PhD thesis.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "9681" },
      "And",
      { "subject": "PHSC", "number": "9000" }
    ]
  },
  {
    "subject": "PHSC",
    "number": "9991",
    "title": "Dissertation Term 2",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14959" },
      { "term": "202330", "crn": "34909" }
    ],
    "description": "Offers dissertation supervision by members of the department.",
    "coreqs": [],
    "prereqs": [{ "subject": "PHSC", "number": "9990" }]
  },
  {
    "subject": "PHSC",
    "number": "9996",
    "title": "Dissertation Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10724" },
      { "term": "202330", "crn": "31765" }
    ],
    "description": "Offers continuation of PhD dissertation research.",
    "coreqs": [],
    "prereqs": [
      { "subject": "PHSC", "number": "9991" },
      "Or",
      "Dissertation Check"
    ]
  }
]
