[
  {
    "subject": "SBSY",
    "number": "5100",
    "title": "Sustainable Design and Technologies in Construction",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "11975" }],
    "description": "Covers theory of sustainability and green building procedures; sustainable design and construction practices; use of appropriate materials and systems with low environmental impact for creating energy-efficient buildings; green construction practices, including reducing pollution, emissions, and construction waste; and U.S. Green Building Council's LEED rating system. May be helpful to students preparing for the LEED Green Associate examination.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SBSY",
    "number": "5200",
    "title": "Sustainable Engineering Systems for Buildings",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "31938" },
      { "term": "202330", "crn": "38208" }
    ],
    "description": "Focuses on the design and construction of sustainable mechanical/electrical/plumbing (MEP) systems in buildings. Covers MEP documentation, plumbing water supply, HVAC systems, electrical power supply and distribution, lighting systems, low-voltage electrical systems, and estimating and planning for these specialty areas. Addresses sustainable design and construction practices for MEP, including minimization of energy consumption and carbon footprint. Requires one semester of building physics, environmental systems, or equivalent.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SBSY",
    "number": "5250",
    "title": "Building Performance Simulation",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19078" }],
    "description": "Studies principles of building performance simulations and the application of these tools to improve the design and operation of buildings. Covers the basic principles of simulation and uses a spectrum of available tools for early stage modeling, daylight estimation, analysis of comfort, and whole building validation. Introduces interpretation and validation of results and code-mandated protocols.",
    "coreqs": [],
    "prereqs": [{ "subject": "SBSY", "number": "5200" }]
  },
  {
    "subject": "SBSY",
    "number": "5400",
    "title": "Sustainable Building Systems Seminar",
    "scheduleType": "Seminar",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "12546" },
      { "term": "202330", "crn": "38209" }
    ],
    "description": "Features prominent speakers from the sustainable building design and construction industry to showcase new building technologies, tools, and projects and to discuss national and international trends in the industry. Offers students an opportunity to meet innovators and key players advancing the field of sustainable building systems. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SBSY",
    "number": "7990",
    "title": "Thesis",
    "scheduleType": "Individual Instruction",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "20952" }],
    "description": "Offers analytical and/or experimental research conducted by arrangement with and under the supervision of the department. May be repeated up to a maximum of 8 SH.",
    "coreqs": [],
    "prereqs": []
  }
]
