[
  {
    "subject": "SOCL",
    "number": "1000",
    "title": "Sociology at Northeastern",
    "scheduleType": "Lecture",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "14113" },
      { "term": "202330", "crn": "34637" }
    ],
    "description": "Intended for first-year students in the College of Social Sciences and Humanities. Introduces students to liberal arts; familiarizes them with their major; develops the academic skills necessary to succeed (analytical ability and critical thinking); provides grounding in the culture and values of the University community; and helps to develop interpersonal skills—in short, familiarizes students with all skills needed to become a successful university student.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "1101",
    "title": "Introduction to Sociology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [
      { "term": "202310", "crn": "14164" },
      { "term": "202310", "crn": "15352" },
      { "term": "202310", "crn": "10091" },
      { "term": "202310", "crn": "14902" },
      { "term": "202310", "crn": "15172" },
      { "term": "202310", "crn": "19694" },
      { "term": "202310", "crn": "20278" },
      { "term": "202310", "crn": "20355" },
      { "term": "202310", "crn": "20404" },
      { "term": "202310", "crn": "20740" },
      { "term": "202260", "crn": "61224" },
      { "term": "202260", "crn": "61409" },
      { "term": "202260", "crn": "61435" },
      { "term": "202240", "crn": "41376" },
      { "term": "202240", "crn": "41708" },
      { "term": "202240", "crn": "41787" },
      { "term": "202330", "crn": "30268" },
      { "term": "202330", "crn": "33484" },
      { "term": "202330", "crn": "34638" },
      { "term": "202330", "crn": "34639" },
      { "term": "202330", "crn": "34640" },
      { "term": "202330", "crn": "37310" },
      { "term": "202330", "crn": "39297" }
    ],
    "description": "Explores diverse social phenomena, from how people try to look their best in face-to-face interactions; to how race, gender, and class shape identities and social conditions; to how industrial capitalism came to dominate the world. Offers students an opportunity to gain a grasp of key sociological theories and empirical research on topics such as social order, social conflict, and social change, as well as learn to identify social forces that shape human behavior, explain how these forces affect individuals and social groups, and make valid predictions about how they may shape future behavior or events.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "1102",
    "title": "Sex, Gender, and Popular Culture",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "IC"],
    "sections": [
      { "term": "202310", "crn": "19525" },
      { "term": "202310", "crn": "20427" },
      { "term": "202310", "crn": "20479" },
      { "term": "202310", "crn": "20569" },
      { "term": "202310", "crn": "21081" },
      { "term": "202310", "crn": "21293" }
    ],
    "description": "Examines how femininities, masculinities, and different forms of sexual identity are produced and represented within popular culture. Using theories and concepts from both feminist/sexuality studies and popular culture studies, analyzes popular texts and media for their treatment of gender and sexuality and the intersection of those categories with racial and class identities. Explores the visual representation of women (and men) and analyzes how visual and textual media shape our attitudes and identities. Required reading and assignments include close readings of texts, film screenings, class discussions and activities, writing assignments, and creative projects.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "1235",
    "title": "Social Psychology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202330", "crn": "36212" }],
    "description": "Studies the relationship between society and the individual. Focuses on three theoretical perspectives—symbolic interactionism, social structure and personality, and group processes—in order to understand how human behavior is tied to social and cultural contexts and how individuals shape and are shaped by group interaction. Topics may include socialization and how people develop a “social sense of self”; cross-cultural differences in interactional styles; pressures to conform to roles and stereotypes; deviance and mental health; inequality based on race/ethnicity, social class, and gender; identity formation and change, attitudes, and behavior, including prejudice and discrimination; and collective behavior, including social movements.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "1246",
    "title": "Environment and Society",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [
      { "term": "202310", "crn": "10456" },
      { "term": "202310", "crn": "20517" },
      { "term": "202260", "crn": "61225" },
      { "term": "202330", "crn": "33104" }
    ],
    "description": "Examines the social, political, and economic forces behind the global environmental crisis. Topics include such issues as global warming and climate disruption, world resource availability and the global economic crisis, environmental justice and social inequities in the exposure to ecological hazards, science and technology, environmental degradation in the Third World, globalization and unfair trade, state power and the role of the polluter-industrial complex in the United States, the history of the environmental movement, and exemplary environmental policies and programs. This theoretically oriented course also involves practical experience in environmental problem solving.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "1260",
    "title": "Gender in a Changing Society",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [
      { "term": "202310", "crn": "11335" },
      { "term": "202240", "crn": "41377" }
    ],
    "description": "Considers why and how gender is socially constructed in U.S. society and looks at different theories of gender. Explores gender as an institution as well as different (cultural) expressions of masculinities and femininities. Includes topics of gender in everyday life as well as gender as an organizing principle in the institutions of families, education, workplaces, sexualities, religion, the media, politics, and forms of gender violence. SOCL 1260 and WMNS 1260 are cross-listed.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "1280",
    "title": "The Twenty-First-Century Workplace",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [
      { "term": "202310", "crn": "14188" },
      { "term": "202330", "crn": "38232" }
    ],
    "description": "Analyzes the transformation of work since the advent of industrial capitalism. Emphasizes the organization and experience of work since World War II and the contemporary shifts underway in the wake of deindustrialization, the rise of service work, the emergence of the internet, the platform revolution, and the globalization of business organizations. Topics include the shifting nature of authority relations at work; changing forms of labor control; types of workplace culture in traditional and high-tech settings; and efforts to identify and reduce bias against women, minorities, and members of the LGBTQ community. Addresses dilemmas arising from the introduction of advanced technologies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "2303",
    "title": "Gender and Reproductive Justice",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202330", "crn": "38255" }],
    "description": "Introduces the social, legal, and economic barriers to accessing reproductive healthcare domestically and internationally. Draws on various theoretical and analytic tools including critical race theory, critical legal theory, sociology of science, human rights, feminist theory, and a range of public health methods. Access to reproductive health services, including abortion, is one of the most contested political, social, cultural, and religious issues today. Covers domestic, regional, and international legal and regulatory frameworks on sexual reproductive health. HIST 2303, SOCL 2303, and WMNS 2303 are cross-listed.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "2320",
    "title": "Statistical Analysis in Sociology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["AD"],
    "sections": [{ "term": "202330", "crn": "39336" }],
    "description": "Offers students an opportunity to obtain knowledge and skills essential for understanding the theory and practice of social statistics commonly used in social research. Topics covered include the operationalization of abstract concepts; descriptive statistics; correlation; bivariate regression; central limit theorem; confidence intervals; hypothesis testing; and key concepts such as association, causation, and spurious relationships. Statistical software is used to complete assignments.",
    "coreqs": [],
    "prereqs": [{ "subject": "SOCL", "number": "1101" }]
  },
  {
    "subject": "SOCL",
    "number": "2321",
    "title": "Research Methods in Sociology",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "10391" },
      { "term": "202330", "crn": "30253" }
    ],
    "description": "Introduces students to the range of research methods used by sociologists. Covers experimental research, field research, survey research, and historical-comparative research. Sampling, the rules of evidence in empirical research, research ethics, and the place of values are discussed. Required for sociology majors.",
    "coreqs": [],
    "prereqs": [{ "subject": "SOCL", "number": "1101" }]
  },
  {
    "subject": "SOCL",
    "number": "2355",
    "title": "Race, Identity, Social Change, and Empowerment",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD"],
    "sections": [
      { "term": "202310", "crn": "16734" },
      { "term": "202330", "crn": "38234" }
    ],
    "description": "Introduces and sensitizes students to the forms, practices, and effects of racism and discrimination on the various populations in the United States and presents frameworks for understanding and working with people with histories of discrimination and different cultural identities. Pays special attention to human services with diverse populations in schools, prisons, and employment assistance programs.",
    "coreqs": [],
    "prereqs": [{ "subject": "SOCL", "number": "1101" }]
  },
  {
    "subject": "SOCL",
    "number": "2358",
    "title": "Current Issues in Cities and Suburbs",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [
      { "term": "202310", "crn": "12703" },
      { "term": "202310", "crn": "20428" },
      { "term": "202310", "crn": "20476" },
      { "term": "202310", "crn": "20477" },
      { "term": "202310", "crn": "20478" },
      { "term": "202310", "crn": "20570" },
      { "term": "202310", "crn": "20571" },
      { "term": "202310", "crn": "21082" },
      { "term": "202330", "crn": "36216" },
      { "term": "202330", "crn": "39296" },
      { "term": "202310", "crn": "21294" }
    ],
    "description": "Introduces students to pressing urban issues: urban sprawl, poverty, education, transportation, economic development, and housing, through an intensive analysis of the Boston metropolitan area. The course is cotaught by university faculty and practitioners in government, community, and nonprofit organizations throughout the metropolitan area. Offers students the opportunity to analyze Boston data, go on outings to see development in progress, talk with urban practitioners about what they do, and conduct research on an urban issue of their choice.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "2485",
    "title": "Environment, Technology, and Society",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202310", "crn": "16976" }],
    "description": "Focuses on the connections between the development of modern nation-states and the control of nature. Explores the role human societies play in such events as climate change, tsunamis, and droughts. Asks how industrialization and the process of science and technology development are related to our transforming environmental conditions, as well as how the social sciences, the sciences, and engineering are transforming to address these issues. Draws on social theory, environmental history, anthropology/sociology, art/design, and open-source technologies to investigate theoretically and methodologically the sources, experiences of, and solutions for environmental health questions.",
    "coreqs": [],
    "prereqs": [
      { "subject": "ANTH", "number": "1101" },
      "Or",
      { "subject": "CRIM", "number": "1100" },
      "Or",
      { "subject": "HUSV", "number": "1101" },
      "Or",
      { "subject": "INTL", "number": "1101" },
      "Or",
      { "subject": "POLS", "number": "1140" },
      "Or",
      { "subject": "POLS", "number": "1160" },
      "Or",
      { "subject": "SOCL", "number": "1101" },
      "Or"
    ]
  },
  {
    "subject": "SOCL",
    "number": "2500",
    "title": "Race and Global Human Mobility",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202310", "crn": "20162" }],
    "description": "Examines the relationship between race and the movement of people around the globe. Offers students an opportunity to acquire a concrete understanding of how race and ethnicity (as social constructions) have developed as people have migrated (under free will or forced circumstances) within and across geopolitical territories (e.g, colonies, countries) in the past (1400s) and through the present. Ethnoracial-related conflicts connected to migration (e.g., rebellions by the enslaved during the Atlantic slave trade, Rwandan genocide, Syrian civil war) may also be explored.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "3100",
    "title": "Gender, Social Justice, and Transnational Activism",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202310", "crn": "19723" }],
    "description": "Introduces key issues, themes, and debates in feminist transnational theory, practice, and activism in contemporary contexts and how it has changed under socioeconomic, political, and cultural processes of globalization. Examines differences among women relating to race, class, sexuality, national identity, and political economy in reckoning with possibilities for sustainable social justice. Students interrogate the relationship between the local and global; the production of knowledge in different regional spaces; the pragmatics of political mobilization; the varying contours of “social justice”; and other key issues. Offers students an opportunity to discuss the impact of globalization, neoliberalism, and state and intimate violence on gendered politics and relations and to contend with the politics of difference, to debate its challenges, and to imagine possible futures for transnational gender justice.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "3241",
    "title": "Violence and Society",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202310", "crn": "19533" }],
    "description": "Examines the notion of violence and its pervasive presence in the social institutions we create and maintain every day. Addresses key debates and findings in sociological literature on violence, drawing on other disciplines as they prove helpful. Sociology tells us that the beliefs, values, and norms that characterize the United States legitimize the preference for violence, largely through the obvious venues of the mass media that glorify violence but also in the subtler structural arrangements collectively constructed and maintained in our everyday behaviors. Offers students an opportunity to understand how the structure of our society and its social institutions inhibit or facilitate violent behavior.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "3270",
    "title": "Race and Ethnic Relations",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202330", "crn": "39298" }],
    "description": "Focuses on the social construction of race and ethnicity and the nature of dominant/minority relations in the United States. Emphasizes the peculiar evolution of race relations in U.S. history, the political and economic conditions that have transformed race relations, and the nature of contemporary racial and ethnic relations in the United States. Topics include immigration, ethnic and racial identity, discrimination, and race-based policies (e.g., residential restrictive codes, Jim Crow segregation). Offers students an opportunity to develop a critical lens from which to observe and interpret contemporary debates over structural racism.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "3300",
    "title": "Social Theory",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [
      { "term": "202310", "crn": "16284" },
      { "term": "202330", "crn": "39337" }
    ],
    "description": "Reviews the dominant theoretical traditions in classical and contemporary sociology, showing the links between the social thought of the eighteenth and nineteenth centuries and current social thought.",
    "coreqs": [],
    "prereqs": [
      { "subject": "SOCL", "number": "1101" },
      "And",
      "(",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      ")"
    ]
  },
  {
    "subject": "SOCL",
    "number": "3407",
    "title": "The Immigrant Experience: Ethnicity, Race, and Inequality in America",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202330", "crn": "39299" }],
    "description": "Presents the sociological study of immigration in the United States. Emphasizes the ways U.S. institutions (e.g., federal, state and local governments, the legal system, economy, schools, families) have shaped immigrant integration and incorporation and vice versa. Presents theories and concepts that explain how experiences of integration and incorporation differ for disparate groups of immigrants and their children due to their associated social categories including race, class, gender, sexuality and citizenship. Examines how local and state institutions (Boston and Massachusetts, respectively) have shaped immigrant integration in recent years.",
    "coreqs": [],
    "prereqs": [
      { "subject": "SOCL", "number": "1101" },
      "Or",
      { "subject": "ANTH", "number": "1101" },
      "Or",
      { "subject": "HUSV", "number": "1101" },
      "Or",
      { "subject": "CRIM", "number": "1100" },
      "Or",
      { "subject": "INTL", "number": "1101" },
      "Or",
      "Or",
      { "subject": "POLS", "number": "1140" },
      "Or",
      { "subject": "POLS", "number": "1160" }
    ]
  },
  {
    "subject": "SOCL",
    "number": "3441",
    "title": "Sociology of Health and Illness",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI", "WI"],
    "sections": [{ "term": "202310", "crn": "19534" }],
    "description": "Offers a substantial overview of the sociology of health and illness. Medical sociology is an important subfield of sociology with important links to public health, social psychology, psychology, and other medical fields. Emphasizes several critical areas: society and disease; theoretical understandings of health inequalities; medicalization and social control; healthcare professions and professionalization; and the American healthcare system. Offers students an opportunity to obtain analytical frameworks to explore other topics in medical sociology not covered in this course.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "3450",
    "title": "Class, Power, and Social Change",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [
      { "term": "202310", "crn": "19535" },
      { "term": "202330", "crn": "34642" }
    ],
    "description": "Explores theories and research on the institutionalized forms of inequality that have accompanied the rise of advanced capitalism in Western society. Major topics include the competing definitions of class that have developed among social scientists; the relation between class and race in the United States; how class and gender have intersected historically; and the link between workers' movements, political systems, and the forms that capitalist development has assumed in Western Europe and the United States. Students conduct projects in which they explore the conceptions of social justice held by members of subordinate groups.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "3468",
    "title": "Social Movements",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202330", "crn": "39338" }],
    "description": "Introduces the social, cultural, and political dynamics that surround social movements, both historically and in the contemporary world. Emphasizes theory and research on national and transnational social movements, including studies of revolutions and political upheavals, racial justice and demands for civil and human rights, movements for gender equality, and other instances of movements for social and political change. Focuses on how structural factors shape social movement emergence and development and how social movements in turn shape the structure of societies.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "4520",
    "title": "Race, Class, and Gender",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["WI"],
    "sections": [{ "term": "202260", "crn": "61250" }],
    "description": "Considers the intersection of race, class, and gender in social structure, institutions, and people's lives. Utilizes an interdisciplinary approach to focus on the socially constructed nature of these concepts and how they shape and create meaning in individual lives. Difference with an emphasis on inequality and varying life chances is central for understanding our society and is central to our work. Requires a significant amount of reading. Class format is like a seminar; students are expected to participate, take responsibility, and write a paper. SOCL 4520 and WMNS 4520 are cross-listed.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "SOCL", "number": "1101" },
      "Or",
      { "subject": "ANTH", "number": "1101" },
      "Or",
      { "subject": "CRIM", "number": "1100" },
      "Or",
      { "subject": "HUSV", "number": "1101" },
      "Or",
      { "subject": "INTL", "number": "1101" },
      "Or",
      { "subject": "POLS", "number": "1140" },
      "Or",
      { "subject": "POLS", "number": "1160" },
      "Or",
      ")",
      "And",
      "(",
      { "subject": "ENGW", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      "Or",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGL", "number": "1102" },
      ")"
    ]
  },
  {
    "subject": "SOCL",
    "number": "4522",
    "title": "Environmental Justice",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["SI", "WI"],
    "sections": [
      { "term": "202240", "crn": "41440" },
      { "term": "202330", "crn": "38235" },
      { "term": "202330", "crn": "39188" }
    ],
    "description": "Offers students an opportunity to engage in advanced social science research on topics relating to environmental justice, citizen science, and environmental health. Examines various environmental justice topics with the goal of producing a research project or paper. Case studies examined include the impacts of toxic waste dumping on human health and the environment, the role of global climate change in creating new waves of migration around the world, the rise of the Slow Food movement, and the relationship between environmental and data justice. Studies how to redesign research methods, tools, and processes to support environmental justice.",
    "coreqs": [],
    "prereqs": [
      "(",
      { "subject": "ANTH", "number": "1101" },
      "Or",
      { "subject": "CRIM", "number": "1100" },
      "Or",
      { "subject": "HUSV", "number": "1101" },
      "Or",
      { "subject": "HUSV", "number": "2400" },
      "Or",
      "(",
      { "subject": "HUSV", "number": "2401" },
      "Or",
      ")",
      "Or",
      { "subject": "INTL", "number": "1101" },
      "Or",
      { "subject": "PHIL", "number": "1180" },
      "Or",
      { "subject": "POLS", "number": "1140" },
      "Or",
      { "subject": "POLS", "number": "1160" },
      "Or",
      { "subject": "SOCL", "number": "1101" },
      "Or",
      { "subject": "SOCL", "number": "1246" },
      "Or",
      ")",
      "And",
      "(",
      { "subject": "ENGL", "number": "1102" },
      "Or",
      { "subject": "ENGL", "number": "1111" },
      "Or",
      { "subject": "ENGW", "number": "1102" },
      "Or",
      { "subject": "ENGW", "number": "1111" },
      ")"
    ]
  },
  {
    "subject": "SOCL",
    "number": "4526",
    "title": "Afro-Asian Relations in the Americas",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["DD", "SI"],
    "sections": [{ "term": "202330", "crn": "38236" }],
    "description": "Examines the comparative racialization of Blacks and Asians in the Americas and relations between these communities. Introduces sociological theories of race/ethnicity, a chronology of Afro-Asian relations in the United States, and the impact of 1970s deindustrialization and post–1965 Asian immigration. Covers the internationalism of Black and Asian leaders (e.g., W.E.B. du Bois and Mao Tse-Tung) in the developing nations and the overlapping Civil Rights, Black Power, and Asian American movements.",
    "coreqs": [],
    "prereqs": [
      { "subject": "SOCL", "number": "1101" },
      "Or",
      { "subject": "ANTH", "number": "1101" },
      "Or",
      { "subject": "CRIM", "number": "1100" },
      "Or",
      { "subject": "HUSV", "number": "1101" },
      "Or",
      "Or",
      { "subject": "POLS", "number": "1140" },
      "Or",
      { "subject": "POLS", "number": "1160" }
    ]
  },
  {
    "subject": "SOCL",
    "number": "4600",
    "title": "Senior Seminar",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": ["CE", "WI"],
    "sections": [
      { "term": "202310", "crn": "19701" },
      { "term": "202310", "crn": "20795" },
      { "term": "202330", "crn": "33045" }
    ],
    "description": "Offers students an opportunity to integrate and apply knowledge of the discipline by building on completed course work and conducting original research on a topic of their choice. Requires students to produce a research paper due at the end of the semester. This seminar operates as an intellectual workshop in which students share the process, as well as the results, of their research with the group. The class comes together to inform, guide, critique, and support one another's research efforts in a collaborative fashion. Students are expected to make constructive comments on the work of others and to freely exchange ideas.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "5240",
    "title": "Feminist Resistance",
    "scheduleType": "Lecture",
    "credits": 4,
    "nuPath": ["SI"],
    "sections": [{ "term": "202330", "crn": "39080" }],
    "description": "Engages students in the study of a variety of forms of feminist resistance in recent history, emphasizing the United States in the context of cross-cultural examples. Examines key feminist texts and manifestos and studies feminist activism in coalition with other social movements. Students identify and analyze unique features of gender-based activism in itself and in its intersections with other social movements, including movements and activism focused on race, class, sexuality, and physical ability.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7001",
    "title": "Proseminar 1: Acclimating to Graduate School",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19779" },
      { "term": "202310", "crn": "20868" }
    ],
    "description": "Helps first-year students develop a firm understanding of the PhD Sociology program requirements and helps them develop beneficial skills and strategies to complete those requirements in a timely manner. Focus on relevant topics such as articulating learning expectations from the graduate program; developing individual timelines and time management strategies to meet those expectations; identifying resources on campus and beyond that are needed to meet learning expectations; and developing concrete goals for acquiring appropriate writing, reading skills, and research areas expertise in the PhD program.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7002",
    "title": "Proseminar 2: Academic Planning",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "38237" },
      { "term": "202330", "crn": "38238" }
    ],
    "description": "Helps first-year students further develop beneficial skills and strategies to complete program requirements by building on the first semester proseminar. Focuses on relevant topics such as networking, building, and developing a team of mentors and peer supports; writing and talking about research; getting research funded; and learning wellness strategies for surviving graduate school.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7003",
    "title": "Proseminar 3: Committee, Topics, and Reading Lists",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "19780" },
      { "term": "202310", "crn": "20869" }
    ],
    "description": "Helps students develop beneficial skills and strategies to complete program requirements and become more professionalized as sociologists. This third proseminar provides the structure and peer feedback designed to help students build and work through their first field statement reading list. Students produce an annotated bibliography. The weekly exercises are designed to help students create the reading list in collaboration with faculty mentors and other experts in the field.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7004",
    "title": "Proseminar 4: Field Statement Writing",
    "scheduleType": "Seminar",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202330", "crn": "38239" },
      { "term": "202330", "crn": "38240" }
    ],
    "description": "Offers students an opportunity to develop beneficial skills and strategies to complete program requirements and to become more professionalized as sociologists. Students share field statement drafts, participate in peer evaluations, and practice giving constructive criticism on others’ work and address others’ critical feedback. Students draft a field statement or publishable paper.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7200",
    "title": "Foundations of Social Theory 1",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "13120" }],
    "description": "Studies the classic theorists including Durkheim, Weber, Marx, and others.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7201",
    "title": "Foundations of Social Theory 2",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "30701" }],
    "description": "Reviews the dominant theoretical traditions in contemporary sociology, examining the key assumptions, terminology, weaknesses, and strengths of the pluralist, managerialist, neo-Marxist, feminist, and postmodern paradigms. Strives not only to expose students to the giants in the field but, more important, to give students the intellectual tools to situate entire theoretical traditions vis-&#224;-vis one another. Introduces students to various schools of thought. Offers students the opportunity to learn &#8220;how to think&#8221; sociologically and theoretically&#8212;that is, to go beyond simplistic and descriptive accounts of social phenomena to offer more systematic and insightful explanations.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7221",
    "title": "Globalization, Development, and Social Justice",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "36219" }],
    "description": "Explores the rise of neoliberal globalization and its impact on local and national communities around the world. Examines complex patterns of resistance, including place-based struggles and transnational social movements. Combines theoretical analysis of global capitalism, development, the politics of resistance, and reformist/radical alternatives with the study of concrete struggles in defense of land, labor and human rights, indigenous cultures and identities, and ecological sustainability.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7226",
    "title": "Economy, Politics, and Social Change",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19997" }],
    "description": "Offers a broad survey of scholarly debates on the redistribution of political power, economic power, and social capital across the globe. Emphasizes an ethnographic analysis of how colonial and imperial legacies inform contemporary arrangements that structure inequality and how political imaginations are exercised through aesthetics, identities, and institutions. Considers how experiments with economic justice and juridical and political forms of justice find expression in contemporary grassroots movements and theories. Draws on interdisciplinary conversations from the social sciences and humanities to examine and compare radical forms of social change across various global contexts.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7256",
    "title": "Contemporary Issues in Sociology",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "36571" }],
    "description": "Political Sociology",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7263",
    "title": "Social Psychology of Stratification",
    "scheduleType": "Seminar",
    "credits": 4,
    "nuPath": [],
    "sections": [{ "term": "202310", "crn": "19537" }],
    "description": "Explores the social psychological dimensions of structured social inequality. Overviews the “social psychologies” embedded in the classical social theorists, then explores the literature on sociological social psychology (as opposed to its psychological cousin), identifying key theoretical frameworks and focusing on “social structure and personality” (or “social structure and attitudes”) research. Explores relevant literatures on various “subjective” responses to stratification including the self-concept, stratum (that is, race, class, or gender) identification and consciousness, the process of legitimation, stratification beliefs (or stratification ideology), racial attitudes, and links between these phenomena and various policy attitudes and preferences (support for affirmative action, wealth redistribution, and so on). Also explores the ways in which such responses may contribute to the maintenance and reproduction of the status quo (social reproduction), and social change.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "7976",
    "title": "Directed Study",
    "scheduleType": "Individual Instruction",
    "credits": 1,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "20298" },
      { "term": "202260", "crn": "61410" },
      { "term": "202260", "crn": "61415" },
      { "term": "202330", "crn": "37499" },
      { "term": "202310", "crn": "21524" },
      { "term": "202310", "crn": "21662" }
    ],
    "description": "Comprises reading and research directed by a faculty member. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "8960",
    "title": "Exam Preparation&#8212;Doctoral",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17564" },
      { "term": "202330", "crn": "38241" },
      { "term": "202310", "crn": "21161" },
      { "term": "202310", "crn": "21315" },
      { "term": "202310", "crn": "21333" },
      { "term": "202310", "crn": "21357" },
      { "term": "202310", "crn": "21625" }
    ],
    "description": "Taken while completing one of two PhD field statements under faculty supervision.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "8986",
    "title": "Research",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17560" },
      { "term": "202330", "crn": "38242" },
      { "term": "202310", "crn": "21527" }
    ],
    "description": "Offers the student the opportunity to conduct full-time research. May be repeated without limit.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "9000",
    "title": "PhD Candidacy Achieved",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [{ "term": "202330", "crn": "38243" }],
    "description": "Indicates successful completion of the doctoral comprehensive exam.",
    "coreqs": [],
    "prereqs": []
  },
  {
    "subject": "SOCL",
    "number": "9990",
    "title": "Dissertation Term 1",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17561" },
      { "term": "202330", "crn": "38244" }
    ],
    "description": "Offers theoretical and experimental work conducted under the supervision of a departmental faculty.",
    "coreqs": [],
    "prereqs": [{ "subject": "SOCL", "number": "9000" }]
  },
  {
    "subject": "SOCL",
    "number": "9991",
    "title": "Dissertation Term 2",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17562" },
      { "term": "202310", "crn": "20638" },
      { "term": "202330", "crn": "38245" },
      { "term": "202330", "crn": "38246" }
    ],
    "description": "Offers dissertation supervision by members of the department.",
    "coreqs": [],
    "prereqs": [{ "subject": "SOCL", "number": "9990" }]
  },
  {
    "subject": "SOCL",
    "number": "9996",
    "title": "Dissertation Continuation",
    "scheduleType": "Individual Instruction",
    "credits": 0,
    "nuPath": [],
    "sections": [
      { "term": "202310", "crn": "17563" },
      { "term": "202310", "crn": "19538" },
      { "term": "202310", "crn": "19539" },
      { "term": "202310", "crn": "19540" },
      { "term": "202310", "crn": "19541" },
      { "term": "202310", "crn": "19542" },
      { "term": "202310", "crn": "19543" },
      { "term": "202310", "crn": "19544" },
      { "term": "202310", "crn": "19545" },
      { "term": "202310", "crn": "19546" },
      { "term": "202310", "crn": "19547" },
      { "term": "202310", "crn": "19548" },
      { "term": "202330", "crn": "38247" },
      { "term": "202330", "crn": "39216" },
      { "term": "202330", "crn": "39217" },
      { "term": "202330", "crn": "39218" },
      { "term": "202330", "crn": "39219" },
      { "term": "202330", "crn": "39220" },
      { "term": "202330", "crn": "39221" },
      { "term": "202330", "crn": "39222" },
      { "term": "202330", "crn": "39223" }
    ],
    "description": "Offers continued thesis work conducted under the supervision of a departmental faculty.",
    "coreqs": [],
    "prereqs": [
      { "subject": "SOCL", "number": "9991" },
      "Or",
      "Dissertation Check"
    ]
  }
]
